[{"level":1,"heirachical_structure":"Broad occupational category","code":"0","title":"Management occupations"},{"level":2,"heirachical_structure":"Major group","code":"00","title":"Senior management occupations"},{"level":3,"heirachical_structure":"Minor group","code":"001","title":"Legislators and senior management"},{"level":4,"heirachical_structure":"Unit group","code":"0011","title":"Legislators","description":"Legislators participate in the activities of a federal, provincial, territorial or local government legislative body or executive council, band council or school board as elected or appointed members."},{"level":4,"heirachical_structure":"Unit group","code":"0012","title":"Senior government managers and officials","description":"Senior government managers and officials plan, organize, direct, control and evaluate, through middle managers, the major activities of municipal or regional governments or of provincial, territorial or federal departments, boards, agencies or commissions. They establish the direction to be taken by these organizations in accordance with legislation and policies made by elected representatives or legislative bodies."},{"level":4,"heirachical_structure":"Unit group","code":"0013","title":"Senior managers - financial, communications and other business services","description":"Senior managers in this unit group are usually appointed by a board of directors, to which they report. They work either alone or in conjunction with the board of directors to develop and establish objectives for the company, and to develop or approve policies and programs. They plan, organize, direct, control and evaluate, through middle managers, the operations of their organization in relation to established objectives. They work in establishments throughout the telecommunications, finance, insurance, real estate, and data processing, hosting and related services industries as well as other business service industries."},{"level":4,"heirachical_structure":"Unit group","code":"0014","title":"Senior managers - health, education, social and community services and membership organizations","description":"Senior managers in this unit group plan, organize, direct, control and evaluate, through middle managers, membership and other organizations or institutions that deliver health, education, social or community services. They formulate policies which establish the direction to be taken by these organizations, either alone or in conjunction with a board of directors. They are employed in health care organizations, educational services, social and community services and membership organizations."},{"level":4,"heirachical_structure":"Unit group","code":"0015","title":"Senior managers - trade, broadcasting and other services, n.e.c.","description":"Senior managers in this unit group plan, organize, direct, control and evaluate, through middle managers, trade, broadcasting and other service companies not elsewhere classified. They formulate policies which establish the direction to be taken by these companies, either alone or in conjunction with a board of directors. They work in establishments in broadcasting and related media services, wholesale trade, retail trade, accommodation and food service, and other services not elsewhere classified."},{"level":4,"heirachical_structure":"Unit group","code":"0016","title":"Senior managers - construction, transportation, production and utilities","description":"Senior managers in this unit group plan, organize, direct, control and evaluate, through middle managers, the overall operations of goods production, utility, transportation and construction companies. They formulate policies which establish the direction to be taken by these companies, either alone or in conjunction with other members of a board of directors. They work in establishments throughout the following industries: fishing, forestry, logging and agriculture; mining, oil and gas extraction; construction; transportation and warehousing; printing; manufacturing; and utilities."},{"level":2,"heirachical_structure":"Major group","code":"01-05","title":"Specialized middle management occupations"},{"level":3,"heirachical_structure":"Minor group","code":"011","title":"Administrative services managers"},{"level":4,"heirachical_structure":"Unit group","code":"0111","title":"Financial managers","description":"Financial managers plan, organize, direct, control and evaluate the operation of financial and accounting departments. They develop and implement the financial policies and systems of establishments. Financial managers establish performance standards and prepare various financial reports for senior management. They are employed in financial and accounting departments in companies throughout the private sector and in government."},{"level":4,"heirachical_structure":"Unit group","code":"0112","title":"Human resources managers","description":"Human resources managers plan, organize, direct, control and evaluate the operations of human resources and personnel departments, and develop and implement policies, programs and procedures regarding human resource planning, recruitment, collective bargaining, training and development, occupation classification and pay and benefit administration. They represent management and participate actively on various joint committees to maintain ongoing relations between management and employees. Human resources managers are employed throughout the private and public sectors."},{"level":4,"heirachical_structure":"Unit group","code":"0113","title":"Purchasing managers","description":"Purchasing managers plan, organize, direct, control and evaluate the activities of a purchasing department and develop and implement the purchasing policies of a business or institution. They are employed throughout the public and private sectors."},{"level":4,"heirachical_structure":"Unit group","code":"0114","title":"Other administrative services managers","description":"This unit group includes managers who plan, organize, direct, control and evaluate departments responsible for corporate governance and regulatory compliance, records management, security services, admissions and other administrative services not elsewhere classified. Also included in this unit group are managers responsible for departments involved in two or more of the following activities: finance, human resources, purchasing, computer systems or administrative services. Managers in this unit group are employed throughout the public and private sector."},{"level":3,"heirachical_structure":"Minor group","code":"012","title":"Managers in financial and business services"},{"level":4,"heirachical_structure":"Unit group","code":"0121","title":"Insurance, real estate and financial brokerage managers","description":"Insurance, real estate and financial brokerage managers plan, organize, direct, control and evaluate the activities of departments or establishments that provide insurance, mortgage, real estate and investment services. They are generally responsible for business development and must ensure that their group reaches performance levels related to established objectives. They are employed by insurance companies, real estate firms, stockbrokers, investment dealers, mortgage brokers and security and commodity exchanges."},{"level":4,"heirachical_structure":"Unit group","code":"0122","title":"Banking, credit and other investment managers","description":"Banking, credit and other investment managers plan, organize, direct, control and evaluate the activities of financial establishments or operational departments within such establishments, or credit departments in industrial and commercial establishments. They oversee business development and manage overall performance in accordance with established strategic directions and policies. Banking managers are employed by banks, trust companies and credit unions. Credit managers are employed by credit departments in department stores, utility companies, car dealerships, insurance companies or other industrial or commercial organizations. Other investment managers are employed by credit card companies, consumer loan companies, mutual fund investment firms, mortgage investment companies or other financial establishments concerned with extending loans and financing and investments."},{"level":4,"heirachical_structure":"Unit group","code":"0124","title":"Advertising, marketing and public relations managers","description":"Advertising, marketing and public relations managers plan, organize, direct, control and evaluate the activities of establishments and departments involved in commercial, industrial and e-business advertising, marketing and public relations. They are employed by commercial and industrial establishments, government departments, and advertising, marketing and public relations firms or consulting businesses."},{"level":4,"heirachical_structure":"Unit group","code":"0125","title":"Other business services managers","description":"Managers in this unit group plan, organize, direct, control and evaluate the operations of establishments that provide services to business, and ensure the quality of those services and client satisfaction. They work in fields such as management consulting, market research, personnel and payroll services, contact centre services and security services."},{"level":3,"heirachical_structure":"Minor group","code":"013","title":"Managers in communication (except broadcasting)"},{"level":4,"heirachical_structure":"Unit group","code":"0131","title":"Telecommunication carriers managers","description":"This unit group includes managers who plan, organize, direct, control and evaluate the operations of a telecommunications establishment, department or facility. They are employed by wired, wireless, satellite and other telecommunications carriers."},{"level":4,"heirachical_structure":"Unit group","code":"0132","title":"Postal and courier services managers","description":"Postal and courier services managers plan, organize, direct, control and evaluate the activities and operations in postal facilities and in establishments that provide courier services. They are employed by Canada Post Corporation and by courier companies."},{"level":3,"heirachical_structure":"Minor group","code":"021","title":"Managers in engineering, architecture, science and information systems"},{"level":4,"heirachical_structure":"Unit group","code":"0211","title":"Engineering managers","description":"Engineering managers plan, organize, direct, control and evaluate the activities of an engineering department, service or firm. They are employed by a wide range of private sector and government establishments and by consulting engineering and scientific research companies."},{"level":4,"heirachical_structure":"Unit group","code":"0212","title":"Architecture and science managers","description":"Architecture and science managers plan, organize, direct, control and evaluate the activities of an architecture, landscape architecture, scientific or statistical department, service or firm. They are employed by a wide range of private sector and government establishments as well as by architectural firms and scientific research companies."},{"level":4,"heirachical_structure":"Unit group","code":"0213","title":"Computer and information systems managers","description":"Computer and information systems managers plan, organize, direct, control and evaluate the activities of organizations that analyze, design, develop, implement, operate and administer computer and telecommunications software, networks and information systems. They are employed throughout the public and private sectors."},{"level":3,"heirachical_structure":"Minor group","code":"031","title":"Managers in health care"},{"level":4,"heirachical_structure":"Unit group","code":"0311","title":"Managers in health care","description":"This unit group includes managers who plan, organize, direct, control and evaluate the delivery of health care services, such as diagnosis and treatment, nursing and therapy, within institutions, and in other settings, that provide health care services. They are employed in hospitals, medical clinics, nursing homes and other health care organizations."},{"level":3,"heirachical_structure":"Minor group","code":"041","title":"Managers in public administration"},{"level":4,"heirachical_structure":"Unit group","code":"0411","title":"Government managers - health and social policy development and program administration","description":"Government managers in this unit group plan, organize, direct, control and evaluate the development and administration of health care policies, social policies and related programs designed to protect and promote the health and social welfare of individuals and communities. These managers are employed by government departments and agencies."},{"level":4,"heirachical_structure":"Unit group","code":"0412","title":"Government managers - economic analysis, policy development and program administration","description":"Government managers in this unit group plan, organize, direct, control and evaluate economic policy, research and programs in areas of government activity such as taxation, international trade, labour markets, transportation or agriculture. They also plan and direct policies and programs to promote industrial and commercial business development in urban and rural areas. They are employed in government departments and agencies."},{"level":4,"heirachical_structure":"Unit group","code":"0413","title":"Government managers - education policy development and program administration","description":"Government managers in this unit group plan, organize, direct, control and evaluate the development and administration of elementary, secondary and post-secondary education policies and programs. They are employed by government departments and agencies."},{"level":4,"heirachical_structure":"Unit group","code":"0414","title":"Other managers in public administration","description":"Managers in this unit group plan, organize, direct, control and evaluate the development of policies and programs which govern the daily operations of legislatures and other activities unique to government such as intergovernmental affairs and elections. They are employed by government departments, agencies and legislative bodies."},{"level":3,"heirachical_structure":"Minor group","code":"042","title":"Managers in education and social and community services"},{"level":4,"heirachical_structure":"Unit group","code":"0421","title":"Administrators - post-secondary education and vocational training","description":"This unit group includes faculty administrators and registrars of colleges or universities and administrators of vocational training schools. Faculty administrators manage the academic and related activities of faculties of colleges or universities. Registrars manage registration activities and academic records systems of colleges or universities. Administrators of vocational training schools manage the operations of vocational schools specializing in trades, technology, business or other vocational subjects."},{"level":4,"heirachical_structure":"Unit group","code":"0422","title":"School principals and administrators of elementary and secondary education","description":"School principals plan, organize, direct, control and evaluate the activities of teachers and other staff of an elementary or secondary school. They are employed by public and private schools. Administrators of elementary and secondary education plan, organize, direct, control and evaluate the academic affairs of a school system. They are employed by school boards."},{"level":4,"heirachical_structure":"Unit group","code":"0423","title":"Managers in social, community and correctional services","description":"This unit group includes managers who plan, organize, direct, control and evaluate the programs and activities of social service and community agencies, correctional institutions, counselling departments, labour organizations, professional associations, political parties and non-governmental organizations."},{"level":3,"heirachical_structure":"Minor group","code":"043","title":"Managers in public protection services"},{"level":4,"heirachical_structure":"Unit group","code":"0431","title":"Commissioned police officers","description":"Commissioned police officers plan, organize, direct, control and evaluate police force administration and police activities such as maintaining law and order and detecting and preventing crime. They are employed by municipal, provincial and federal governments. This unit group includes officers from the rank of staff sergeant to police commissioner. Commissioned officers in the railway police are also included in this unit group."},{"level":4,"heirachical_structure":"Unit group","code":"0432","title":"Fire chiefs and senior firefighting officers","description":"Fire chiefs and senior firefighting officers plan, organize, direct, control and evaluate firefighting operations and fire prevention activities in fire departments. Fire chiefs and senior firefighting officers are employed by municipal and federal governments and by industrial establishments with firefighting services."},{"level":4,"heirachical_structure":"Unit group","code":"0433","title":"Commissioned officers of the Canadian Forces","description":"This unit group consists of commissioned officers of the Canadian Forces who plan, organize, command and evaluate the activities of personnel in the Canadian Forces. All ranks of commissioned officers in the Air Force, Army, and Navy are included in this unit group."},{"level":3,"heirachical_structure":"Minor group","code":"051","title":"Managers in art, culture, recreation and sport"},{"level":4,"heirachical_structure":"Unit group","code":"0511","title":"Library, archive, museum and art gallery managers","description":"This unit group includes managers who plan, organize, direct, control and evaluate the activities of libraries, archives, museums, art galleries or departments within such institutions. They are employed in libraries, archives, museums and non-retail art galleries."},{"level":4,"heirachical_structure":"Unit group","code":"0512","title":"Managers - publishing, motion pictures, broadcasting and performing arts","description":"Managers in this unit group plan, organize, direct, control and evaluate operations within publishing firms, film, theatre and record production companies and broadcasting facilities. They are employed by radio and television stations, by newspaper, periodical and book publishing firms, and by film, theatre, record and video production companies."},{"level":4,"heirachical_structure":"Unit group","code":"0513","title":"Recreation, sports and fitness program and service directors","description":"This unit group includes managers who plan, organize, direct, control and evaluate the operations of comprehensive recreational, sports and fitness programs and services, national or provincial sports governing agencies and professional athletic teams. They are employed by municipalities, community and private recreational and fitness organizations, sports governing agencies and professional athletic team organizations."},{"level":2,"heirachical_structure":"Major group","code":"06","title":"Middle management occupations in retail and wholesale trade and customer services"},{"level":3,"heirachical_structure":"Minor group","code":"060","title":"Corporate sales managers"},{"level":4,"heirachical_structure":"Unit group","code":"0601","title":"Corporate sales managers","description":"Corporate sales managers plan, organize, direct, control and evaluate the activities of establishments and departments involved in commercial, industrial, institutional, e-business and wholesale and retail sales. They are employed by commercial, industrial and wholesale and retail trade establishments."},{"level":3,"heirachical_structure":"Minor group","code":"062","title":"Retail and wholesale trade managers"},{"level":4,"heirachical_structure":"Unit group","code":"0621","title":"Retail and wholesale trade managers","description":"Retail and wholesale trade managers plan, organize, direct, control and evaluate the operations of establishments that sell merchandise or services on a retail or wholesale basis. Retail and wholesale trade managers are employed by retail and wholesale sales establishments or they may own and operate their own store."},{"level":3,"heirachical_structure":"Minor group","code":"063","title":"Managers in food service and accommodation"},{"level":4,"heirachical_structure":"Unit group","code":"0631","title":"Restaurant and food service managers","description":"Restaurant and food service managers plan, organize, direct, control and evaluate the operations of restaurants, bars, cafeterias and other food and beverage services. They are employed in food and beverage service establishments, or they may be self-employed."},{"level":4,"heirachical_structure":"Unit group","code":"0632","title":"Accommodation service managers","description":"Accommodation service managers plan, organize, direct, control and evaluate the operations of an accommodation establishment or of a department within such an establishment. They are employed by hotels, motels, resorts, student residences and other accommodation establishments, or they may be self-employed."},{"level":3,"heirachical_structure":"Minor group","code":"065","title":"Managers in customer and personal services, n.e.c."},{"level":4,"heirachical_structure":"Unit group","code":"0651","title":"Managers in customer and personal services, n.e.c.","description":"This unit group includes managers of establishments that provide services not elsewhere classified, such as dry cleaning, hairdressing or residential cleaning. This group also includes managers of schools that provide non-vocational instruction in driving, languages, music, dance, art, cooking or fashion."},{"level":2,"heirachical_structure":"Major group","code":"07-09","title":"Middle management occupations in trades, transportation, production and utilities"},{"level":3,"heirachical_structure":"Minor group","code":"071","title":"Managers in construction and facility operation and maintenance"},{"level":4,"heirachical_structure":"Unit group","code":"0711","title":"Construction managers","description":"Construction managers plan, organize, direct, control and evaluate the activities of a construction company or a construction department within a company, under the direction of a general manager or other senior manager. They are employed by residential, commercial and industrial construction companies and by construction departments of companies outside the construction industry."},{"level":4,"heirachical_structure":"Unit group","code":"0712","title":"Home building and renovation managers","description":"Home building managers or builders own, operate and manage companies engaged in the construction of new residential homes. Home renovation managers or renovators own, operate and manage companies engaged in the renovation of existing residential homes."},{"level":4,"heirachical_structure":"Unit group","code":"0714","title":"Facility operation and maintenance managers","description":"Facility operation managers plan, organize, direct, control and evaluate the operations of commercial, transportation and recreational facilities and the included real estate. Facility operation managers are employed by a wide range of establishments, such as airports, harbours, canals, shopping centres, convention centres, warehouses and recreational facilities. Maintenance managers plan, organize, direct, control and evaluate the maintenance department within commercial, industrial, institutional, recreational and other facilities. Maintenance managers are employed by a wide range of establishments, such as office buildings, shopping centres, airports, harbours, warehouses, grain terminals, universities, schools and sports facilities, and by the maintenance and mechanical engineering departments of manufacturing and other industrial establishments."},{"level":3,"heirachical_structure":"Minor group","code":"073","title":"Managers in transportation"},{"level":4,"heirachical_structure":"Unit group","code":"0731","title":"Managers in transportation","description":"Managers in transportation operations plan, organize, direct, control and evaluate the operations of transportation companies such as railways, airlines, bus lines, municipal transit systems, shipping lines and trucking companies, under the direction of a general manager or other senior manager. Managers in transportation freight traffic plan, organize, direct, control and evaluate companies or departments responsible for the transportation and movement of goods, under the direction of a general manager or other senior manager. They are employed by transportation, freight forwarding and shipping companies and by transportation departments of companies in retail and manufacturing sectors and utilities."},{"level":3,"heirachical_structure":"Minor group","code":"081","title":"Managers in natural resources production and fishing"},{"level":4,"heirachical_structure":"Unit group","code":"0811","title":"Managers in natural resources production and fishing","description":"This unit group includes managers who plan, organize, direct, control and evaluate the operations of establishments in forestry and logging, mining and quarrying, oil and gas drilling, production and servicing operations, and commercial fishing."},{"level":3,"heirachical_structure":"Minor group","code":"082","title":"Managers in agriculture, horticulture and aquaculture"},{"level":4,"heirachical_structure":"Unit group","code":"0821","title":"Managers in agriculture","description":"Managers in agriculture plan, organize, direct, control and evaluate the operations and functions of farms. They are responsible for growing crops, raising and breeding livestock, poultry and other animals and marketing farm products. Managers in this unit group usually own and operate their own establishment."},{"level":4,"heirachical_structure":"Unit group","code":"0822","title":"Managers in horticulture","description":"Managers in horticulture plan, organize, direct and control the activities of nursery and greenhouse staff who grow and market trees, shrubs, flowers and plants."},{"level":4,"heirachical_structure":"Unit group","code":"0823","title":"Managers in aquaculture","description":"Managers in aquaculture manage operations of facilities which cultivate and harvest fish, shellfish or marine plants for replenishment of wildlife stocks or for commercial sale. They are employed by public or private fish hatcheries and commercial aquatic farms, or they may be self-employed."},{"level":3,"heirachical_structure":"Minor group","code":"091","title":"Managers in manufacturing and utilities"},{"level":4,"heirachical_structure":"Unit group","code":"0911","title":"Manufacturing managers","description":"Manufacturing managers plan, organize, direct, control and evaluate the operations of a manufacturing establishment or of a production department within a manufacturing establishment, under the direction of a general manager or other senior manager. They are employed by manufacturing companies."},{"level":4,"heirachical_structure":"Unit group","code":"0912","title":"Utilities managers","description":"This unit group includes managers who plan, organize, direct, control and evaluate the operations of utility companies or services of heating fuel distribution companies. The services provided include treatment of water and waste, distribution of water, electricity, natural gas and heating oil to residential, commercial and industrial consumers, waste disposal and waste recycling. Utilities managers are employed in public and private sector utilities and in heating fuel distribution companies."},{"level":1,"heirachical_structure":"Broad occupational category","code":"1","title":"Business, finance and administration occupations"},{"level":2,"heirachical_structure":"Major group","code":"11","title":"Professional occupations in business and finance"},{"level":3,"heirachical_structure":"Minor group","code":"111","title":"Auditors, accountants and investment professionals"},{"level":4,"heirachical_structure":"Unit group","code":"1111","title":"Financial auditors and accountants","description":"Financial auditors examine and analyze the accounting and financial records of individuals and establishments to ensure accuracy and compliance with established accounting standards and procedures. Accountants plan, organize and administer accounting systems for individuals and establishments. Articling students in accounting firms are included in this unit group. Financial auditors and accountants are employed by auditing and accounting firms throughout the private and public sectors, or they may be self-employed."},{"level":4,"heirachical_structure":"Unit group","code":"1112","title":"Financial and investment analysts","description":"Financial and investment analysts collect and analyze financial information such as economic forecasts, trading volumes and the movement of capital, financial backgrounds of companies, historical performances and future trends of stocks, bonds and other investment instruments to provide financial and investment or financing advice for their company or their company's clients. Their studies and evaluations cover areas such as takeover bids, private placements, mergers or acquisitions. Financial analysts are employed by a wide range of establishments throughout the private and public sector, such as banks, brokerage houses, insurance companies, investment companies, manufacturing firms, trust companies, utility companies and underwriting firms. Investment analysts are employed primarily by brokerage houses and fund management companies."},{"level":4,"heirachical_structure":"Unit group","code":"1113","title":"Securities agents, investment dealers and brokers","description":"Securities agents and investment dealers buy and sell stocks, bonds, treasury bills, mutual funds and other securities for individual investors, pension fund managers, banks, trust companies, insurance firms and other establishments. Brokers buy and sell stocks, bonds, commodity futures, foreign currencies and other securities at stock exchanges on behalf of investment dealers. They are employed by investment companies, stock brokerage firms, stock and commodity exchanges and other establishments in the securities industry."},{"level":4,"heirachical_structure":"Unit group","code":"1114","title":"Other financial officers","description":"This unit group includes professional occupations in finance not elsewhere classified such as financial planners, financial examiners and inspectors, financial investigators, financial underwriters, mortgage brokers and trust officers. They are employed by banks, trust companies, investment firms and governments, or they may be self-employed."},{"level":3,"heirachical_structure":"Minor group","code":"112","title":"Human resources and business service professionals"},{"level":4,"heirachical_structure":"Unit group","code":"1121","title":"Human resources professionals","description":"Human resources professionals develop, implement and evaluate human resources and labour relations policies, programs and procedures and advise managers and employers on human resources matters. Human resources professionals are employed throughout the private and public sectors, or they may be self-employed."},{"level":4,"heirachical_structure":"Unit group","code":"1122","title":"Professional occupations in business management consulting","description":"This unit group includes those who provide services to management such as analyzing the structure, operations, managerial methods or functions of an organization in order to propose, plan and implement improvements. They are employed by management consulting firms and throughout the public and private sectors or are self-employed."},{"level":4,"heirachical_structure":"Unit group","code":"1123","title":"Professional occupations in advertising, marketing and public relations","description":"This unit group includes specialists in advertising, marketing and public relations who analyse, develop and implement communication and promotion strategies and information programs, analyse advertising needs and develop appropriate advertising and marketing plans, publicize activities and events, and maintain media relations on behalf of businesses, governments and other organizations, and for performers, athletes, writers and other talented individuals. They are employed by consulting firms, advertising agencies, corporations, associations, government, social agencies, museums, galleries, public interest groups, and cultural and other organizations, or they may be self-employed. Agents such as entertainment, literary and sports agents are included in this unit group."},{"level":2,"heirachical_structure":"Major group","code":"12","title":"Administrative and financial supervisors and administrative occupations"},{"level":3,"heirachical_structure":"Minor group","code":"121","title":"Administrative services supervisors"},{"level":4,"heirachical_structure":"Unit group","code":"1211","title":"Supervisors, general office and administrative support workers","description":"Supervisors in this unit group supervise and co-ordinate the activities of workers in minor groups: General Office Workers (141) and Office Equipment Operators (142). They are employed throughout the public and private sectors."},{"level":4,"heirachical_structure":"Unit group","code":"1212","title":"Supervisors, finance and insurance office workers","description":"Supervisors in this unit group supervise and co-ordinate the activities of workers in the following unit groups: Accounting and Related Clerks (1431), Payroll Clerks (1432), Banking, Insurance and Other Financial Clerks (1434) and Collectors (1435). They are employed by banks and other financial institutions, insurance companies, and by other establishments throughout the private and public sectors."},{"level":4,"heirachical_structure":"Unit group","code":"1213","title":"Supervisors, library, correspondence and related information workers","description":"Supervisors in this unit group supervise and co-ordinate the activities of workers in the following unit groups: Library Assistants and Clerks (1451), Correspondence, Publication and Regulatory Clerks (1452) and Survey Interviewers and Statistical Clerks (1454). They are employed throughout the private and public sectors."},{"level":4,"heirachical_structure":"Unit group","code":"1214","title":"Supervisors, mail and message distribution occupations","description":"Supervisors in this unit group supervise and co-ordinate the activities of workers in the following unit groups: Mail, Postal and Related Workers (1511), Letter Carriers (1512) and Couriers, Messengers and Door-to-Door Distributors (1513). They are employed by Canada Post Corporation, courier companies, governments and large corporations."},{"level":4,"heirachical_structure":"Unit group","code":"1215","title":"Supervisors, supply chain, tracking and scheduling co-ordination occupations","description":"Supervisors in this unit group supervise and co-ordinate the activities of workers in the following unit groups: Shippers and Receivers (1521), Storekeepers and Partspersons (1522), Production Logistics Co-ordinators (1523), Purchasing and Inventory Control Workers (1524), Dispatchers (1525) and Transportation Route and Crew Schedulers (1526). They are employed throughout the private and public sectors."},{"level":3,"heirachical_structure":"Minor group","code":"122","title":"Administrative and regulatory occupations"},{"level":4,"heirachical_structure":"Unit group","code":"1221","title":"Administrative officers","description":"Administrative officers oversee and implement administrative procedures, establish work priorities, conduct analyses of administrative operations and co-ordinate acquisition of administrative services such as office space, supplies and security services. They are employed throughout the private and public sectors. Administrative officers who are supervisors are included in this group."},{"level":4,"heirachical_structure":"Unit group","code":"1222","title":"Executive assistants","description":"Executive assistants co-ordinate administrative procedures, public relations activities and research and analysis functions for members of legislative assemblies, ministers, deputy ministers, corporate officials and executives, committees and boards of directors. They are employed by governments, corporations and associations."},{"level":4,"heirachical_structure":"Unit group","code":"1223","title":"Human resources and recruitment officers","description":"Human resources and recruitment officers identify and advertise job vacancies, recruit candidates, and assist in the selection and reassignment of employees. They are employed throughout the private and public sectors."},{"level":4,"heirachical_structure":"Unit group","code":"1224","title":"Property administrators","description":"Property administrators perform administrative duties and co-ordinate activities related to the management and rental of investment property and real estate on behalf of property and strata property owners. They are employed by property, real estate and strata services management companies, property development companies and by government."},{"level":4,"heirachical_structure":"Unit group","code":"1225","title":"Purchasing agents and officers","description":"Purchasing agents and officers purchase general and specialized equipment, materials, land or access rights and business services for use or for further processing by their establishment. They are employed throughout the public and private sectors."},{"level":4,"heirachical_structure":"Unit group","code":"1226","title":"Conference and event planners","description":"Conference and event planners plan, organize and co-ordinate conferences, conventions, meetings, seminars, exhibitions, trade shows, festivals and other events. They are employed by tourism associations, trade and professional associations, convention and conference centres, governments and by conference and event planning companies, or they may be self-employed."},{"level":4,"heirachical_structure":"Unit group","code":"1227","title":"Court officers and justices of the peace","description":"Court officers co-ordinate the administrative and procedural functions of federal, provincial and territorial courts, such as scheduling trials and overseeing the maintenance of court records. Justices of the peace administer oaths, issue subpoenas, summonses and warrants and perform other court-related duties such as conducting bail hearings. They are employed by federal and provincial courts."},{"level":4,"heirachical_structure":"Unit group","code":"1228","title":"Employment insurance, immigration, border services and revenue officers","description":"This unit group includes government officers who administer and enforce laws and regulations related to immigration, employment insurance, customs and tax revenue. They are employed by government agencies."},{"level":3,"heirachical_structure":"Minor group","code":"124","title":"Office administrative assistants - general, legal and medical"},{"level":4,"heirachical_structure":"Unit group","code":"1241","title":"Administrative assistants","description":"Administrative assistants perform a variety of administrative duties in support of managerial and professional employers. They are employed throughout the private and public sectors."},{"level":4,"heirachical_structure":"Unit group","code":"1242","title":"Legal administrative assistants","description":"Legal administrative assistants perform a variety of secretarial and administrative duties in law offices, legal departments of large firms, real estate companies, land title offices, municipal, provincial and federal courts and government."},{"level":4,"heirachical_structure":"Unit group","code":"1243","title":"Medical administrative assistants","description":"Medical administrative assistants perform a variety of secretarial and administrative duties in doctor's offices, hospitals, medical clinics and other medical settings."},{"level":3,"heirachical_structure":"Minor group","code":"125","title":"Court reporters, transcriptionists, records management technicians and statistical officers"},{"level":4,"heirachical_structure":"Unit group","code":"1251","title":"Court reporters, medical transcriptionists and related occupations","description":"Court reporters record and transcribe verbatim the proceedings of courts, legislative assemblies and committees, and prepare transcripts for use by judges, tribunals and quasi-judicial panels. They are employed by courts of law, provincial and federal legislative assemblies and committees, or they may be self-employed. Medical transcriptionists record, transcribe and edit dictation by physicians and other health care providers, surgical proceedings, health-related reports and other medical documentation. They are employed by hospitals, medical clinics and doctors' offices, or they may be self-employed. Closed captioners and other transcriptionists are included in this unit group."},{"level":4,"heirachical_structure":"Unit group","code":"1252","title":"Health information management occupations","description":"Health information management technicians and related workers collect, code, record, review and manage health information. They are employed by hospitals, clinics, workplace health and safety boards, health record consulting firms and other health care establishments. Health information management technicians and related workers who are supervisors are included in this unit group."},{"level":4,"heirachical_structure":"Unit group","code":"1253","title":"Records management technicians","description":"Records management technicians operate and maintain systems for the collection, classification, retrieval and retention of records, images, documents and information. Records management technicians are employed throughout the private and public sectors."},{"level":4,"heirachical_structure":"Unit group","code":"1254","title":"Statistical officers and related research support occupations","description":"Statistical officers and related research support occupations in this unit group provide statistical and research support services to a wide range of businesses and organizations. These workers conduct statistical routines, monitor trends, compile data and prepare charts, graphs, summaries and reports in support of organizational information needs and research activities. They are employed throughout the private and public sectors. Statistical officers who are also supervisors are included in this unit group."},{"level":2,"heirachical_structure":"Major group","code":"13","title":"Finance, insurance and related business administrative occupations"},{"level":3,"heirachical_structure":"Minor group","code":"131","title":"Finance, insurance and related business administrative occupations"},{"level":4,"heirachical_structure":"Unit group","code":"1311","title":"Accounting technicians and bookkeepers","description":"Accounting technicians and bookkeepers maintain complete sets of books, keep records of accounts, verify the procedures used for recording financial transactions, and provide personal bookkeeping services. They are employed throughout the private and public sectors, or they may be self-employed."},{"level":4,"heirachical_structure":"Unit group","code":"1312","title":"Insurance adjusters and claims examiners","description":"Insurance adjusters investigate insurance claims and determine the amount of loss or damages covered by insurance policies. They are employed in claims departments of insurance companies or as independent adjusters. Insurance claims examiners examine claims investigated by insurance adjusters and authorize payments. They are employed at head offices or branches of insurance companies."},{"level":4,"heirachical_structure":"Unit group","code":"1313","title":"Insurance underwriters","description":"Insurance underwriters review and evaluate insurance applications to determine insurance risks, insurance premiums and extent of insurance coverage according to company policies. Insurance underwriters are employed at head and branch offices of insurance companies."},{"level":4,"heirachical_structure":"Unit group","code":"1314","title":"Assessors, valuators and appraisers","description":"Assessors, valuators and appraisers determine the value of land, businesses, estates and other real property, for purposes of sale, purchase, taxation or disposal of assets. Appraisers also determine the value of personal and household items. Assessors, valuators and appraisers are employed by government agencies, real estate firms and other private companies, or they may be self-employed."},{"level":4,"heirachical_structure":"Unit group","code":"1315","title":"Customs, ship and other brokers","description":"Customs brokers clear goods through customs and to their destination on behalf of importer and exporter clients. Shipbrokers buy and sell cargo space on ships and buy and sell ships, yachts and other watercraft on behalf of clients. This unit group also includes other brokers, not elsewhere classified, who negotiate commercial transactions, logistics or other services between parties on behalf of clients. They are employed by customs, ship or other brokerage establishments or may be self-employed."},{"level":2,"heirachical_structure":"Major group","code":"14","title":"Office support occupations"},{"level":3,"heirachical_structure":"Minor group","code":"141","title":"General office workers"},{"level":4,"heirachical_structure":"Unit group","code":"1411","title":"General office support workers","description":"General office support workers prepare correspondence, reports, statements and other material, operate office equipment, answer telephones, verify, record and process forms and documents such as contracts and requisitions and perform general clerical duties according to established procedures. They are employed in offices throughout the public and private sectors."},{"level":4,"heirachical_structure":"Unit group","code":"1414","title":"Receptionists","description":"Receptionists greet people arriving at offices, hospitals and other establishments, direct visitors to appropriate person or service, answer and forward telephone calls, take messages, schedule appointments and perform other clerical duties. They are employed by hospitals, medical and dental offices and in other offices throughout the public and private sectors. Telephone operators are included in this group."},{"level":4,"heirachical_structure":"Unit group","code":"1415","title":"Personnel clerks","description":"Personnel clerks assist personnel officers and human resources specialists and compile, maintain and process information relating to staffing, recruitment, training, labour relations, performance evaluations and classifications. They are employed in personnel departments throughout the private and public sectors."},{"level":4,"heirachical_structure":"Unit group","code":"1416","title":"Court clerks","description":"This unit group includes those who perform support functions in courts of law, such as calling court to order, preparing court dockets and maintaining exhibits. Court clerks are employed by federal, provincial and municipal courts."},{"level":3,"heirachical_structure":"Minor group","code":"142","title":"Office equipment operators"},{"level":4,"heirachical_structure":"Unit group","code":"1422","title":"Data entry clerks","description":"Data entry clerks input coded, statistical, financial and other information into computerized databases, spreadsheets or other templates using a keyboard, mouse, or optical scanner, speech recognition software or other data entry tools. They are employed in the private and public sectors."},{"level":4,"heirachical_structure":"Unit group","code":"1423","title":"Desktop publishing operators and related occupations","description":"Desktop publishing operators use computers to enter copy into a typesetting system or operate typesetting output equipment to produce text that is ready to print. They are employed by firms that specialize in typesetting, commercial printing companies, publishing and printing companies and various establishments in the public and private sectors that have in-house printing departments."},{"level":3,"heirachical_structure":"Minor group","code":"143","title":"Financial, insurance and related administrative support workers"},{"level":4,"heirachical_structure":"Unit group","code":"1431","title":"Accounting and related clerks","description":"Accounting and related clerks calculate, prepare and process bills, invoices, accounts payable and receivable, budgets and other financial records according to established procedures. They are employed throughout the private and public sectors."},{"level":4,"heirachical_structure":"Unit group","code":"1432","title":"Payroll clerks","description":"Payroll clerks collect, verify and process payroll information and determine pay and benefit entitlements for employees within a department, company or other establishment. They are employed by payroll administration companies and by establishments throughout the private and public sectors."},{"level":4,"heirachical_structure":"Unit group","code":"1434","title":"Banking, insurance and other financial clerks","description":"Banking, insurance and other financial clerks compile, process and maintain banking, insurance and other financial information. They are employed by banks, credit companies, private and public insurance establishments, investment firms and other financial establishments throughout the private and public sectors."},{"level":4,"heirachical_structure":"Unit group","code":"1435","title":"Collectors","description":"Collectors collect payments on overdue accounts and bad cheques and locate debtors to make collection arrangements. They are employed by collection agencies, utility companies, department stores, loan companies, banks and credit unions, and by financial and licensing departments within governments."},{"level":3,"heirachical_structure":"Minor group","code":"145","title":"Library, correspondence and other clerks"},{"level":4,"heirachical_structure":"Unit group","code":"1451","title":"Library assistants and clerks","description":"Library assistants and clerks issue and receive library materials, sort and shelve books and provide general library information to users. They also perform clerical functions. Library clerks are employed by libraries or other establishments with library services."},{"level":4,"heirachical_structure":"Unit group","code":"1452","title":"Correspondence, publication and regulatory clerks","description":"Clerks in this unit group write correspondence, proofread material for accuracy, compile material for publication, verify, record and process forms and documents, such as applications, licences, permits, contracts, registrations and requisitions, and perform other related clerical duties in accordance with established procedures, guidelines and schedules. They are employed by newspapers, periodicals, publishing firms and by establishments throughout the private and public sectors."},{"level":4,"heirachical_structure":"Unit group","code":"1454","title":"Survey interviewers and statistical clerks","description":"Survey interviewers contact individuals to gather information for market research, public opinion polls or election and census enumeration. Statistical clerks code and compile interview and other data into reports, lists, directories and other documents. Workers in this unit group are employed by market research and polling firms, government departments and agencies, utility companies, contact centres and other establishments. This unit group also includes clerks who observe and record information on traffic flow."},{"level":2,"heirachical_structure":"Major group","code":"15","title":"Distribution, tracking and scheduling co-ordination occupations"},{"level":3,"heirachical_structure":"Minor group","code":"151","title":"Mail and message distribution occupations"},{"level":4,"heirachical_structure":"Unit group","code":"1511","title":"Mail, postal and related workers","description":"This unit group includes workers who process and sort mail and parcels in post offices, mail processing plants and internal mail rooms, and clerks who serve customers and record transactions at sales counters and postal wickets. Mail, postal and related workers are employed by Canada Post Corporation, courier and parcel express companies and establishments throughout the public and private sectors."},{"level":4,"heirachical_structure":"Unit group","code":"1512","title":"Letter carriers","description":"Letter carriers sort and deliver mail, record delivery of registered mail and collect money for cash-on-delivery parcels. Letter carriers are employed by Canada Post Corporation."},{"level":4,"heirachical_structure":"Unit group","code":"1513","title":"Couriers, messengers and door-to-door distributors","description":"Couriers, messengers and door-to-door distributors pick up and deliver letters, parcels, packages, newspapers, flyers and other items within and between establishments. They are employed by courier service companies and other establishments throughout the private and public sectors."},{"level":3,"heirachical_structure":"Minor group","code":"152","title":"Supply chain logistics, tracking and scheduling co-ordination occupations"},{"level":4,"heirachical_structure":"Unit group","code":"1521","title":"Shippers and receivers","description":"Shippers and receivers ship, receive and record the movement of parts, supplies, materials, equipment and stock to and from an establishment. They are employed in the public sector and by retail and wholesale establishments, manufacturing companies, and other commercial and industrial establishments."},{"level":4,"heirachical_structure":"Unit group","code":"1522","title":"Storekeepers and partspersons","description":"Storekeepers and partspersons sort, store and issue parts and supplies for use by the establishment in which they work and for sale to the public. They are employed by manufacturing companies, warehouses, retail and wholesale establishments, mining, forestry and construction companies, repair shops, hospitals and other establishments."},{"level":4,"heirachical_structure":"Unit group","code":"1523","title":"Production logistics co-ordinators","description":"Production logistics co-ordinators co-ordinate and expedite the flow of work and materials within an establishment, prepare work and production schedules and monitor the progress of production and construction projects. Production clerks are employed by manufacturing and construction companies, printing and publishing companies and other industrial establishments."},{"level":4,"heirachical_structure":"Unit group","code":"1524","title":"Purchasing and inventory control workers","description":"Purchasing and inventory control workers process purchasing transactions and maintain inventories of materials, equipment and stock. They are employed by retail and wholesale establishments, manufacturing companies, government agencies and other establishments."},{"level":4,"heirachical_structure":"Unit group","code":"1525","title":"Dispatchers","description":"Dispatchers operate radios and other telecommunication equipment to dispatch emergency vehicles and to co-ordinate the activities of drivers and other personnel. They are employed by police, fire and health departments, other emergency service agencies, taxi, delivery and courier services, trucking and utilities companies, and other commercial and industrial establishments."},{"level":4,"heirachical_structure":"Unit group","code":"1526","title":"Transportation route and crew schedulers","description":"Transportation route and crew schedulers prepare operational and crew schedules for transportation equipment and operating personnel. They are employed by municipal transit commissions, truck, delivery and courier companies, railways, airlines and by other transportation establishments in both the private and public sectors."},{"level":1,"heirachical_structure":"Broad occupational category","code":"2","title":"Natural and applied sciences and related occupations"},{"level":2,"heirachical_structure":"Major group","code":"21","title":"Professional occupations in natural and applied sciences"},{"level":3,"heirachical_structure":"Minor group","code":"211","title":"Physical science professionals"},{"level":4,"heirachical_structure":"Unit group","code":"2111","title":"Physicists and astronomers","description":"Physicists conduct theoretical and applied research to extend knowledge of natural phenomena and to develop new processes and devices in fields such as electronics, communications, power generation and distribution, aerodynamics, optics and lasers, remote sensing, biotechnology, medicine and health. They are employed by electronic, electrical and aerospace manufacturing companies, telecommunications companies, power utilities, university and government research laboratories, hospitals and by a wide range of other processing, manufacturing, and research and consulting firms. Astronomers conduct observational and theoretical research to extend knowledge of the universe. They are employed by government and universities."},{"level":4,"heirachical_structure":"Unit group","code":"2112","title":"Chemists","description":"Chemists conduct research and analysis in support of industrial operations, product and process development, quality control, environmental control, medical diagnosis and treatment, biotechnology, nanotechnology and other applications. They also conduct theoretical, experimental and applied research into basic chemical and biochemical processes to create or synthesize new products and processes. Chemists are employed in research, development and quality control laboratories; chemical, petrochemical and pharmaceutical industries; mineral, metal and pulp and paper industries; and a wide variety of manufacturing, utility, health, educational and government establishments."},{"level":4,"heirachical_structure":"Unit group","code":"2113","title":"Geoscientists and oceanographers","description":"Geoscientists include geologists, geochemists and geophysicists who conduct programs of exploration and research to extend knowledge of the structure, composition and processes of the earth, to locate, identify and extract hydrocarbon, mineral and groundwater resources and to assess and mitigate the effects of development and waste disposal projects on the environment. Oceanographers conduct programs of exploration and research on ocean processes and phenomena, biological, chemical and physical characteristics of oceans, interactions with atmospheric and geological environments and impacts of human activity on oceans and marine ecosystems. Geoscientists are employed by petroleum and mining companies, consulting geology, geophysics and engineering firms and by governments and educational institutions, or they may be self-employed. Oceanographers are employed by governments, educational institutions and private companies engaged in exploration of seafloor deposits and seafarming areas, or they may be self-employed."},{"level":4,"heirachical_structure":"Unit group","code":"2114","title":"Meteorologists and climatologists","description":"Meteorologists and climatologists analyze and forecast weather, provide consultation on atmospheric phenomena and conduct research into the processes and phenomena of weather, climate and atmosphere. They are employed by all levels of government, natural resources and utility companies, the media and private consulting firms, or they may be self-employed."},{"level":4,"heirachical_structure":"Unit group","code":"2115","title":"Other professional occupations in physical sciences","description":"This group includes metallurgists, soil scientists and physical scientists and researchers, not elsewhere classified, involved in the conduct of theoretical and applied research in fields of physical science. They are employed by governments, educational institutions and a wide range of industrial establishments."},{"level":3,"heirachical_structure":"Minor group","code":"212","title":"Life science professionals"},{"level":4,"heirachical_structure":"Unit group","code":"2121","title":"Biologists and related scientists","description":"Biologists and related scientists conduct basic and applied research to extend knowledge of living organisms, to manage natural resources, and to develop new practices and products related to medicine and agriculture. They are employed in both laboratory and field settings by governments, environmental consulting companies, resource and utilities companies, chemical, pharmaceutical and biotechnical companies and health and educational institutions."},{"level":4,"heirachical_structure":"Unit group","code":"2122","title":"Forestry professionals","description":"Forestry professionals conduct research, develop plans and administer and direct programs related to the management and harvesting of forest resources. They are employed by the forest industry, provincial and federal governments, consulting companies, educational institutions and other industries, or they may be self-employed."},{"level":4,"heirachical_structure":"Unit group","code":"2123","title":"Agricultural representatives, consultants and specialists","description":"Agricultural representatives, consultants and specialists provide assistance and advice to farmers on all aspects of farm management, cultivation, fertilization, harvesting, soil erosion and composition, disease prevention, nutrition, crop rotation and marketing. They are employed by businesses, institutions and governments that assist the farming community, or they may be self-employed."},{"level":3,"heirachical_structure":"Minor group","code":"213","title":"Civil, mechanical, electrical and chemical engineers"},{"level":4,"heirachical_structure":"Unit group","code":"2131","title":"Civil engineers","description":"Civil engineers plan, design, develop and manage projects for the construction or repair of buildings, earth structures, powerhouses, roads, airports, railways, rapid transit facilities, bridges, tunnels, canals, dams, ports and coastal installations and systems related to highway and transportation services, water distribution and sanitation. Civil engineers may also specialize in foundation analysis, building and structural inspection, surveying, geomatics and municipal planning. Civil engineers are employed by engineering consulting companies, in all levels of government, by construction firms and in many other industries, or they may be self-employed."},{"level":4,"heirachical_structure":"Unit group","code":"2132","title":"Mechanical engineers","description":"Mechanical engineers research, design and develop machinery and systems for heating, ventilating and air conditioning, power generation, transportation, processing and manufacturing. They also perform duties related to the evaluation, installation, operation and maintenance of mechanical systems. Mechanical engineers are employed by consulting firms, by power-generating utilities and in a wide range of manufacturing, processing and transportation industries, or they may be self-employed."},{"level":4,"heirachical_structure":"Unit group","code":"2133","title":"Electrical and electronics engineers","description":"Electrical and electronics engineers design, plan, research, evaluate and test electrical and electronic equipment and systems. They are employed by electrical utilities, communications companies, manufacturers of electrical and electronic equipment, consulting firms, and by a wide range of manufacturing, processing and transportation industries and government."},{"level":4,"heirachical_structure":"Unit group","code":"2134","title":"Chemical engineers","description":"Chemical engineers research, design, and develop chemical processes and equipment, oversee the operation and maintenance of industrial chemical, plastics, pharmaceutical, resource, pulp and paper, and food processing plants and perform duties related to chemical quality control, environmental protection and biochemical or biotechnical engineering. Chemical engineers are employed in a wide range of manufacturing and processing industries, consulting firms, government, research and educational institutions."},{"level":3,"heirachical_structure":"Minor group","code":"214","title":"Other engineers"},{"level":4,"heirachical_structure":"Unit group","code":"2141","title":"Industrial and manufacturing engineers","description":"Industrial and manufacturing engineers conduct studies, and develop and supervise programs to achieve the best use of equipment, human resources, technology, materials and procedures to enhance efficiency and productivity. Industrial and manufacturing engineers are employed in consulting firms, manufacturing and processing companies, in government, financial, health care and other institutions, or they may be self-employed."},{"level":4,"heirachical_structure":"Unit group","code":"2142","title":"Metallurgical and materials engineers","description":"Metallurgical and materials engineers conduct studies of the properties and characteristics of metals and other non-metallic materials and plan, design and develop machinery and processes to concentrate, extract, refine and process metals, alloys and other materials such as ceramics, semiconductors and composite materials. Metallurgical and materials engineers are employed in consulting engineering firms, mining, metal processing and manufacturing companies, and in government, research and educational institutions."},{"level":4,"heirachical_structure":"Unit group","code":"2143","title":"Mining engineers","description":"Mining engineers plan, design, organize and supervise the development of mines, mine facilities, systems and equipment; and prepare and supervise the extraction of metallic or non-metallic minerals and ores from underground or surface mines. Mining engineers are employed by mining companies, consulting engineering companies, manufacturers, government and in educational and research institutions."},{"level":4,"heirachical_structure":"Unit group","code":"2144","title":"Geological engineers","description":"Geological engineers conduct geological and geotechnical studies to assess suitability of locations for civil engineering, mining and oil and gas projects; and plan, design, develop and supervise programs of geological data acquisition and analysis and the preparation of geological engineering reports and recommendations. Geological engineers are employed in consulting engineering companies, electrical utilities, mining and petroleum companies and in government and research and educational institutions."},{"level":4,"heirachical_structure":"Unit group","code":"2145","title":"Petroleum engineers","description":"Petroleum engineers conduct studies for the exploration, development and extraction of oil and gas deposits; and plan, design, develop and supervise projects for the drilling, completion, testing and re-working of oil and gas wells. They are employed by petroleum producing companies, consulting companies, well logging or testing companies, government, and research and educational institutions."},{"level":4,"heirachical_structure":"Unit group","code":"2146","title":"Aerospace engineers","description":"Aerospace engineers research, design and develop aerospace vehicles, aerospace systems and their components, and perform duties related to their testing, evaluation, installation, operation and maintenance. They are employed by aircraft and spacecraft manufacturers, air transport carriers, and in government and educational and research institutions."},{"level":4,"heirachical_structure":"Unit group","code":"2147","title":"Computer engineers (except software engineers and designers)","description":"Computer engineers (except software engineers and designers) research, plan, design, develop, modify, evaluate and integrate computer and telecommunications hardware and related equipment, and information and communication system networks including mainframe systems, local and wide area networks, fibre-optic networks, wireless communication networks, intranets, the Internet and other data communications systems. They are employed by computer and telecommunication hardware manufacturers, by engineering, manufacturing and telecommunications firms, in information technology consulting firms, by governmental, educational and research institutions and in information technology units throughout the private and public sectors."},{"level":4,"heirachical_structure":"Unit group","code":"2148","title":"Other professional engineers, n.e.c.","description":"This unit group includes agricultural and bio-resource engineers, biomedical engineers, engineering physicists and engineering scientists, marine and naval engineers, textile engineers and other specialized engineering occupations which are not classified elsewhere."},{"level":3,"heirachical_structure":"Minor group","code":"215","title":"Architects, urban planners and land surveyors"},{"level":4,"heirachical_structure":"Unit group","code":"2151","title":"Architects","description":"Architects conceptualize, plan and develop designs for the construction and renovation of commercial, institutional and residential buildings. They are employed by architectural firms, private corporations and governments, or they may be self-employed."},{"level":4,"heirachical_structure":"Unit group","code":"2152","title":"Landscape architects","description":"Landscape architects conceptualize landscape designs, develop contract documents and oversee the construction of landscape development for commercial projects, office complexes, parks, golf courses and residential development. They are employed by government environmental and development agencies, landscape consulting firms and by architectural and engineering firms, or they are self-employed."},{"level":4,"heirachical_structure":"Unit group","code":"2153","title":"Urban and land use planners","description":"Urban and land use planners develop plans and recommend policies for managing land use, physical facilities and associated services for urban and rural areas and remote regions. They are employed by all levels of government, land developers, engineering and other consulting companies, or may work as private consultants."},{"level":4,"heirachical_structure":"Unit group","code":"2154","title":"Land surveyors","description":"Land surveyors plan, direct and conduct legal surveys to establish the location of real property boundaries, contours and other natural or human-made features, and prepare and maintain cross-sectional drawings, official plans, records and documents pertaining to these surveys. They are employed by federal, provincial and municipal governments, private sector land surveying establishments, real estate development, natural resource, engineering and construction firms, or they may be self-employed."},{"level":3,"heirachical_structure":"Minor group","code":"216","title":"Mathematicians, statisticians and actuaries"},{"level":4,"heirachical_structure":"Unit group","code":"2161","title":"Mathematicians, statisticians and actuaries","description":"Mathematicians and statisticians research mathematical or statistical theories, and develop and apply mathematical or statistical techniques for solving problems in such fields as science, engineering, business and social science. Actuaries apply mathematics, statistics, probability and risk theory to assess potential financial impacts of future events. Mathematicians, statisticians and actuaries are employed by universities, governments, bank and trust companies, insurance companies, pension benefit consulting firms, professional associations, and science and engineering consulting firms."},{"level":3,"heirachical_structure":"Minor group","code":"217","title":"Computer and information systems professionals"},{"level":4,"heirachical_structure":"Unit group","code":"2171","title":"Information systems analysts and consultants","description":"Information systems analysts and consultants analyze systems requirements, develop and implement information systems development plans, policies and procedures, and provide advice on a wide range of information systems issues. They are employed in information technology consulting firms and in information technology units throughout the private and public sectors, or they may be self-employed."},{"level":4,"heirachical_structure":"Unit group","code":"2172","title":"Database analysts and data administrators","description":"Database analysts design, develop and administer data management solutions using database management software. Data administrators develop and implement data administration policy, standards and models. They are employed in information technology consulting firms and in information technology units throughout the private and public sectors."},{"level":4,"heirachical_structure":"Unit group","code":"2173","title":"Software engineers and designers","description":"Software engineers and designers research, design, evaluate, integrate and maintain software applications, technical environments, operating systems, embedded software, information warehouses and telecommunications software. They are employed in information technology consulting firms, information technology research and development firms, and information technology units throughout the private and public sectors, or they may be self-employed."},{"level":4,"heirachical_structure":"Unit group","code":"2174","title":"Computer programmers and interactive media developers","description":"Computer programmers write, modify, integrate and test computer code for microcomputer and mainframe software applications, data processing applications, operating systems-level software and communications software. Interactive media developers write, modify, integrate and test computer code for Internet applications, computer-based training software, computer games, film, video and other interactive media. They are employed in computer software development firms, information technology consulting firms, and in information technology units throughout the private and public sectors."},{"level":4,"heirachical_structure":"Unit group","code":"2175","title":"Web designers and developers","description":"Web designers and developers research, design, develop and produce Internet and Intranet sites. They are employed in computer software development firms, information technology consulting firms, information technology units throughout the private and public sectors, advertising agencies or they may be self-employed."},{"level":2,"heirachical_structure":"Major group","code":"22","title":"Technical occupations related to natural and applied sciences"},{"level":3,"heirachical_structure":"Minor group","code":"221","title":"Technical occupations in physical sciences"},{"level":4,"heirachical_structure":"Unit group","code":"2211","title":"Chemical technologists and technicians","description":"Chemical technologists and technicians provide technical support and services or may work independently in chemical engineering, chemical and biochemical research and analysis, industrial chemistry, chemical quality control and environmental protection. They are employed by research and development and quality control laboratories, consulting engineering companies, in chemical, petrochemical, pharmaceutical and a variety of other manufacturing and processing industries, and by utilities, health, educational and government establishments."},{"level":4,"heirachical_structure":"Unit group","code":"2212","title":"Geological and mineral technologists and technicians","description":"Geological and mineral technologists and technicians provide technical support and services or may work independently in the fields of oil and gas exploration and production, geophysics, petroleum engineering, geology, mining and mining engineering, mineralogy, extractive and physical metallurgy, metallurgical engineering and environmental protection. They are employed by petroleum and mining companies, consulting geology and engineering firms, and by governments and educational institutions as well as by a variety of manufacturing, construction and utilities companies."},{"level":3,"heirachical_structure":"Minor group","code":"222","title":"Technical occupations in life sciences"},{"level":4,"heirachical_structure":"Unit group","code":"2221","title":"Biological technologists and technicians","description":"Biological technologists and technicians provide technical support and services to scientists, engineers and other professionals working in fields such as agriculture, resource management, environmental protection, plant and animal biology, microbiology, cell and molecular biology and health sciences, or may work independently in these fields. They are employed in both laboratory and field settings by governments, manufacturers of food products, chemicals and pharmaceuticals, biotechnology companies, health, research and educational institutions, environmental consulting companies, and resource and utilities companies."},{"level":4,"heirachical_structure":"Unit group","code":"2222","title":"Agricultural and fish products inspectors","description":"Agricultural and fish products inspectors inspect agricultural and fish products for conformity to prescribed production, storage and transportation standards. They are employed by government departments and agencies and by private sector food processing companies. Supervisors of agricultural and fish products inspectors are also included in this group."},{"level":4,"heirachical_structure":"Unit group","code":"2223","title":"Forestry technologists and technicians","description":"Forestry technologists and technicians may work independently or perform technical and supervisory functions in support of forestry research, forest management, forest harvesting, forest resource conservation and environmental protection. They are employed by the forest industry sector, provincial and federal governments, consulting firms, and other industries and institutions, or they may be self-employed."},{"level":4,"heirachical_structure":"Unit group","code":"2224","title":"Conservation and fishery officers","description":"This unit group includes conservation and fishery officers, inspectors and observers who enforce federal and provincial regulations established for the protection of fish, wildlife and other natural resources and collect and relay information on resource management. They are employed by federal and provincial government departments."},{"level":4,"heirachical_structure":"Unit group","code":"2225","title":"Landscape and horticulture technicians and specialists","description":"This unit group includes those who survey and assess landscapes; draw sketches and build models of landscape designs; construct and maintain gardens, parks, golf courses and other landscaped environments; advise clients on issues related to horticulture such as irrigation; breed, cultivate and study plants; and treat injured and diseased trees and plants. They are employed by landscape designers and contractors, lawn service and tree care establishments, golf courses, nurseries and greenhouses, and municipal, provincial and national parks, or they may be self-employed."},{"level":3,"heirachical_structure":"Minor group","code":"223","title":"Technical occupations in civil, mechanical and industrial engineering"},{"level":4,"heirachical_structure":"Unit group","code":"2231","title":"Civil engineering technologists and technicians","description":"Civil engineering technologists and technicians provide technical support and services to scientists, engineers and other professionals, or may work independently in fields such as structural engineering, municipal engineering, construction design and supervision, highways and transportation engineering, water resources engineering, geotechnical engineering and environmental protection. They are employed by consulting engineering and construction companies, public works, transportation and other government departments and in many other industries."},{"level":4,"heirachical_structure":"Unit group","code":"2232","title":"Mechanical engineering technologists and technicians","description":"Mechanical engineering technologists and technicians provide technical support and services or may work independently in mechanical engineering fields such as the design, development, maintenance and testing of machines, components, tools, heating and ventilating systems, power generation and power conversion plants, manufacturing plants and equipment. They are employed by consulting engineering, manufacturing and processing companies, institutions and government departments."},{"level":4,"heirachical_structure":"Unit group","code":"2233","title":"Industrial engineering and manufacturing technologists and technicians","description":"Industrial engineering and manufacturing technologists and technicians may work independently or provide technical support and services in the development of production methods, facilities and systems, and the planning, estimating, measuring and scheduling of work. They are employed by manufacturing and insurance companies, government departments, and establishments in other industries."},{"level":4,"heirachical_structure":"Unit group","code":"2234","title":"Construction estimators","description":"Construction estimators analyze costs of and prepare estimates on civil engineering, architectural, structural, electrical and mechanical construction projects. They are employed by residential, commercial and industrial construction companies and major electrical, mechanical and trade contractors, or they may be self-employed."},{"level":3,"heirachical_structure":"Minor group","code":"224","title":"Technical occupations in electronics and electrical engineering"},{"level":4,"heirachical_structure":"Unit group","code":"2241","title":"Electrical and electronics engineering technologists and technicians","description":"Electrical and electronics engineering technologists and technicians may work independently or provide technical support and services in the design, development, testing, production and operation of electrical and electronic equipment and systems. They are employed by electrical utilities, communications companies, manufacturers of electrical and electronic equipment, consulting firms, and in governments and a wide range of manufacturing, processing and transportation industries."},{"level":4,"heirachical_structure":"Unit group","code":"2242","title":"Electronic service technicians (household and business equipment)","description":"Electronic service technicians service and repair household and business electronic equipment such as audio and video systems, computers and peripherals, office equipment and other consumer electronic equipment and assemblies. They are employed by electronic service and retail establishments, by wholesale distributors and within service departments of electronic manufacturing companies."},{"level":4,"heirachical_structure":"Unit group","code":"2243","title":"Industrial instrument technicians and mechanics","description":"Industrial instrument technicians and mechanics repair, maintain, calibrate, adjust, and install industrial measuring and controlling instrumentation. They are employed by pulp and paper processing companies, nuclear and hydro power generating companies, mining, petrochemical and natural gas companies, industrial instrument and other manufacturing companies, and by industrial instrument servicing establishments."},{"level":4,"heirachical_structure":"Unit group","code":"2244","title":"Aircraft instrument, electrical and avionics mechanics, technicians and inspectors","description":"This unit group includes mechanics and technicians who install, adjust, repair and overhaul aircraft instrument, electrical or avionics systems on aircraft. This unit group also includes avionics inspectors who inspect instrument, electrical and avionics systems following assembly, modification, repair or overhaul. Workers in this unit group are employed by aircraft manufacturing, maintenance, repair and overhaul establishments and by airlines and other aircraft operators."},{"level":3,"heirachical_structure":"Minor group","code":"225","title":"Technical occupations in architecture, drafting, surveying, geomatics and meteorology"},{"level":4,"heirachical_structure":"Unit group","code":"2251","title":"Architectural technologists and technicians","description":"Architectural technologists and technicians may work independently or provide technical assistance to professional architects and civil design engineers in conducting research, preparing drawings, architectural models, specifications and contracts and in supervising construction projects. Architectural technologists and technicians are employed by architectural and construction firms, and governments."},{"level":4,"heirachical_structure":"Unit group","code":"2252","title":"Industrial designers","description":"Industrial designers conceptualize and produce designs for manufactured products. They are employed by manufacturing industries and private design firms or they may be self-employed."},{"level":4,"heirachical_structure":"Unit group","code":"2253","title":"Drafting technologists and technicians","description":"Drafting technologists and technicians prepare engineering designs, drawings and related technical information, in multidisciplinary engineering teams or in support of engineers, architects or industrial designers, or they may work independently. They are employed by consulting and construction companies, utility, resource and manufacturing companies, all levels of government and by a wide range of other establishments."},{"level":4,"heirachical_structure":"Unit group","code":"2254","title":"Land survey technologists and technicians","description":"Land survey technologists and technicians conduct or participate in surveys to determine the exact locations and relative positions of natural features and other structures on the earth's surface, underground and underwater. They are employed by all levels of government, architectural and engineering firms, and by private sector surveying establishments."},{"level":4,"heirachical_structure":"Unit group","code":"2255","title":"Technical occupations in geomatics and meteorology","description":"Technical occupations in geomatics include aerial survey, remote sensing, geographic information systems, cartographic and photogrammetric technologists and technicians, who gather, analyze, interpret and use geospatial information for applications in natural resources, geology, environmental research and land use planning. Meteorological technologists and technicians observe weather and atmospheric conditions, record, interpret, transmit and report on meteorological data, and provide weather information to the agricultural, natural resources and transportation industries and the public. Geomatics technologists and technicians are employed by all levels of government, utilities, mapping, computer software, forestry, architectural, engineering and consulting firms and other related establishments. Meteorological technologists and technicians are employed by all levels of government, the media, natural resources, utilities and transportation companies and consulting firms."},{"level":3,"heirachical_structure":"Minor group","code":"226","title":"Other technical inspectors and regulatory officers"},{"level":4,"heirachical_structure":"Unit group","code":"2261","title":"Non-destructive testers and inspection technicians","description":"Non-destructive testers and inspection technicians operate radiographic, ultrasonic, liquid penetrant, magnetic particle, eddy current and similar testing equipment to detect discontinuities in objects of various compositions and materials. They are employed by quality control, maintenance and safety departments of manufacturing, processing, transportation, energy and other companies and by private industrial inspection establishments."},{"level":4,"heirachical_structure":"Unit group","code":"2262","title":"Engineering inspectors and regulatory officers","description":"Engineering inspectors and regulatory officers inspect transportation vehicles such as aircraft, watercraft, automobiles and trucks and weighing and measuring devices such as scales and meters as well as industrial instruments, processes and equipment for conformity to government and industry standards and regulations. They are employed by government agencies and in the private sector."},{"level":4,"heirachical_structure":"Unit group","code":"2263","title":"Inspectors in public and environmental health and occupational health and safety","description":"Inspectors in this unit group evaluate and monitor health and safety hazards and develop strategies to control risks in the workplace. They inspect restaurants, public facilities, industrial establishments, municipal water systems and other workplaces to ensure compliance with government regulations regarding sanitation, pollution control, the handling and storage of hazardous substances and workplace safety. They are employed throughout the private and public sectors."},{"level":4,"heirachical_structure":"Unit group","code":"2264","title":"Construction inspectors","description":"Construction inspectors inspect the construction and maintenance of new and existing buildings, bridges, highways and industrial construction to ensure that specifications and building codes are observed and monitor work site safety. They are employed by federal, provincial and municipal governments, construction companies, architectural and civil engineering consulting firms or they may be self-employed."},{"level":3,"heirachical_structure":"Minor group","code":"227","title":"Transportation officers and controllers"},{"level":4,"heirachical_structure":"Unit group","code":"2271","title":"Air pilots, flight engineers and flying instructors","description":"Air pilots fly fixed wing aircraft and helicopters to provide air transportation and other services such as crop spraying and aerial surveying. Flight engineers assist air pilots with monitoring, troubleshooting and maintenance of aircraft systems and with pre- and post-flight inspections. Flying instructors teach flying techniques and procedures to student and licensed pilots. Air pilots, flight engineers and flight instructors are employed by airline and air freight companies, flying schools and by other public and private sector aircraft operators."},{"level":4,"heirachical_structure":"Unit group","code":"2272","title":"Air traffic controllers and related occupations","description":"Air traffic controllers direct air traffic within assigned airspace, and control moving aircraft and service vehicles at airports. Flight service specialists provide pilots with flight information essential to aviation safety. Flight dispatchers authorize airline flights over assigned routes. Air traffic controllers and flight service specialists are employed by NAV Canada and the Canadian Forces. Flight dispatchers are employed by airline and air services companies and by the Canadian Forces."},{"level":4,"heirachical_structure":"Unit group","code":"2273","title":"Deck officers, water transport","description":"Deck officers, water transport, operate and command ships or self-propelled vessels to transport passengers and cargo on oceans and coastal and inland waters, and supervise and co-ordinate the activities of deck crews. This unit group also includes Canadian Coast Guard deck officers. They are employed by marine transportation companies and federal government departments."},{"level":4,"heirachical_structure":"Unit group","code":"2274","title":"Engineer officers, water transport","description":"Engineer officers, water transport, operate and maintain main engines, machinery and auxiliary equipment aboard ships and other self-propelled vessels, and supervise and co-ordinate the activities of engine room crews. They are employed by marine transportation companies and federal government departments."},{"level":4,"heirachical_structure":"Unit group","code":"2275","title":"Railway traffic controllers and marine traffic regulators","description":"Railway traffic controllers co-ordinate passenger and freight train traffic on railways. They are employed by rail transport companies. Marine traffic regulators monitor and regulate coastal and inland marine traffic within assigned waterways. They are employed by port, harbour, canal and lock authorities and by the Canadian Coast Guard."},{"level":3,"heirachical_structure":"Minor group","code":"228","title":"Technical occupations in computer and information systems"},{"level":4,"heirachical_structure":"Unit group","code":"2281","title":"Computer network technicians","description":"Computer network technicians establish, operate, maintain and co-ordinate the use of local and wide area networks (LANs and WANs), mainframe networks, hardware, software and related computer equipment. They set up and maintain Internet and intranet Web sites and Web-server hardware and software, and monitor and optimize network connectivity and performance. They are employed in information technology units throughout the private and public sectors. Supervisors of computer network technicians are included in this unit group."},{"level":4,"heirachical_structure":"Unit group","code":"2282","title":"User support technicians","description":"Technicians in this group provide first-line technical support to computer users experiencing difficulties with computer hardware and with computer applications and communications software. They are employed by computer hardware manufacturers and retailers, software developers, in call centres and in information technology units throughout the private and public sectors. Technicians in this group are also employed by independent technical support companies or they may be self-employed."},{"level":4,"heirachical_structure":"Unit group","code":"2283","title":"Information systems testing technicians","description":"Information systems testing technicians execute test plans to evaluate the performance of software applications and information and telecommunications systems. They are employed in information technology units throughout the private and public sectors."},{"level":1,"heirachical_structure":"Broad occupational category","code":"3","title":"Health occupations"},{"level":2,"heirachical_structure":"Major group","code":"30","title":"Professional occupations in nursing"},{"level":3,"heirachical_structure":"Minor group","code":"301","title":"Professional occupations in nursing"},{"level":4,"heirachical_structure":"Unit group","code":"3011","title":"Nursing co-ordinators and supervisors","description":"Nursing co-ordinators and supervisors co-ordinate and supervise the activities of registered nurses, registered psychiatric nurses, licensed practical nurses and other nursing personnel in the provision of patient care. They are employed in health care institutions such as hospitals, clinics and nursing homes, and in nursing agencies."},{"level":4,"heirachical_structure":"Unit group","code":"3012","title":"Registered nurses and registered psychiatric nurses","description":"This unit group includes registered nurses, registered psychiatric nurses and graduates of a nursing program who are awaiting registration (graduate nurses). They provide direct nursing care to patients, deliver health education programs and provide consultative services regarding issues relevant to the practice of nursing. They are employed in a variety of settings including hospitals, nursing homes, extended care facilities, rehabilitation centres, doctors' offices, clinics, community agencies, companies and private homes, or they may be self-employed."},{"level":2,"heirachical_structure":"Major group","code":"31","title":"Professional occupations in health (except nursing)"},{"level":3,"heirachical_structure":"Minor group","code":"311","title":"Physicians, dentists and veterinarians"},{"level":4,"heirachical_structure":"Unit group","code":"3111","title":"Specialist physicians","description":"This unit group includes specialist physicians in clinical medicine, in laboratory medicine and in surgery. Specialists in clinical medicine diagnose and treat diseases and physiological or psychiatric disorders and act as consultants to other physicians. Specialists in laboratory medicine study the nature, cause and development of diseases in humans. Specialists in surgery perform and supervise surgical procedures. Specialists in clinical medicine usually work in private practice or in a hospital while those in laboratory medicine and in surgery usually work in hospitals. Residents in training to become specialist physicians are included in this unit group."},{"level":4,"heirachical_structure":"Unit group","code":"3112","title":"General practitioners and family physicians","description":"General practitioners and family physicians diagnose and treat the diseases, physiological disorders and injuries of patients. They provide primary contact and continuous care toward the management of patients' health. They usually work in private practice, including group or team practices, hospitals and clinics. Residents in training to be general practitioners and family physicians are included in this unit group."},{"level":4,"heirachical_structure":"Unit group","code":"3113","title":"Dentists","description":"Dentists diagnose, treat, prevent and control disorders of the teeth and mouth. They work in private practice or may be employed in hospitals, clinics, public health facilities or universities."},{"level":4,"heirachical_structure":"Unit group","code":"3114","title":"Veterinarians","description":"Veterinarians prevent, diagnose and treat diseases and disorders in animals and advise clients on the feeding, hygiene, housing and general care of animals. Veterinarians work in private practice or may be employed by animal clinics, farms, laboratories, government or industry."},{"level":3,"heirachical_structure":"Minor group","code":"312","title":"Optometrists, chiropractors and other health diagnosing and treating professionals"},{"level":4,"heirachical_structure":"Unit group","code":"3121","title":"Optometrists","description":"Optometrists examine eyes and diagnose ocular diseases and disorders. They prescribe and fit eyeglasses and contact lenses and recommend treatments such as exercises to correct vision problems or ocular disorders. They work in private practice, clinics and community health centres."},{"level":4,"heirachical_structure":"Unit group","code":"3122","title":"Chiropractors","description":"Chiropractors diagnose, treat and prevent patients' neuromuscular-skeletal disorders of the spine, nervous system, pelvis and other body joints by adjusting the spinal column or through other corrective manipulation. Chiropractors are usually in private practice or in clinics with other health practitioners."},{"level":4,"heirachical_structure":"Unit group","code":"3124","title":"Allied primary health practitioners","description":"This unit group includes nurse practitioners, physician assistants and midwives who provide primary health care and treatment in conjunction with physicians and in collaboration with other health professionals. Nurse practitioners and physician assistants provide a range of health services to patients delivering preventive and continuous care toward the management of patients' health. Midwives provide full-course care to women and their babies during the pre- and post-natal period. Nurse practitioners are employed in community health centres, hospitals, clinics and rehabilitation centres. Physician assistants usually work in private practice, including group or team practices, hospitals and clinics. Midwives are employed in hospitals, clinics, birthing centres or in private practice."},{"level":4,"heirachical_structure":"Unit group","code":"3125","title":"Other professional occupations in health diagnosing and treating","description":"This unit group includes health professionals who diagnose and treat the diseases and injuries of patients and who are not elsewhere classified. This includes doctors of podiatric medicine, chiropodists and podiatrists, naturopaths, orthoptists and osteopaths. They work in private practices, clinics and hospitals."},{"level":3,"heirachical_structure":"Minor group","code":"313","title":"Pharmacists, dietitians and nutritionists"},{"level":4,"heirachical_structure":"Unit group","code":"3131","title":"Pharmacists","description":"Community pharmacists and hospital pharmacists compound and dispense prescribed pharmaceuticals and provide consultative services to both clients and health care providers. They are employed in retail and hospital pharmacies, or they may be self-employed. Industrial pharmacists participate in the research, development, promotion and manufacture of pharmaceutical products. They are employed in pharmaceutical companies and government departments and agencies."},{"level":4,"heirachical_structure":"Unit group","code":"3132","title":"Dietitians and nutritionists","description":"Dietitians and nutritionists plan, implement and oversee nutrition and food service programs. They are employed in a variety of settings including hospitals, home health-care agencies and extended care facilities, community health centres, the food and beverage industry, the pharmaceutical industry, educational institutions, and government and sports organizations, or they may work as private consultants."},{"level":3,"heirachical_structure":"Minor group","code":"314","title":"Therapy and assessment professionals"},{"level":4,"heirachical_structure":"Unit group","code":"3141","title":"Audiologists and speech-language pathologists","description":"Audiologists diagnose, evaluate and treat individuals with peripheral and central hearing loss, tinnitus and balance problems. Speech-language pathologists diagnose, assess and treat human communication disorders including speech, fluency, language, voice and swallowing disorders. Audiologists and speech-language pathologists are employed in hospitals, community and public health centres, extended care facilities, day clinics, rehabilitation centres and educational institutions, or may work in private practice. Audiologists and speech-language pathologists who are supervisors are included in this unit group."},{"level":4,"heirachical_structure":"Unit group","code":"3142","title":"Physiotherapists","description":"Physiotherapists assess patients and plan and carry out individually designed treatment programs to maintain, improve or restore physical functioning, alleviate pain and prevent physical dysfunction in patients. Physiotherapists are employed in hospitals, clinics, industry, sports organizations, rehabilitation centres and extended care facilities, or they may work in private practice."},{"level":4,"heirachical_structure":"Unit group","code":"3143","title":"Occupational therapists","description":"Occupational therapists develop individual and group programs with people affected by illness, injury, developmental disorders, emotional or psychological problems and ageing to maintain, restore or increase their ability to care for themselves and to engage in work, school or leisure. They also develop and implement health promotion programs with individuals, community groups and employers. They are employed in health care facilities, in schools, and by private and social services agencies, or they may be self-employed."},{"level":4,"heirachical_structure":"Unit group","code":"3144","title":"Other professional occupations in therapy and assessment","description":"This unit group includes specialized therapists not elsewhere classified who use techniques such as athletic, movement, art or recreational therapy to aid in the treatment of mental and physical disabilities or injuries. They are employed by establishments such as hospitals, rehabilitation centres, extended health care facilities, clinics, recreational centres, nursing homes, industry, educational institutions and sports organizations, or they may work in private practice."},{"level":2,"heirachical_structure":"Major group","code":"32","title":"Technical occupations in health"},{"level":3,"heirachical_structure":"Minor group","code":"321","title":"Medical technologists and technicians (except dental health)"},{"level":4,"heirachical_structure":"Unit group","code":"3211","title":"Medical laboratory technologists","description":"Medical laboratory technologists conduct medical laboratory tests, experiments and analyses to assist in the diagnosis, treatment and prevention of disease. They are employed in medical laboratories in hospitals, blood banks, community and private clinics, research facilities and post-secondary educational institutions. Medical laboratory technologists who are supervisors are included in this unit group."},{"level":4,"heirachical_structure":"Unit group","code":"3212","title":"Medical laboratory technicians and pathologists' assistants","description":"Medical laboratory technicians conduct routine medical laboratory tests and set up, clean and maintain medical laboratory equipment. They are employed in medical laboratories in hospitals, clinics, research facilities, post-secondary educational institutions and government research laboratories. Pathologists' assistants assist at autopsies and examinations of surgical specimens or perform autopsies under a pathologist's supervision. They are usually employed in hospitals and universities."},{"level":4,"heirachical_structure":"Unit group","code":"3213","title":"Animal health technologists and veterinary technicians","description":"Animal health technologists and veterinary technicians provide technical support to veterinarians by caring for animals and assisting in the diagnosis and treatment of animal health disorders. They are employed in veterinary clinics, animal hospitals, animal shelters, humane societies, zoos, animal research laboratories, pharmaceutical companies and government. Animal health technologists and veterinary technicians who are supervisors are included in this unit group."},{"level":4,"heirachical_structure":"Unit group","code":"3214","title":"Respiratory therapists, clinical perfusionists and cardiopulmonary technologists","description":"Respiratory therapists assist physicians in the diagnosis, treatment and care of patients with respiratory and cardiopulmonary disorders. Clinical perfusionists provide technical support to patients undergoing cardiac surgery and patients requiring cardio-respiratory support. Cardiopulmonary technologists assist physicians in the technical aspects of diagnosis and treatment of cardiovascular and pulmonary disease. Respiratory therapists are employed in hospitals, extended care facilities, public health centres and respiratory home care companies. Clinical perfusionists and cardiopulmonary technologists are primarily employed in hospitals. Respiratory therapists, clinical perfusionists and cardiopulmonary technologists who are supervisors or instructors are included in this unit group."},{"level":4,"heirachical_structure":"Unit group","code":"3215","title":"Medical radiation technologists","description":"This unit group includes technologists who operate radiographic and radiation therapy equipment to administer radiation treatment and produce images of body structures for the diagnosis and treatment of injury and disease. They are employed in hospitals, cancer treatment centres, clinics, radiological laboratories, colleges and universities. Medical radiation technologists who are supervisors or instructors are included in this unit group."},{"level":4,"heirachical_structure":"Unit group","code":"3216","title":"Medical sonographers","description":"Medical sonographers operate ultrasound equipment to produce and record images of various parts of the body to aid physicians in monitoring pregnancies and in diagnosing cardiac, ophthalmic, vascular and other medical disorders. They are employed in clinics and hospitals. Medical sonographers who are supervisors or instructors are included in this unit group."},{"level":4,"heirachical_structure":"Unit group","code":"3217","title":"Cardiology technologists and electrophysiological diagnostic technologists, n.e.c.","description":"Cardiology technologists operate electrocardiogram and other electronic equipment to record cardiac activity of patients to aid in the diagnosis, monitoring and treatment of heart disease. Electrophysiological diagnostic technologists, not elsewhere classified, operate electroencephalographic, electromyographic and other electrophysiological diagnostic equipment to assist physicians in diagnosing diseases, injuries and abnormalities. Cardiology technologists and electrophysiological diagnostic technologists who are supervisors or instructors are included in this unit group. They are employed in clinics, hospitals and medical laboratories."},{"level":4,"heirachical_structure":"Unit group","code":"3219","title":"Other medical technologists and technicians (except dental health)","description":"This unit group includes medical technologists and technicians not elsewhere classified, such as dietary technicians, pharmacy technicians, ocularists, prosthetists, orthotists, prosthetic technicians and orthotic technicians. Dietary technicians are employed in health care and commercial food service establishments such as hospitals, extended care facilities, nursing homes, schools, cafeterias and fast food outlets. Pharmacy technicians are employed in retail and hospital pharmacies, long-term care facilities and by pharmaceutical manufacturers. Ocularists are employed in custom ocular prosthetic laboratories, or they may be self-employed. Prosthetists, orthotists and prosthetic and orthotic technicians are employed in hospitals, clinics, prosthetics and orthotics laboratories, and prosthetic device manufacturing companies. Prosthetists and orthotists may also be self-employed."},{"level":3,"heirachical_structure":"Minor group","code":"322","title":"Technical occupations in dental health care"},{"level":4,"heirachical_structure":"Unit group","code":"3221","title":"Denturists","description":"Denturists examine patients and design, construct and repair removable dentures. Most denturists work in private practice."},{"level":4,"heirachical_structure":"Unit group","code":"3222","title":"Dental hygienists and dental therapists","description":"Dental hygienists provide dental hygiene treatment and information related to the prevention of diseases and disorders of the teeth and mouth. They are employed in dentists' offices, hospitals, clinics, educational institutions, government agencies and private industry. Dental therapists carry out limited dental services related to the prevention and treatment of diseases and disorders of the teeth and mouth. They are employed by the federal government and the provincial governments to provide services in rural and remote communities."},{"level":4,"heirachical_structure":"Unit group","code":"3223","title":"Dental technologists, technicians and laboratory assistants","description":"Dental technologists and technicians design, prepare and fabricate dentures and dental devices as prescribed by dentists and other specialists. Dental laboratory assistants assist dental technologists and technicians in preparing and fabricating dentures and other dental devices. They are employed in dental laboratories. Dental technologists and technicians who are supervisors are included in this unit group."},{"level":3,"heirachical_structure":"Minor group","code":"323","title":"Other technical occupations in health care"},{"level":4,"heirachical_structure":"Unit group","code":"3231","title":"Opticians","description":"Opticians fit clients with prescription eyeglasses or contact lenses, assist clients in the selection of eyeglass frames, arrange for the production of eyeglasses or contact lenses and mount lenses in eyeglass frames. They are employed in optical retail outlets or other establishments with optical dispensing departments, or they may be self-employed. Student opticians and opticians who are managers of optical retail outlets are included in this unit group."},{"level":4,"heirachical_structure":"Unit group","code":"3232","title":"Practitioners of natural healing","description":"Practitioners of natural healing provide health care to patients using traditional Chinese medicine techniques and other forms of treatment including acupuncture, herbology or reflexology to promote, maintain and restore the holistic health of patients. They usually work in private practice, including group or team practices, or are employed by clinics, health clubs and spas."},{"level":4,"heirachical_structure":"Unit group","code":"3233","title":"Licensed practical nurses","description":"Licensed practical nurses provide nursing care usually under the direction of medical practitioners, registered nurses or other health team members. They are employed in hospitals, nursing homes, extended care facilities, rehabilitation centres, doctors' offices, clinics, companies, private homes and community health centres. Operating room technicians are included in this unit group."},{"level":4,"heirachical_structure":"Unit group","code":"3234","title":"Paramedical occupations","description":"This unit group includes workers who administer pre-hospital emergency medical care to patients with injuries or medical illnesses and transport them to hospitals or other medical facilities for further medical care. They are employed by private ambulance services, hospitals, fire departments, government departments and agencies, manufacturing firms, mining companies and other private sector establishments. Paramedics who are supervisors are included in this unit group."},{"level":4,"heirachical_structure":"Unit group","code":"3236","title":"Massage therapists","description":"Massage therapists assess soft tissues and joints of the body for treatment and prevention of dysfunction, injury, pain and physical disorders. Massage therapists work in private practice, including group or team practices, hospitals, clinics, extended care facilities, rehabilitation centres and educational institutions."},{"level":4,"heirachical_structure":"Unit group","code":"3237","title":"Other technical occupations in therapy and assessment","description":"This unit group includes workers, not elsewhere classified, who perform various technical therapy and assessment functions. Some may assist professionals such as audiologists, speech-language pathologists, ophthalmologists, physiotherapists and occupational therapists. They are employed in hospitals, clinics, extended care facilities, rehabilitation centres, educational institutions and in the private practices of the professionals they assist."},{"level":2,"heirachical_structure":"Major group","code":"34","title":"Assisting occupations in support of health services"},{"level":3,"heirachical_structure":"Minor group","code":"341","title":"Assisting occupations in support of health services"},{"level":4,"heirachical_structure":"Unit group","code":"3411","title":"Dental assistants","description":"Dental assistants assist dentists, dental hygienists and dental therapists during the examination and treatment of patients and perform clerical functions. Dental assistants work in dentists' offices, community health centres, clinics and in educational institutions."},{"level":4,"heirachical_structure":"Unit group","code":"3413","title":"Nurse aides, orderlies and patient service associates","description":"Nurse aides, orderlies and patient service associates assist nurses, hospital staff and physicians in the basic care of patients. They are employed in hospitals, nursing homes, assisted care facilities for the elderly and other health care establishments."},{"level":4,"heirachical_structure":"Unit group","code":"3414","title":"Other assisting occupations in support of health services","description":"This unit group includes workers who provide services and assistance to health care professionals and other health care staff. They are employed in hospitals, medical clinics, offices of health care professionals, nursing homes, optical retail stores and laboratories, pharmacies and medical pathology laboratories."},{"level":1,"heirachical_structure":"Broad occupational category","code":"4","title":"Occupations in education, law and social, community and government services"},{"level":2,"heirachical_structure":"Major group","code":"40","title":"Professional occupations in education services"},{"level":3,"heirachical_structure":"Minor group","code":"401","title":"University professors and post-secondary assistants"},{"level":4,"heirachical_structure":"Unit group","code":"4011","title":"University professors and lecturers","description":"University professors and lecturers teach courses to undergraduate and graduate students and conduct research at universities. University professors who are heads of departments are included in this unit group."},{"level":4,"heirachical_structure":"Unit group","code":"4012","title":"Post-secondary teaching and research assistants","description":"Post-secondary teaching and research assistants assist university professors, community college and CEGEP teachers and other faculty members in teaching and research activities at universities and colleges."},{"level":3,"heirachical_structure":"Minor group","code":"402","title":"College and other vocational instructors"},{"level":4,"heirachical_structure":"Unit group","code":"4021","title":"College and other vocational instructors","description":"This unit group includes instructors who teach applied arts, academic, technical and vocational subjects to students at community colleges, CEGEPs, agricultural colleges, technical and vocational institutes, language schools and other college level schools. This unit group also includes trainers who are employed by private training establishments, companies, community agencies and governments to deliver internal training or development courses. College teachers who are heads of departments are included in this group."},{"level":3,"heirachical_structure":"Minor group","code":"403","title":"Secondary and elementary school teachers and educational counsellors"},{"level":4,"heirachical_structure":"Unit group","code":"4031","title":"Secondary school teachers","description":"Secondary school teachers prepare and teach academic, technical, vocational or specialized subjects at public and private secondary schools. Secondary school teachers who are heads of departments are included in this group."},{"level":4,"heirachical_structure":"Unit group","code":"4032","title":"Elementary school and kindergarten teachers","description":"Elementary school and kindergarten teachers teach basic subjects such as reading, writing and arithmetic or specialized subjects such as English or French as a second language at public and private elementary schools."},{"level":4,"heirachical_structure":"Unit group","code":"4033","title":"Educational counsellors","description":"Educational counsellors advise current and prospective students on educational issues, career planning and personal development, and co-ordinate the provision of counselling services to students, parents, teachers, faculty and staff. They are employed by school boards and post-secondary educational institutions."},{"level":2,"heirachical_structure":"Major group","code":"41","title":"Professional occupations in law and social, community and government services"},{"level":3,"heirachical_structure":"Minor group","code":"411","title":"Judges, lawyers and Quebec notaries"},{"level":4,"heirachical_structure":"Unit group","code":"4111","title":"Judges","description":"Judges adjudicate civil and criminal cases and administer justice in courts of law. Judges preside over federal and provincial courts."},{"level":4,"heirachical_structure":"Unit group","code":"4112","title":"Lawyers and Quebec notaries","description":"Lawyers and Quebec notaries advise clients on legal matters, represent clients before administration boards and draw up legal documents such as contracts and wills. Lawyers also plead cases, represent clients before tribunals and conduct prosecutions in courts of law. Lawyers are employed in law firms and prosecutor's offices. Quebec notaries are employed in notary offices. Both lawyers and Quebec notaries are employed by federal, provincial and municipal governments and various business establishments or they may be self-employed. Articling students are included in this group."},{"level":3,"heirachical_structure":"Minor group","code":"415","title":"Social and community service professionals"},{"level":4,"heirachical_structure":"Unit group","code":"4151","title":"Psychologists","description":"Psychologists assess and diagnose behavioural, emotional and cognitive disorders, counsel clients, provide therapy, conduct research and apply theory relating to behaviour and mental processes. Psychologists help clients work toward the maintenance and enhancement of psychological, physical, intellectual, emotional, social and interpersonal functioning. Psychologists work in private practice or in clinics, correctional facilities, hospitals, mental health facilities, rehabilitation centres, community service organizations, businesses, schools and universities, and in government and private research agencies."},{"level":4,"heirachical_structure":"Unit group","code":"4152","title":"Social workers","description":"Social workers help individuals, couples, families, groups, communities and organizations develop the skills and resources they need to enhance social functioning and provide counselling, therapy and referral to other supportive social services. Social workers also respond to other social needs and issues such as unemployment, racism and poverty. They are employed by hospitals, school boards, social service agencies, child welfare organizations, correctional facilities, community agencies, employee assistance programs and Aboriginal band councils, or they may work in private practice."},{"level":4,"heirachical_structure":"Unit group","code":"4153","title":"Family, marriage and other related counsellors","description":"Family, marriage and other related counsellors assist individuals and groups of clients to identify, understand and overcome personal problems and achieve personal objectives. They are employed by counselling centres, social service agencies, group homes, government agencies, family therapy centres, and health care and rehabilitation facilities, or they may work in private practice."},{"level":4,"heirachical_structure":"Unit group","code":"4154","title":"Professional occupations in religion","description":"Ministers of religion conduct religious services, administer the rites of a religious faith or denomination, provide spiritual and moral guidance and perform other functions associated with the practice of a religion. Ministers of religion perform these duties in churches, synagogues, temples or other places of worship. They may also work in other institutions such as schools, hospitals and prisons."},{"level":4,"heirachical_structure":"Unit group","code":"4155","title":"Probation and parole officers and related occupations","description":"Probation officers monitor the conduct and behaviour of criminal offenders serving probation terms. Parole officers monitor the reintegration of criminal offenders serving the remainder of sentences while conditionally released into the community on parole. Classification officers assess inmates and develop rehabilitation programs for criminal offenders who are incarcerated in correctional facilities. They are employed by federal and provincial governments and work in the community and in correctional facilities."},{"level":4,"heirachical_structure":"Unit group","code":"4156","title":"Employment counsellors","description":"Employment counsellors provide assistance and information to job seeker clients on all aspects of employment search and career planning. They also provide advice and information to employer clients regarding employment issues and human resources. Employment counsellors are employed by human resource departments of establishments, employment service organizations, consulting firms, correctional facilities and by federal and provincial governments. Supervisors of employment counsellors are included in this unit group."},{"level":3,"heirachical_structure":"Minor group","code":"416","title":"Policy and program researchers, consultants and officers"},{"level":4,"heirachical_structure":"Unit group","code":"4161","title":"Natural and applied science policy researchers, consultants and program officers","description":"Natural and applied science policy researchers, consultants and program officers conduct research, prepare reports, provide consultation and advice and administer programs in a variety of areas related to the natural and applied sciences. They are employed by federal, provincial and municipal governments, computer and office furniture manufacturers, educational institutions, research organizations, consulting firms, environmental and conservation organizations, or they may be self-employed."},{"level":4,"heirachical_structure":"Unit group","code":"4162","title":"Economists and economic policy researchers and analysts","description":"Economists and economic policy researchers and analysts conduct research, monitor data, analyze information and prepare reports and plans to resolve economic and business problems and develop models to analyze, explain and forecast economic behaviour and patterns. They advise on matters such as finance, fiscal and monetary policy, international trade, agricultural and natural resource commodities and labour and industrial markets. They are employed by government departments and agencies and throughout the private sector in associations, unions, research organizations, banks and investment firms."},{"level":4,"heirachical_structure":"Unit group","code":"4163","title":"Business development officers and marketing researchers and consultants","description":"Business development officers and marketing researchers and consultants conduct research, formulate policies and manage programs to stimulate industrial and commercial business investment or tourism in urban and rural areas, or to promote commercial or industrial products and services. They are employed by government departments, international organizations, marketing firms and business associations or may be self-employed."},{"level":4,"heirachical_structure":"Unit group","code":"4164","title":"Social policy researchers, consultants and program officers","description":"Social policy researchers, consultants and program officers conduct research, develop policy and implement or administer programs in areas such as consumer affairs, employment, home economics, immigration, law enforcement, corrections, human rights, housing, labour, family services, foreign aid and international development. They are employed by government departments and agencies, industry, hospitals, educational institutions, consulting establishments, professional associations, research institutes, non-government organizations and international organizations or they may be self-employed."},{"level":4,"heirachical_structure":"Unit group","code":"4165","title":"Health policy researchers, consultants and program officers","description":"Health policy researchers, consultants and program officers conduct research, produce reports and administer health care policies and programs. They are employed by government departments and agencies, consulting establishments, universities, research institutes, hospitals, community agencies, educational institutions, professional associations, non-governmental organizations and international organizations."},{"level":4,"heirachical_structure":"Unit group","code":"4166","title":"Education policy researchers, consultants and program officers","description":"Education policy researchers, consultants and program officers conduct research, produce reports and administer elementary, secondary and post-secondary education policies and programs. They are employed by government departments, school boards, research institutes, professional associations and educational and other organizations throughout the public and private sectors, or they may be self-employed."},{"level":4,"heirachical_structure":"Unit group","code":"4167","title":"Recreation, sports and fitness policy researchers, consultants and program officers","description":"This unit group includes those who oversee and administer recreation, sports and fitness programs and activities, provide consulting services, conduct research and develop programs and policies related to recreation, sports and physical fitness. They are employed by federal, provincial and municipal governments, recreation, sports, fitness and health care facilities, retirement homes, community centres, sports and fitness consulting firms and organizations, or they may be self-employed."},{"level":4,"heirachical_structure":"Unit group","code":"4168","title":"Program officers unique to government","description":"Program officers in this unit group are primarily concerned with the administration and operation of government institutions, such as Parliament, and activities unique to the operations of government, such as international relations, federal-provincial affairs, elections and tribunals."},{"level":4,"heirachical_structure":"Unit group","code":"4169","title":"Other professional occupations in social science, n.e.c.","description":"This unit group includes anthropologists, archaeologists, geographers, historians, linguists, political scientists, sociologists and other professional occupations in social science not elsewhere classified. They are employed in universities and throughout the public and private sectors."},{"level":2,"heirachical_structure":"Major group","code":"42","title":"Paraprofessional occupations in legal, social, community and education services"},{"level":3,"heirachical_structure":"Minor group","code":"421","title":"Paraprofessional occupations in legal, social, community and education services"},{"level":4,"heirachical_structure":"Unit group","code":"4211","title":"Paralegal and related occupations","description":"Paralegals prepare legal documents and conduct research to assist lawyers or other professionals. Independent paralegals provide legal services to the public as allowed by government legislation, or provide paralegal services on contract to law firms or other establishments. Notaries public administer oaths, take affidavits, sign legal documents and perform other activities according to the scope of their practice. Trademark agents advise clients on intellectual property matters. Paralegals are employed by law firms, by record search companies and in legal departments throughout the public and private sectors. Independent paralegals are usually self-employed. Notaries public are employed by government and in the public and private sectors or they may be self-employed. Trademark agents are employed by law firms and legal departments throughout the public and private sectors, trademark development and search firms or they may be self-employed."},{"level":4,"heirachical_structure":"Unit group","code":"4212","title":"Social and community service workers","description":"Social and community service workers administer and implement a variety of social assistance programs and community services, and assist clients to deal with personal and social problems. They are employed by social service and government agencies, mental health agencies, group homes, shelters, substance abuse centres, school boards, correctional facilities and other establishments."},{"level":4,"heirachical_structure":"Unit group","code":"4214","title":"Early childhood educators and assistants","description":"Early childhood educators plan, organize and implement programs for children between the ages of infancy and 12 years. Early childhood educator assistants provide care for infants and preschool- to school-age children under the guidance of early childhood educators. Early childhood educators and assistants lead children in activities to stimulate and develop their intellectual, physical and emotional growth and ensure their security and well-being. They are employed in child-care centres, daycare centres, kindergartens, agencies for exceptional children and other settings where early childhood education services are provided. Supervisors of early childhood educators and assistants are included in this unit group."},{"level":4,"heirachical_structure":"Unit group","code":"4215","title":"Instructors of persons with disabilities","description":"Instructors of persons with disabilities teach children and adults using a variety of techniques to facilitate communication, rehabilitation, social skills and increased independence. They are employed in rehabilitation centres, specialized educational institutes and throughout the school system."},{"level":4,"heirachical_structure":"Unit group","code":"4216","title":"Other instructors","description":"Instructors in this unit group teach courses, such as motor vehicle or motorcycle driving, sailing and navigation, sewing or other courses, which are outside of educational institutions and not primarily job-related. They are employed by driving schools, fabric retailers and other commercial establishments or they may be self-employed. This unit group also includes modelling and finishing school instructors, driver's licence examiners, who are employed by provincial governments and tutors who provide instruction in elementary or secondary school subjects."},{"level":4,"heirachical_structure":"Unit group","code":"4217","title":"Other religious occupations","description":"This unit group includes brothers, nuns, monks, religious education workers and others who provide support to ministers of religion or to a religious community and who perform certain functions associated with the practice of a religion. They may perform these duties in churches, synagogues, temples or other places of worship or in institutions such as schools, hospitals and prisons."},{"level":2,"heirachical_structure":"Major group","code":"43","title":"Occupations in front-line public protection services"},{"level":3,"heirachical_structure":"Minor group","code":"431","title":"Occupations in front-line public protection services"},{"level":4,"heirachical_structure":"Unit group","code":"4311","title":"Police officers (except commissioned)","description":"Police officers protect the public, detect and prevent crime and perform other activities directed at maintaining law and order. They are employed by municipal and federal governments and some provincial and regional governments. This unit group includes railway police."},{"level":4,"heirachical_structure":"Unit group","code":"4312","title":"Firefighters","description":"Firefighters carry out firefighting and fire prevention activities, and assist in other emergencies. They are employed by municipal, provincial and federal governments and by large industrial establishments that have internal firefighting services."},{"level":4,"heirachical_structure":"Unit group","code":"4313","title":"Non-commissioned ranks of the Canadian Forces","description":"This unit group consists of Canadian Forces personnel who are non-commissioned officers (NCOs) or members of other non-commissioned ranks. They provide collective defence measures to protect Canadian waters, land, airspace and other interests. All ranks of non-commissioned officers and members in the air force, army, and navy are included in this unit group."},{"level":2,"heirachical_structure":"Major group","code":"44","title":"Care providers and educational, legal and public protection support occupations"},{"level":3,"heirachical_structure":"Minor group","code":"441","title":"Home care providers and educational support occupations"},{"level":4,"heirachical_structure":"Unit group","code":"4411","title":"Home child care providers","description":"Home child care providers care for children on an ongoing or short-term basis. They care for the well-being and physical and social development of children, assist parents with child care and may assist with household duties. They provide care primarily in their own homes or in the children's homes, where they may also reside. They are employed by private households and child-care agencies, or they may be self-employed. Foster parents are included in this unit group."},{"level":4,"heirachical_structure":"Unit group","code":"4412","title":"Home support workers, housekeepers and related occupations","description":"Home support workers provide personal care and companionship for seniors, persons with disabilities and convalescent clients. Care is provided within the client's residence, in which the home support worker may also reside. They are employed by home care and support agencies, private households, or they may be self-employed. Housekeepers perform housekeeping and other home management duties in private households and other non-institutional, residential settings."},{"level":4,"heirachical_structure":"Unit group","code":"4413","title":"Elementary and secondary school teacher assistants","description":"Elementary and secondary school teacher assistants support students, and assist teachers and counsellors with teaching and non-instructional tasks. They assist in areas of personal care, teaching and behaviour management under the supervision of teachers or other child care professionals. They are employed in public and private elementary, secondary and special needs schools and treatment centres."},{"level":3,"heirachical_structure":"Minor group","code":"442","title":"Legal and public protection support occupations"},{"level":4,"heirachical_structure":"Unit group","code":"4421","title":"Sheriffs and bailiffs","description":"Sheriffs execute and enforce court orders, warrants and writs, participate in seizure and sale of property and perform courtroom and other related duties. Bailiffs serve legal orders and documents, seize or repossess properties, evict tenants and perform other related activities. Sheriffs and bailiffs are employed by provincial or territorial courts, and bailiffs may be employed as officers of the court or in private service as agents for creditors."},{"level":4,"heirachical_structure":"Unit group","code":"4422","title":"Correctional service officers","description":"Correctional service officers guard offenders and detainees and maintain order in correctional institutions and other places of detention. They are employed by federal, provincial and municipal governments. Correctional service officers who are supervisors are included in this unit group."},{"level":4,"heirachical_structure":"Unit group","code":"4423","title":"By-law enforcement and other regulatory officers, n.e.c.","description":"Officers and inspectors in this unit group enforce by-laws and regulations of provincial and municipal governments. They are employed by provincial and municipal governments and agencies."},{"level":1,"heirachical_structure":"Broad occupational category","code":"5","title":"Occupations in art, culture, recreation and sport"},{"level":2,"heirachical_structure":"Major group","code":"51","title":"Professional occupations in art and culture"},{"level":3,"heirachical_structure":"Minor group","code":"511","title":"Librarians, archivists, conservators and curators"},{"level":4,"heirachical_structure":"Unit group","code":"5111","title":"Librarians","description":"Librarians select, develop, organize and maintain library collections and provide advisory services for users. They are employed in libraries or in a department within a library."},{"level":4,"heirachical_structure":"Unit group","code":"5112","title":"Conservators and curators","description":"Conservators restore and conserve artifacts belonging to museums, galleries and owners of cultural property. Curators recommend the acquisition of museum artifacts and gallery works of art and research their artistic history. Conservators and curators are employed in museums, art galleries and universities. Conservators may be self-employed."},{"level":4,"heirachical_structure":"Unit group","code":"5113","title":"Archivists","description":"Archivists manage, process, store and disseminate information contained in an organization's archives. They acquire, store and research textual material, pictures, maps, architectural documents, electronic materials, films and videos, and sound recordings and multimedia materials. Archivists are employed in archives, in the public and para-public sectors and in private sector organizations."},{"level":3,"heirachical_structure":"Minor group","code":"512","title":"Writing, translating and related communications professionals"},{"level":4,"heirachical_structure":"Unit group","code":"5121","title":"Authors and writers","description":"Authors and writers plan, research and write books, scripts, storyboards, plays, essays, speeches, manuals, specifications and other non-journalistic articles for publication or presentation. They are employed by advertising agencies, governments, large corporations, private consulting firms, publishing firms, multimedia/new-media companies and other establishments, or they may be self-employed."},{"level":4,"heirachical_structure":"Unit group","code":"5122","title":"Editors","description":"Editors review, evaluate and edit manuscripts, articles, news reports and other material for publication, broadcast or interactive media and co-ordinate the activities of writers, journalists and other staff. They are employed by publishing firms, magazines, journals, newspapers, radio and television networks and stations, and by companies and government departments that produce publications such as newsletters, handbooks, manuals and Web sites. Editors may also work on a freelance basis."},{"level":4,"heirachical_structure":"Unit group","code":"5123","title":"Journalists","description":"Journalists research, investigate, interpret and communicate news and public affairs through newspapers, television, radio and other media. Journalists are employed by radio and television networks and stations, newspapers and magazines. Journalists may also work on a freelance basis."},{"level":4,"heirachical_structure":"Unit group","code":"5125","title":"Translators, terminologists and interpreters","description":"Translators translate written material from one language to another. Interpreters translate oral communication from one language to another during speeches, meetings, conferences, debates and conversation, or in court or before administrative tribunals. Terminologists conduct research to itemize terms connected with a certain field, define them and find equivalents in another language. Sign language interpreters use sign language to translate spoken language and vice versa during meetings, conversations, television programs or in other instances. Translators, terminologists and interpreters are employed by government, private translation and interpretation agencies, in-house translation services, large private corporations, international organizations and the media, or they may be self-employed. Sign language interpreters work in schools and courts, and for social service agencies, interpretation services, government services and television stations, or they may be self-employed."},{"level":3,"heirachical_structure":"Minor group","code":"513","title":"Creative and performing artists"},{"level":4,"heirachical_structure":"Unit group","code":"5131","title":"Producers, directors, choreographers and related occupations","description":"This unit group includes producers, directors, choreographers and others who oversee and control the technical and artistic aspects of film, television, radio, dance and theatre productions. They are employed by film production companies, radio and television stations, broadcast departments, advertising companies, sound recording studios, record production companies and dance companies. They may also be self-employed."},{"level":4,"heirachical_structure":"Unit group","code":"5132","title":"Conductors, composers and arrangers","description":"This unit group includes those who conduct bands and orchestras, compose musical works and arrange instrumental and vocal compositions. They are employed by symphony and chamber orchestras, bands, choirs, sound recording companies, and orchestras for ballet and opera performances, or they may be self-employed."},{"level":4,"heirachical_structure":"Unit group","code":"5133","title":"Musicians and singers","description":"This unit group includes musicians, singers and teachers of vocal and instrumental music. Musicians and singers perform with orchestras, choirs, opera companies and popular bands in establishments such as concert halls, lounges and theatres and in film, television and recording studios. Music teachers teach in conservatories, academies and private homes."},{"level":4,"heirachical_structure":"Unit group","code":"5134","title":"Dancers","description":"This unit group includes dancers and dance teachers. Dancers are employed by ballet and dance companies, television and film productions and night clubs and similar establishments. Dance teachers are employed by dance academies and dance schools."},{"level":4,"heirachical_structure":"Unit group","code":"5135","title":"Actors and comedians","description":"Actors and comedians perform roles in motion picture, television, theatre and radio productions to entertain a variety of audiences. They are employed by motion picture, television, theatre and other production companies. This unit group includes acting teachers employed by private acting schools."},{"level":4,"heirachical_structure":"Unit group","code":"5136","title":"Painters, sculptors and other visual artists","description":"Painters, sculptors and other visual artists create original paintings, drawings, sculptures, engravings and other artistic works. They are usually self-employed. This group also includes art instructors and teachers, who are usually employed by art schools."},{"level":2,"heirachical_structure":"Major group","code":"52","title":"Technical occupations in art, culture, recreation and sport"},{"level":3,"heirachical_structure":"Minor group","code":"521","title":"Technical occupations in libraries, public archives, museums and art galleries"},{"level":4,"heirachical_structure":"Unit group","code":"5211","title":"Library and public archive technicians","description":"Library and public archive technicians assist users in accessing library or archive resources, assist in describing new acquisitions, participate in archive processing and storage, and conduct reference searches. They are employed by libraries and public archives."},{"level":4,"heirachical_structure":"Unit group","code":"5212","title":"Technical occupations related to museums and art galleries","description":"This unit group includes workers who classify and catalogue museum artifacts and gallery works of art, construct and install exhibits and displays, restore, maintain and store museum and gallery collections, frame artwork, and perform other functions in support of curatorial and conservation activities. They are employed in museums and galleries. Picture framers and taxidermists may also be employed in retail settings or may be self-employed. This unit group also includes museum and other interpreters who conduct guided tours. They are employed by art galleries, museums, parks, aquariums, zoos, interpretive centres, botanical gardens, cultural centres, nature sanctuaries, historic and heritage sites, and other locations."},{"level":3,"heirachical_structure":"Minor group","code":"522","title":"Photographers, graphic arts technicians and technical and co-ordinating occupations in motion pictures, broadcasting and the performing arts"},{"level":4,"heirachical_structure":"Unit group","code":"5221","title":"Photographers","description":"Photographers operate still cameras to photograph people, events, scenes, materials, products and other subjects. Photographers are employed by photographic studios, newspapers, magazines, museums and government, or they may be self-employed."},{"level":4,"heirachical_structure":"Unit group","code":"5222","title":"Film and video camera operators","description":"Film and video camera operators operate motion picture and video cameras and related equipment to record news, live events, films, videos and television broadcasts. They are employed by television networks and stations, motion picture and video production companies and in-house communications facilities of large corporations."},{"level":4,"heirachical_structure":"Unit group","code":"5223","title":"Graphic arts technicians","description":"Graphic arts technicians assist in conceptualizing a project, interpreting design specifications or sketches, preparing the page make-up, lay-out and lettering, and preparing production materials for press, electronic or multimedia publishing. They are employed by publishing, communications, advertising, marketing, printing and multimedia establishments, and by television and film production companies. They may also be self-employed."},{"level":4,"heirachical_structure":"Unit group","code":"5224","title":"Broadcast technicians","description":"Broadcast technicians install, set up, test, operate and repair electronic equipment used to record and transmit live and taped radio and television programs and to produce audio and video streaming broadcasts for the Internet. They are employed by radio and television broadcasting networks and stations, by broadcast equipment companies and by Internet-based communication providers."},{"level":4,"heirachical_structure":"Unit group","code":"5225","title":"Audio and video recording technicians","description":"Audio and video recording technicians operate equipment to record, mix and edit sound, music and videotape, for motion pictures, television and radio programs, videos, recordings and live events. They are employed by multimedia companies, film, video and concert production companies, sound recording firms, theatre and dance companies, educational establishments, clubs, hotels, bands, radio stations, television networks and video production and editing companies."},{"level":4,"heirachical_structure":"Unit group","code":"5226","title":"Other technical and co-ordinating occupations in motion pictures, broadcasting and the performing arts","description":"This unit group includes a range of technical, co-ordinating and supervisory workers who co-ordinate and perform specific activities for television, radio and motion picture productions, news broadcasts, theatre and stage productions, and other live or recorded productions. They are employed by television and radio stations and networks, recording studios, motion picture and video production companies, concert promoters and theatre, stage and dance companies."},{"level":4,"heirachical_structure":"Unit group","code":"5227","title":"Support occupations in motion pictures, broadcasting, photography and the performing arts","description":"This unit group includes workers who perform support duties related to broadcasting and to the production of motion pictures and the performing arts. They are employed by television and radio stations and networks, recording studios, motion picture and video production companies and by theatre and stage companies. This unit group also includes projectionists employed by movie theatres."},{"level":3,"heirachical_structure":"Minor group","code":"523","title":"Announcers and other performers, n.e.c."},{"level":4,"heirachical_structure":"Unit group","code":"5231","title":"Announcers and other broadcasters","description":"Announcers and other broadcasters read news, sports, weather, commercial and public service messages and host entertainment and information programs for broadcast on radio or television. They are primarily employed by radio and television stations and networks and by commercial firms that produce advertisements for radio or television."},{"level":4,"heirachical_structure":"Unit group","code":"5232","title":"Other performers, n.e.c.","description":"This unit group includes circus performers, magicians, models, puppeteers and other performers not elsewhere classified. They are employed by circuses, nightclubs, and theatre, advertising and other production companies, or they may be self-employed."},{"level":3,"heirachical_structure":"Minor group","code":"524","title":"Creative designers and craftspersons"},{"level":4,"heirachical_structure":"Unit group","code":"5241","title":"Graphic designers and illustrators","description":"Graphic designers conceptualize and produce graphic art and visual materials to effectively communicate information for publications, advertising, films, packaging, posters, signs and interactive media such as Web sites and CDs. They are employed by advertising and graphic design firms, by establishments with advertising or communications departments and by multimedia production companies, or they may be self-employed. Graphic designers who are also supervisors, project managers or consultants are included in this unit group. Illustrators conceptualize and create illustrations to represent information through images. They are almost solely self-employed."},{"level":4,"heirachical_structure":"Unit group","code":"5242","title":"Interior designers and interior decorators","description":"Interior designers and interior decorators conceptualize and produce aesthetic, functional and safe designs for interior spaces in residential, commercial, cultural, institutional and industrial buildings. They are employed by architectural and interior design firms, retail establishments, construction companies, hospitals, airlines, hotel and restaurant chains, and other establishments, or they may be self-employed."},{"level":4,"heirachical_structure":"Unit group","code":"5243","title":"Theatre, fashion, exhibit and other creative designers","description":"Designers in this unit group conceptualize and produce designs for film, television, theatre and video productions, garments and textiles, displays and exhibits, and for other creative items such as jewellery and trophies. Theatre designers are employed by performing arts and broadcasting companies and by festivals; fashion designers are employed by clothing and textiles companies or may be self-employed; and exhibit designers are employed by museums and retail establishments. Other creative designers in this unit group are employed by manufacturing establishments or may be self-employed."},{"level":4,"heirachical_structure":"Unit group","code":"5244","title":"Artisans and craftspersons","description":"This unit group includes those who use manual and artistic skills to design and make ornamental objects, pottery, stained glass, jewellery, rugs, blankets, other handicrafts and artistic floral arrangements. Makers of musical instruments are also included in this unit group. Most craftspersons are self-employed. Artistic floral arrangers are usually employed in florist shops and floral departments of retail establishments, or may be self-employed. Craft instructors are also included in this unit group and are employed by artisan guilds, colleges, private studios and recreational organizations."},{"level":4,"heirachical_structure":"Unit group","code":"5245","title":"Patternmakers - textile, leather and fur products","description":"Patternmakers in this unit group create master patterns for the production of garments, footwear and other textile, leather or fur products. They are employed by pattern manufacturers, textile, leather or fur products manufacturers, or they may be self-employed."},{"level":3,"heirachical_structure":"Minor group","code":"525","title":"Athletes, coaches, referees and related occupations"},{"level":4,"heirachical_structure":"Unit group","code":"5251","title":"Athletes","description":"Athletes participate in competitive sports events on an amateur or professional basis. They play team sports such as hockey, baseball, football and lacrosse; or compete in individual sports such as skiing, figure skating, boxing or track and field; or in games such as poker or chess. Athletes are employed by professional team organizations or they may be self-employed. This unit group also includes competitors such as chess players and poker players."},{"level":4,"heirachical_structure":"Unit group","code":"5252","title":"Coaches","description":"Coaches prepare and train individual athletes or teams for competitive events. They are employed by national and provincial sports organizations, professional and amateur sports teams, sports clubs and universities or they may be self-employed. This unit group also includes sports scouts who identify and recruit athletes for professional sports teams. They are employed by professional sports organizations."},{"level":4,"heirachical_structure":"Unit group","code":"5253","title":"Sports officials and referees","description":"Sports officials and referees observe and enforce rules and regulations governing sporting events, athletic games and sports competitions. They are employed by national, provincial and local sporting commissions, organizations and leagues."},{"level":4,"heirachical_structure":"Unit group","code":"5254","title":"Program leaders and instructors in recreation, sport and fitness","description":"Program leaders and instructors in recreation, sport and fitness lead and instruct groups and individuals in recreational, sports, fitness or athletic programs. They are employed by community centres, sports and fitness clubs, outdoor centres, resorts, recreational facilities, health care facilities, retirement homes, correctional institutions, government departments, private businesses, tourism associations and similar establishments."},{"level":1,"heirachical_structure":"Broad occupational category","code":"6","title":"Sales and service occupations"},{"level":2,"heirachical_structure":"Major group","code":"62","title":"Retail sales supervisors and specialized sales occupations"},{"level":3,"heirachical_structure":"Minor group","code":"621","title":"Retail sales supervisors"},{"level":4,"heirachical_structure":"Unit group","code":"6211","title":"Retail sales supervisors","description":"Retail sales supervisors supervise and co-ordinate the activities of workers in the following unit groups: Retail Salespersons and Sales Clerks (6421), Cashiers (6611), Grocery Clerks and Store Shelf Stockers (6622) and Other Elemental Sales Occupations (6623). They are employed by stores and other retail businesses, wholesale businesses that sell on a retail basis to the public, rental service establishments and businesses involved in door-to-door soliciting and telemarketing."},{"level":3,"heirachical_structure":"Minor group","code":"622","title":"Technical sales specialists in wholesale trade and retail and wholesale buyers"},{"level":4,"heirachical_structure":"Unit group","code":"6221","title":"Technical sales specialists - wholesale trade","description":"Technical sales specialists, wholesale trade, sell a range of technical goods and services, such as scientific, agricultural and industrial products, electricity, telecommunications services and computer services, to governments and to commercial and industrial establishments in domestic and international localities. They are employed by establishments that produce or provide technical goods and services, such as pharmaceutical companies, industrial equipment manufacturing companies, grain elevators, computer services firms, engineering firms and hydroelectric companies, or they may be self-employed technical sales specialists/agents who contract their services to other companies. Technical sales specialists who are supervisors are included in this unit group."},{"level":4,"heirachical_structure":"Unit group","code":"6222","title":"Retail and wholesale buyers","description":"Retail and wholesale buyers buy merchandise for resale by retail or wholesale establishments and are usually responsible for the merchandising operations of retail or wholesale establishments. Retail and wholesale buyers who are supervisors and those who are assistants are included in this unit group."},{"level":3,"heirachical_structure":"Minor group","code":"623","title":"Insurance, real estate and financial sales occupations"},{"level":4,"heirachical_structure":"Unit group","code":"6231","title":"Insurance agents and brokers","description":"Insurance agents and brokers sell life, automobile, property, health and other types of insurance to individuals, businesses and public institutions. Insurance agents are employed by individual insurance companies or are independent representatives of specific insurance companies. Insurance brokers are employed by brokerage firms, or may work in partnerships or hold sole proprietorship. Supervisors of insurance agents are included in this unit group."},{"level":4,"heirachical_structure":"Unit group","code":"6232","title":"Real estate agents and salespersons","description":"Real estate agents and salespersons act as agents for the sale or purchase of houses, apartments, commercial buildings, land and other real estate and are employed in the real estate industry."},{"level":4,"heirachical_structure":"Unit group","code":"6235","title":"Financial sales representatives","description":"Financial sales representatives sell basic deposit, investment and loan products and services to individuals and businesses. They work in banks, credit unions, trust companies and similar financial institutions."},{"level":2,"heirachical_structure":"Major group","code":"63","title":"Service supervisors and specialized service occupations"},{"level":3,"heirachical_structure":"Minor group","code":"631","title":"Service supervisors"},{"level":4,"heirachical_structure":"Unit group","code":"6311","title":"Food service supervisors","description":"Food service supervisors, supervise, direct and co-ordinate the activities of workers who prepare, portion and serve food. They are employed by hospitals and other health care establishments and by cafeterias, catering companies and other food service establishments."},{"level":4,"heirachical_structure":"Unit group","code":"6312","title":"Executive housekeepers","description":"Executive housekeepers direct and control the operations of housekeeping departments within hotels, hospitals and other establishments."},{"level":4,"heirachical_structure":"Unit group","code":"6313","title":"Accommodation, travel, tourism and related services supervisors","description":"Supervisors in this unit group supervise and co-ordinate the activities of hotel accommodation service clerks, casino workers, reservation clerks and other travel and accommodations workers not elsewhere classified. They are employed by service establishments throughout the public and private sectors."},{"level":4,"heirachical_structure":"Unit group","code":"6314","title":"Customer and information services supervisors","description":"Supervisors in this unit group supervise and co-ordinate the activities of workers in the following unit groups: Customer Service Representatives - Financial Institutions (6551) and Other Customer and Information Services Representatives (6552). They are employed by banks, trust companies, credit unions and similar financial institutions, retail establishments, contact centres, insurance, telephone and utility companies and other establishments throughout the private and public sectors."},{"level":4,"heirachical_structure":"Unit group","code":"6315","title":"Cleaning supervisors","description":"Cleaning supervisors supervise and co-ordinate the activities of workers in the following unit groups: Light Duty Cleaners (6731), Specialized Cleaners (6732), and Janitors, Caretakers and Building Superintendents (6733). Cleaning supervisors are employed by hospitals and other health care institutions, hotels, motels, schools and other educational institutions, commercial and industrial establishments, home and office cleaning establishments and by various specialized cleaning companies."},{"level":4,"heirachical_structure":"Unit group","code":"6316","title":"Other services supervisors","description":"Supervisors in this unit group supervise and co-ordinate the activities of dry cleaning, laundry, ironing, pressing and finishing workers, theatre ushers and attendants, sports and recreation club workers, commissionaires, security guards and other service workers not elsewhere classified. They are employed by service establishments throughout the public and private sectors."},{"level":3,"heirachical_structure":"Minor group","code":"632","title":"Chefs and cooks"},{"level":4,"heirachical_structure":"Unit group","code":"6321","title":"Chefs","description":"This unit group includes various types of chefs who plan and direct food preparation and cooking activities and who prepare and cook meals and specialty foods. They are employed in restaurants, hotels, hospitals and other health care institutions, central food commissaries, clubs and similar establishments, and on ships."},{"level":4,"heirachical_structure":"Unit group","code":"6322","title":"Cooks","description":"Cooks prepare and cook a wide variety of foods. They are employed in restaurants, hotels, hospitals and other health care institutions, central food commissaries, educational institutions and other establishments. Cooks are also employed aboard ships and at construction and logging campsites. Apprentice cooks are included in this unit group."},{"level":3,"heirachical_structure":"Minor group","code":"633","title":"Butchers and bakers"},{"level":4,"heirachical_structure":"Unit group","code":"6331","title":"Butchers, meat cutters and fishmongers - retail and wholesale","description":"Butchers, meat cutters and fishmongers, retail and wholesale, prepare standard cuts of meat, poultry, fish and shellfish for sale in retail or wholesale food establishments. They are employed in supermarkets, grocery stores, butcher shops and fish stores or may be self-employed. Butchers who are supervisors or heads of departments are included in this group."},{"level":4,"heirachical_structure":"Unit group","code":"6332","title":"Bakers","description":"Bakers prepare bread, rolls, muffins, pies, pastries, cakes and cookies in retail and wholesale bakeries and dining establishments. They are employed in bakeries, supermarkets, catering companies, hotels, restaurants, hospitals, and other institutions, or they may be self-employed. Bakers who are supervisors are included in this unit group."},{"level":3,"heirachical_structure":"Minor group","code":"634","title":"Specialized occupations in personal and customer services"},{"level":4,"heirachical_structure":"Unit group","code":"6341","title":"Hairstylists and barbers","description":"Hairstylists and barbers cut and style hair and perform related services. They are employed in hairstyling or hairdressing salons, barber shops, vocational schools, health care establishments and theatre, film and television establishments."},{"level":4,"heirachical_structure":"Unit group","code":"6342","title":"Tailors, dressmakers, furriers and milliners","description":"Tailors, dressmakers and furriers make, alter and repair tailored clothing, dresses, coats and other made-to-measure garments. Milliners make, alter and repair hats. This unit group also includes alterationists who fit, alter and repair garments. They are employed by clothing retailers, clothing alteration shops, dry cleaners and garment manufacturing companies or they may be self-employed."},{"level":4,"heirachical_structure":"Unit group","code":"6343","title":"Shoe repairers and shoemakers","description":"Shoe repairers repair footwear and shoemakers make specialized and custom shoes and boots. They are employed in shoe repair shops or custom shoemaking establishments, or they may be self-employed."},{"level":4,"heirachical_structure":"Unit group","code":"6344","title":"Jewellers, jewellery and watch repairers and related occupations","description":"Jewellers and related workers in this unit group fabricate, assemble, repair and appraise fine jewellery. Watch repairers and related workers in this unit group repair, clean, adjust and fabricate parts for clocks and watches. They are employed by jewellery, clock and watch manufacturers and retail stores, by jewellery and watch repair shops or they may be self-employed."},{"level":4,"heirachical_structure":"Unit group","code":"6345","title":"Upholsterers","description":"Upholsterers cover furniture, fixtures and similar items with fabric, leather or other upholstery materials. They are employed by furniture, aircraft, motor vehicle and other manufacturing companies, furniture retail outlets and repair shops or they may be self-employed."},{"level":4,"heirachical_structure":"Unit group","code":"6346","title":"Funeral directors and embalmers","description":"Funeral directors co-ordinate and arrange all aspects of funeral services. Embalmers prepare the remains of deceased persons for public visitation and burial. Funeral directors and embalmers are employed by funeral homes."},{"level":2,"heirachical_structure":"Major group","code":"64","title":"Sales representatives and salespersons - wholesale and retail trade"},{"level":3,"heirachical_structure":"Minor group","code":"641","title":"Sales and account representatives - wholesale trade (non-technical)"},{"level":4,"heirachical_structure":"Unit group","code":"6411","title":"Sales and account representatives - wholesale trade (non-technical)","description":"Sales representatives, wholesale trade (non-technical), sell non-technical goods and services to retail, wholesale, commercial, industrial, professional and other clients domestically and internationally. They are employed by establishments that produce or provide goods and services such as petroleum companies, food, beverage and tobacco producers, clothing manufacturers, motor vehicles and parts manufacturers, hotels, business services firms, and transportation companies. Auctioneers are included in this unit group. Sales representatives, wholesale trade who are supervisors are also included in this unit group."},{"level":3,"heirachical_structure":"Minor group","code":"642","title":"Retail salespersons"},{"level":4,"heirachical_structure":"Unit group","code":"6421","title":"Retail salespersons","description":"Retail salespersons sell, rent or lease a range of technical and non-technical goods and services directly to consumers. They are employed by stores and other retail businesses, as well as wholesale businesses that sell on a retail basis to the public."},{"level":2,"heirachical_structure":"Major group","code":"65","title":"Service representatives and other customer and personal services occupations"},{"level":3,"heirachical_structure":"Minor group","code":"651","title":"Occupations in food and beverage service"},{"level":4,"heirachical_structure":"Unit group","code":"6511","title":"Matres d'htel and hosts/hostesses","description":"Matres d'htel and hosts/hostesses greet patrons and escort them to tables, and supervise and co-ordinate the activities of food and beverage servers. They are employed in restaurants, hotel dining rooms, private clubs, cocktail lounges and similar establishments."},{"level":4,"heirachical_structure":"Unit group","code":"6512","title":"Bartenders","description":"Bartenders mix and serve alcoholic and non-alcoholic beverages. They are employed in restaurants, hotels, bars, taverns, private clubs, banquet halls and other licensed establishments. Supervisors of bartenders are included in this unit group."},{"level":4,"heirachical_structure":"Unit group","code":"6513","title":"Food and beverage servers","description":"Food and beverage servers take patrons' food and beverage orders and serve orders to patrons. They are employed in restaurants, hotels, bars, taverns, private clubs, banquet halls and similar establishments."},{"level":3,"heirachical_structure":"Minor group","code":"652","title":"Occupations in travel and accommodation"},{"level":4,"heirachical_structure":"Unit group","code":"6521","title":"Travel counsellors","description":"Travel counsellors advise clients on travel options and tour packages, make bookings and reservations, prepare tickets and receive payment. They are employed in travel agencies, transportation and tourism firms and hotel chains."},{"level":4,"heirachical_structure":"Unit group","code":"6522","title":"Pursers and flight attendants","description":"Airline pursers and flight attendants ensure the safety and comfort of passengers and crew members during flights. Ship pursers attend to the safety and comfort of passengers aboard ships. Airline pursers and flight attendants are employed by airline companies. Ship pursers are employed by tour boat or cruise ship companies."},{"level":4,"heirachical_structure":"Unit group","code":"6523","title":"Airline ticket and service agents","description":"Airline ticket and service agents issue tickets, provide fare quotations, make reservations, conduct passenger check-in, trace missing baggage, arrange for cargo shipments and perform other related customer service duties to assist airline passengers. Airline ticket and service agents are employed by airline companies. Load planners, who plan the positioning of cargo on aircraft, are also included in this unit group."},{"level":4,"heirachical_structure":"Unit group","code":"6524","title":"Ground and water transport ticket agents, cargo service representatives and related clerks","description":"Ticket agents, cargo service representatives and related clerks (except airline), quote fares and rates, make reservations, issue tickets, process cargo shipment, check baggage and perform other related customer service duties to assist travellers. They are employed by bus and railway companies, freight forwarding and shipping companies, boat cruise operators and other public transit establishments and by travel wholesalers."},{"level":4,"heirachical_structure":"Unit group","code":"6525","title":"Hotel front desk clerks","description":"Hotel front desk clerks make room reservations, provide information and services to guests and receive payment for services. They are employed by hotels, motels and resorts."},{"level":3,"heirachical_structure":"Minor group","code":"653","title":"Tourism and amusement services occupations"},{"level":4,"heirachical_structure":"Unit group","code":"6531","title":"Tour and travel guides","description":"Tour and travel guides escort individuals and groups on trips, on sightseeing tours of cities and on tours of historical sites and establishments such as famous buildings, manufacturing plants, cathedrals and theme parks. They also provide descriptions and background information on interesting features. Tour and travel guides are employed by tour operators, resorts and other establishments or may be self-employed."},{"level":4,"heirachical_structure":"Unit group","code":"6532","title":"Outdoor sport and recreational guides","description":"Outdoor sport and recreational guides organize and conduct trips or expeditions for sports enthusiasts, adventurers, tourists and resort guests. They are employed by private companies and resorts or may be self-employed."},{"level":4,"heirachical_structure":"Unit group","code":"6533","title":"Casino occupations","description":"Casino workers operate gaming tables, maintain slot machines, accept keno wagers, pay out winning bets and jackpots and collect losing bets. They are employed by casinos."},{"level":3,"heirachical_structure":"Minor group","code":"654","title":"Security guards and related security service occupations"},{"level":4,"heirachical_structure":"Unit group","code":"6541","title":"Security guards and related security service occupations","description":"This unit group includes workers who guard and implement security measures to protect property against theft, vandalism and fire, control access to establishments, maintain order and enforce regulations at public events and within establishments, conduct private investigations for clients or employers and provide other protective services not elsewhere classified. They are employed by public or private security agencies, residential complexes, educational, cultural, financial and health institutions, retail establishments, businesses and industry, investigation service companies, transportation facilities, and organizations throughout the private and public sectors, or they may be self-employed."},{"level":3,"heirachical_structure":"Minor group","code":"655","title":"Customer and information services representatives"},{"level":4,"heirachical_structure":"Unit group","code":"6551","title":"Customer services representatives - financial institutions","description":"Customer service representatives in this unit group process customers' financial transactions and provide information on related banking products and services. They are employed by banks, trust companies, credit unions and similar financial institutions."},{"level":4,"heirachical_structure":"Unit group","code":"6552","title":"Other customer and information services representatives","description":"This unit group includes customer and information services representatives who answer enquiries and provide information regarding an establishment's goods, services and policies and who provide customer services such as receiving payments and processing requests for services. They are employed by retail establishments, contact centres, insurance, telephone and utility companies and other establishments throughout the private and public sectors."},{"level":3,"heirachical_structure":"Minor group","code":"656","title":"Other occupations in personal service"},{"level":4,"heirachical_structure":"Unit group","code":"6561","title":"Image, social and other personal consultants","description":"Image, social and other personal consultants advise clients on their personal appearance, speaking style, manners or other behaviours in order to improve personal or business images. They are employed by beauty salons, fashion boutiques, modelling schools, image consulting companies, weight loss centres or they may be self-employed."},{"level":4,"heirachical_structure":"Unit group","code":"6562","title":"Estheticians, electrologists and related occupations","description":"Workers in this unit group provide facial and body treatments designed to enhance an individual's physical appearance. They are employed in beauty salons, electrolysis studios, scalp treatment and hair replacement clinics and other similar establishments and in cosmetic departments of retail establishments such as pharmacies and department stores, or they may be self-employed."},{"level":4,"heirachical_structure":"Unit group","code":"6563","title":"Pet groomers and animal care workers","description":"Animal care workers feed, handle, train and groom animals and assist veterinarians, animal health technologists and technicians and animal breeders. Pet groomers clip coats, bathe and otherwise groom pets. Workers in this group are employed by animal hospitals and clinics, animal shelters, breeding and boarding kennels, zoos, laboratories, retail pet shops, dog training schools, pet grooming establishments, or may be self-employed."},{"level":4,"heirachical_structure":"Unit group","code":"6564","title":"Other personal service occupations","description":"This unit group includes occupations, not elsewhere classified, that provide psychic consulting, fortune telling, astrological services and other personal services. They are employed by call centres and personal service establishments, or are self-employed."},{"level":2,"heirachical_structure":"Major group","code":"66","title":"Sales support occupations"},{"level":3,"heirachical_structure":"Minor group","code":"661","title":"Cashiers"},{"level":4,"heirachical_structure":"Unit group","code":"6611","title":"Cashiers","description":"Cashiers operate cash registers, optical price scanners, computers or other equipment to record and accept payment for the purchase of goods, services and admissions. They are employed in stores, restaurants, theatres, recreational and sports establishments, currency exchange booths, government offices, business offices and other service, retail and wholesale establishments."},{"level":3,"heirachical_structure":"Minor group","code":"662","title":"Other sales support and related occupations"},{"level":4,"heirachical_structure":"Unit group","code":"6621","title":"Service station attendants","description":"Service station attendants employed in automotive service stations sell fuel and other automotive products and perform such services as fuelling, cleaning, lubricating and performing minor repairs to motor vehicles. Those employed in marinas sell fuel, rent boats and related equipment, and maintain marina facilities."},{"level":4,"heirachical_structure":"Unit group","code":"6622","title":"Store shelf stockers, clerks and order fillers","description":"Grocery clerks and store shelf stockers pack customers' purchases, price items, stock shelves with merchandise, and fill mail and telephone orders. They are employed in retail establishments, such as grocery, hardware and department stores, and in warehouses."},{"level":4,"heirachical_structure":"Unit group","code":"6623","title":"Other sales related occupations","description":"This unit group includes workers who sell goods or services during home demonstrations or by telephone soliciting, retail exhibitions or street vending. They are employed by a wide range of retail and wholesale establishments, manufacturers, telemarketing companies and call centres, or they may be self-employed."},{"level":2,"heirachical_structure":"Major group","code":"67","title":"Service support and other service occupations, n.e.c."},{"level":3,"heirachical_structure":"Minor group","code":"671","title":"Food counter attendants, kitchen helpers and related support occupations"},{"level":4,"heirachical_structure":"Unit group","code":"6711","title":"Food counter attendants, kitchen helpers and related support occupations","description":"Workers in this unit group include counter attendants, food preparers, kitchen helpers, food service helpers and dishwashers. Counter attendants and food preparers prepare, heat and finish cooking simple food items and serve customers at food counters. Kitchen helpers, food service helpers and dishwashers clear tables, clean kitchen areas, wash dishes, and perform various other activities to assist workers who prepare or serve food and beverages. They are employed by restaurants, cafes, hotels, fast food outlets, cafeterias, hospitals and other establishments."},{"level":3,"heirachical_structure":"Minor group","code":"672","title":"Support occupations in accommodation, travel and amusement services"},{"level":4,"heirachical_structure":"Unit group","code":"6721","title":"Support occupations in accommodation, travel and facilities set-up services","description":"This unit group includes workers who carry hotel guests' luggage and escort guests to their rooms, carry travellers' luggage at airports, in railway stations and aboard ships, clean and maintain public areas and passengers' rooms aboard ships and trains, and set up rooms and associated furnishings, commercial displays, exhibits, equipment and booths in facilities and establishments. They are employed by hotels, conference centres, retail establishments, passenger transport companies and throughout the private and public sectors."},{"level":4,"heirachical_structure":"Unit group","code":"6722","title":"Operators and attendants in amusement, recreation and sport","description":"This unit group includes amusement occupations such as operators of amusement rides, games and other attractions, and attendants in amusement, recreation and sports facilities who assist patrons, collect tickets and fees and supervise the use of recreational and sports equipment. They are employed by amusement parks, fairs, exhibitions, carnivals, arenas, billiard parlours, bowling alleys, golf courses, ski centres, tennis clubs, campgrounds and other recreational and sports facilities."},{"level":3,"heirachical_structure":"Minor group","code":"673","title":"Cleaners"},{"level":4,"heirachical_structure":"Unit group","code":"6731","title":"Light duty cleaners","description":"Light duty cleaners clean the lobbies, hallways, offices and rooms of hotels, motels, resorts, hospitals, schools, office and other buildings, and private residences. They are employed by hotels, motels, resorts, recreational facilities, hospitals and other institutions, building management companies, cleaning service companies and private individuals."},{"level":4,"heirachical_structure":"Unit group","code":"6732","title":"Specialized cleaners","description":"Specialized cleaners clean and refurbish building exteriors, carpets, chimneys, industrial equipment, ventilation systems, windows and other surfaces, using specialized equipment and techniques. They are employed by specialized cleaning service companies or they may be self-employed."},{"level":4,"heirachical_structure":"Unit group","code":"6733","title":"Janitors, caretakers and building superintendents","description":"Janitors, caretakers and building superintendents clean and maintain the interior and exterior of commercial, institutional and residential buildings and their surrounding grounds. Building superintendents employed in large establishments are responsible for the operation of the establishment and may also supervise other workers. They are employed by office and apartment building management companies, condominium corporations, educational institutions, health care facilities, recreational and shopping facilities, religious establishments, and industrial and other establishments."},{"level":3,"heirachical_structure":"Minor group","code":"674","title":"Other service support and related occupations, n.e.c."},{"level":4,"heirachical_structure":"Unit group","code":"6741","title":"Dry cleaning, laundry and related occupations","description":"Dry cleaning and laundry machine operators operate machines to dry-clean or launder garments and other articles. Dry cleaning and laundry inspectors and assemblers check finished garments and other articles to ensure that they meet required standards for dry-cleaning, laundering and pressing, and assemble and bag finished garments and other articles. This unit group also includes workers who iron, press or otherwise finish garments and household articles. Workers in this unit group are employed in dry cleaning, laundry and fur cleaning establishments, and in the laundries of hotels, hospitals and other institutions."},{"level":4,"heirachical_structure":"Unit group","code":"6742","title":"Other service support occupations, n.e.c.","description":"This unit group includes other support occupations, not elsewhere classified, primarily concerned with the provision of services. Those in occupations in this unit group are employed by a wide range of establishments, and may be self-employed."},{"level":1,"heirachical_structure":"Broad occupational category","code":"7","title":"Trades, transport and equipment operators and related occupations"},{"level":2,"heirachical_structure":"Major group","code":"72","title":"Industrial, electrical and construction trades"},{"level":3,"heirachical_structure":"Minor group","code":"720","title":"Contractors and supervisors, industrial, electrical and construction trades and related workers"},{"level":4,"heirachical_structure":"Unit group","code":"7201","title":"Contractors and supervisors, machining, metal forming, shaping and erecting trades and related occupations","description":"This unit group includes sheet metal, ironwork, welding and boilermaking trade contractors who own and operate their own businesses. This group also includes supervisors who supervise and co-ordinate the activities of workers classified in the following unit groups: Machinists and Machining and Tooling Inspectors (7231), Tool and Die Makers (7232), Sheet Metal Workers (7233), Boilermakers (7234), Structural Metal and Platework Fabricators and Fitters (7235), Ironworkers (7236), Welders and Related Machine Operators (7237) and Machining Tool Operators (9417). They are employed by structural, platework and related metal products fabrication, manufacturing and erecting companies and machine shops."},{"level":4,"heirachical_structure":"Unit group","code":"7202","title":"Contractors and supervisors, electrical trades and telecommunications occupations","description":"This unit group includes telecommunications and electrical trade contractors who own and operate their own businesses. This group also includes supervisors who supervise and co-ordinate the activities of workers classified in the following unit groups: Electricians (7241), Industrial Electricians (7242), Power System Electricians (7243), Electrical Power Line and Cable Workers (7244), Telecommunications Line and Cable Workers (7245), Telecommunications Installation and Repair Workers (7246) and Cable Television Service and Maintenance Technicians (7247). They are employed in a wide range of establishments; places of employment are indicated in the above unit group descriptions."},{"level":4,"heirachical_structure":"Unit group","code":"7203","title":"Contractors and supervisors, pipefitting trades","description":"This unit group includes plumbing and other pipefitting trade contractors who own and operate their own businesses. This group also includes supervisors who supervise and co-ordinate the activities of workers classified in the following unit groups: Plumbers (7251), Steamfitters, Pipefitters and Sprinkler System Installers (7252) and Gas Fitters (7253). They are employed by construction companies, mechanical, plumbing and pipefitting trade contractors and maintenance departments of industrial, commercial and manufacturing establishments."},{"level":4,"heirachical_structure":"Unit group","code":"7204","title":"Contractors and supervisors, carpentry trades","description":"This unit group includes carpentry and cabinetmaking trade contractors who own and operate their own businesses. This group also includes supervisors who supervise and co-ordinate the activities of workers classified in the following unit groups: Carpenters (7271) and Cabinetmakers (7272). They are employed by construction companies, carpentry contractors, maintenance departments of industrial establishments, and custom furniture and fixture manufacturing or repair companies."},{"level":4,"heirachical_structure":"Unit group","code":"7205","title":"Contractors and supervisors, other construction trades, installers, repairers and servicers","description":"This unit group includes roofing, masonry, painting and other construction trade contractors, not elsewhere classified, who own and operate their own business. Supervisors in this unit group supervise and co-ordinate the activities of various tradespersons, installers, repairers and servicers classified in the following minor groups: Masonry and Plastering Trades (728), Other Construction Trades (729) and Other Installers, Repairers and Servicers (744). They are employed by a wide range of establishments; places of employment are indicated in the unit group descriptions. This unit group also includes prefabricated product installation and service contractors and proprietors of some repair and service establishments."},{"level":3,"heirachical_structure":"Minor group","code":"723","title":"Machining, metal forming, shaping and erecting trades"},{"level":4,"heirachical_structure":"Unit group","code":"7231","title":"Machinists and machining and tooling inspectors","description":"Machinists set up and operate a variety of machine tools to cut or grind metal, plastic or other materials to make or modify parts or products with precise dimensions. Machining and tooling inspectors inspect machined parts and tooling in order to maintain quality control standards. They are employed by machinery, equipment, motor vehicle, automotive parts, aircraft and other metal products manufacturing companies and by machine shops."},{"level":4,"heirachical_structure":"Unit group","code":"7232","title":"Tool and die makers","description":"Tool and die makers make, repair and modify custom-made, prototype or special tools, dies, jigs, fixtures and gauges using various metals, alloys and plastics which require precise dimensions. They are employed primarily in manufacturing industries such as automobile, aircraft, metal fabrication, electrical machinery and plastics, and in tool and die, mould making and machine shops. This unit group also includes metal patternmakers and metal mould makers."},{"level":4,"heirachical_structure":"Unit group","code":"7233","title":"Sheet metal workers","description":"Sheet metal workers fabricate, assemble, install and repair sheet metal products. They are employed by sheet metal fabrication shops, sheet metal products manufacturing companies, sheet metal work contractors and various industrial sectors."},{"level":4,"heirachical_structure":"Unit group","code":"7234","title":"Boilermakers","description":"Boilermakers fabricate, assemble, erect, test, maintain and repair boilers, vessels, tanks, towers, heat exchangers and other heavy-metal structures. They are employed in boiler fabrication, manufacturing, shipbuilding, construction, electric power generation and similar industrial establishments."},{"level":4,"heirachical_structure":"Unit group","code":"7235","title":"Structural metal and platework fabricators and fitters","description":"Structural metal and platework fabricators and fitters fabricate, assemble, fit and install steel or other metal components for buildings, bridges, tanks, towers, boilers, pressure vessels and other similar structures and products. They are employed in structural steel, boiler and platework fabrication plants and by heavy machinery manufacturing and shipbuilding companies."},{"level":4,"heirachical_structure":"Unit group","code":"7236","title":"Ironworkers","description":"Ironworkers fabricate, erect, hoist, install, repair and service structural ironwork, precast concrete, concrete reinforcing materials, curtain walls, ornamental iron and other metals used in the construction of buildings, bridges, highways, dams and other structures and equipment. They are employed by construction ironwork contractors."},{"level":4,"heirachical_structure":"Unit group","code":"7237","title":"Welders and related machine operators","description":"Welders operate welding equipment to weld ferrous and non-ferrous metals. This unit group also includes machine operators who operate previously set up production welding, brazing and soldering equipment. They are employed by companies that manufacture structural steel and platework, boilers, heavy machinery, aircraft and ships and other metal products, and by welding contractors and welding shops, or they may be self-employed."},{"level":3,"heirachical_structure":"Minor group","code":"724","title":"Electrical trades and electrical power line and telecommunications workers"},{"level":4,"heirachical_structure":"Unit group","code":"7241","title":"Electricians (except industrial and power system)","description":"Electricians in this unit group lay out, assemble, install, test, troubleshoot and repair electrical wiring, fixtures, control devices and related equipment in buildings and other structures. They are employed by electrical contractors and maintenance departments of buildings and other establishments, or they may be self-employed."},{"level":4,"heirachical_structure":"Unit group","code":"7242","title":"Industrial electricians","description":"Industrial electricians install, maintain, test, troubleshoot and repair industrial electrical equipment and associated electrical and electronic controls. They are employed by electrical contractors and maintenance departments of factories, plants, mines, shipyards and other industrial establishments."},{"level":4,"heirachical_structure":"Unit group","code":"7243","title":"Power system electricians","description":"Power system electricians install, maintain, test and repair electrical power generation, transmission and distribution system equipment and apparatus. They are employed by electric power generation, transmission and distribution companies."},{"level":4,"heirachical_structure":"Unit group","code":"7244","title":"Electrical power line and cable workers","description":"Electrical power line and cable workers construct, maintain and repair overhead and underground electrical power transmission and distribution systems. They are employed by electric power generation, transmission and distribution companies, electrical contractors and public utility commissions."},{"level":4,"heirachical_structure":"Unit group","code":"7245","title":"Telecommunications line and cable workers","description":"Telecommunications line and cable workers install, repair and maintain telecommunication lines and cables. They are employed by cable television companies and by telephone and other telecommunications services."},{"level":4,"heirachical_structure":"Unit group","code":"7246","title":"Telecommunications installation and repair workers","description":"Telecommunications installation and repair workers install, test, maintain and repair telephones, telephone switching equipment and telecommunications equipment related to transmission and processing of voice, video signals and other data over a variety of media including fibre optics, microwave, radio and satellite. They are employed by telephone and other telecommunications transmission services establishments."},{"level":4,"heirachical_structure":"Unit group","code":"7247","title":"Cable television service and maintenance technicians","description":"Cable television service technicians install, maintain and repair cable and satellite television and Internet signal and associated equipment in homes and commercial buildings. Cable television maintenance technicians maintain and repair cable television transmission and distribution systems and associated hardware. They are employed by cable and satellite television companies."},{"level":3,"heirachical_structure":"Minor group","code":"725","title":"Plumbers, pipefitters and gas fitters"},{"level":4,"heirachical_structure":"Unit group","code":"7251","title":"Plumbers","description":"Plumbers install, repair and maintain pipes, fixtures and other plumbing equipment used for water distribution and waste water disposal in residential, commercial and industrial buildings. They are employed in maintenance departments of factories, plants and similar establishments, by plumbing contractors, or they may be self-employed."},{"level":4,"heirachical_structure":"Unit group","code":"7252","title":"Steamfitters, pipefitters and sprinkler system installers","description":"Steamfitters and pipefitters lay out, assemble, fabricate, maintain, troubleshoot and repair piping systems carrying water, steam, chemicals and fuel in heating, cooling, lubricating and other process piping systems. Sprinkler system installers fabricate, install, test, maintain and repair water, foam, carbon dioxide and dry chemical sprinkler systems in buildings for fire protection purposes. Steamfitters, pipefitters and sprinkler system installers are employed in maintenance departments of factories, plants and similar establishments, and by pipefitting and sprinkler system contractors, or they may be self-employed."},{"level":4,"heirachical_structure":"Unit group","code":"7253","title":"Gas fitters","description":"Gas fitters install, inspect, repair and maintain gas lines and gas equipment such as meters, regulators and heating units in residential, commercial and industrial establishments. They are employed by gas utility companies and gas servicing companies."},{"level":3,"heirachical_structure":"Minor group","code":"727","title":"Carpenters and cabinetmakers"},{"level":4,"heirachical_structure":"Unit group","code":"7271","title":"Carpenters","description":"Carpenters construct, erect, install, maintain and repair structures and components of structures made of wood, wood substitutes, lightweight steel and other materials. They are employed by construction companies, carpentry contractors, and maintenance departments of factories, plants and other establishments, or they may be self-employed."},{"level":4,"heirachical_structure":"Unit group","code":"7272","title":"Cabinetmakers","description":"Cabinetmakers use a variety of woods and laminates to construct and repair wooden cabinets, furniture, fixtures and related products. They are employed by furniture manufacturing or repair companies, construction companies and cabinetmaking contractors, or they may be self-employed."},{"level":3,"heirachical_structure":"Minor group","code":"728","title":"Masonry and plastering trades"},{"level":4,"heirachical_structure":"Unit group","code":"7281","title":"Bricklayers","description":"Bricklayers lay bricks, concrete blocks, stone and other similar materials to construct or repair walls, arches, chimneys, fireplaces and other structures in accordance with blueprints and specifications. They are employed by construction companies and bricklaying contractors or they may be self-employed."},{"level":4,"heirachical_structure":"Unit group","code":"7282","title":"Concrete finishers","description":"Concrete finishers smooth and finish freshly poured concrete, apply curing or surface treatments and install, maintain and restore various masonry structures such as foundations, floors, ceilings, sidewalks, roads, patios and highrise buildings. They are employed by construction companies, cement and concrete contractors and manufacturers of precast concrete products, or they may be self-employed."},{"level":4,"heirachical_structure":"Unit group","code":"7283","title":"Tilesetters","description":"Tilesetters cover interior and exterior walls, floors and ceilings with ceramic, marble and quarry tile, mosaics or terrazzo. They are employed by construction companies and masonry contractors, or they may be self-employed."},{"level":4,"heirachical_structure":"Unit group","code":"7284","title":"Plasterers, drywall installers and finishers and lathers","description":"Plasterers apply finish, and maintain and restore plaster or similar materials, on interior and exterior walls, ceilings and building partitions to produce plain or decorative surfaces. Drywall installers and finishers install and finish drywall sheets and various types of ceiling systems. Lathers install support framework for ceiling systems, interior and exterior walls and building partitions. They are employed by construction companies and by plastering, drywalling and lathing contractors, or they may be self-employed."},{"level":3,"heirachical_structure":"Minor group","code":"729","title":"Other construction trades"},{"level":4,"heirachical_structure":"Unit group","code":"7291","title":"Roofers and shinglers","description":"Roofers install, repair or replace flat roofs and shingles, shakes or other roofing tiles on sloped roofs. Shinglers install and replace shingles, tiles and similar coverings on sloped roofs. They are employed by roofing and general contractors, or they may be self-employed."},{"level":4,"heirachical_structure":"Unit group","code":"7292","title":"Glaziers","description":"Glaziers cut, fit, install and replace glass in residential, commercial and industrial buildings, on exterior walls of buildings and other structures and in furniture and other products. They are employed by construction glass installation contractors, retail service and repair shops and glass fabrication shops, or they may be self-employed."},{"level":4,"heirachical_structure":"Unit group","code":"7293","title":"Insulators","description":"Insulators apply insulation materials to plumbing, air-handling, heating, cooling and refrigeration systems, piping equipment and pressure vessels, and walls, floors and ceilings of buildings and other structures, to prevent or reduce the passage of heat, cold, sound or fire. They are employed by construction companies and insulation contractors, or they may be self-employed."},{"level":4,"heirachical_structure":"Unit group","code":"7294","title":"Painters and decorators (except interior decorators)","description":"Painters and decorators apply paint, wallpaper and other finishes to interior and exterior surfaces of buildings and other structures. They are employed by construction companies, painting contractors and building maintenance contractors, or they may be self-employed."},{"level":4,"heirachical_structure":"Unit group","code":"7295","title":"Floor covering installers","description":"Floor covering installers install carpet, wood, linoleum, vinyl and other resilient floor coverings in residential, commercial, industrial and institutional buildings. They are employed by construction companies, floor-covering contractors and carpet outlets, or they may be self-employed."},{"level":2,"heirachical_structure":"Major group","code":"73","title":"Maintenance and equipment operation trades"},{"level":3,"heirachical_structure":"Minor group","code":"730","title":"Contractors and supervisors, maintenance trades and heavy equipment and transport operators"},{"level":4,"heirachical_structure":"Unit group","code":"7301","title":"Contractors and supervisors, mechanic trades","description":"This unit group includes heating, refrigeration, air conditioning, millwrighting and elevator and other equipment installation and mechanic trades contractors who own and operate their own businesses. This group also includes supervisors who supervise and co-ordinate the activities of workers classified in unit groups within the following minor groups: Machinery and Transportation Equipment Mechanics (Except Motor Vehicle) (731), Automotive Service Technicians (732) and Other Mechanics (733). They are employed in a wide range of establishments; places of employment are indicated in the unit group descriptions of the above minor groups."},{"level":4,"heirachical_structure":"Unit group","code":"7302","title":"Contractors and supervisors, heavy equipment operator crews","description":"This unit group includes excavating, grading, paving, drilling and blasting contractors who own and operate their own business. This unit group also includes supervisors who supervise and co-ordinate the activities of workers classified in the following unit groups: Crane Operators (7371), Drillers and Blasters - Surface Mining, Quarrying and Construction (7372), Water Well Drillers (7373), Longshore Workers (7451), Material Handlers (7452), Heavy Equipment Operators (Except Crane) (7521), Public Works Maintenance Equipment Operators and Related Workers (7522), Railway Yard and Track Maintenance Workers (7531), and Public Works and Maintenance Labourers (7621). They are employed in a wide range of establishments; places of employment are indicated in the above unit group descriptions."},{"level":4,"heirachical_structure":"Unit group","code":"7303","title":"Supervisors, printing and related occupations","description":"Supervisors in this unit group supervise and co-ordinate the activities of workers who produce camera work and printing plates and cylinders, process film, print text and illustrations on paper, metal and other material, and bind and finish printed products. They are employed by companies that specialize in commercial printing or one of its components, such as binding or colour reproduction, in combined printing and publishing companies, such as newspapers and magazines, and in various establishments in both the public and private sectors that have in-house printing departments."},{"level":4,"heirachical_structure":"Unit group","code":"7304","title":"Supervisors, railway transport operations","description":"Supervisors in this unit group supervise and co-ordinate the activities of railway and yard locomotive engineers, railway yard workers and railway labourers. They are employed by railway transport companies."},{"level":4,"heirachical_structure":"Unit group","code":"7305","title":"Supervisors, motor transport and other ground transit operators","description":"Supervisors in this unit group supervise and co-ordinate activities of truck drivers, bus drivers, delivery drivers, subway and other transit operators, chauffeurs and taxi and limousine drivers. This unit group also includes bus dispatchers who co-ordinate the activities of transit system bus drivers and subway traffic controllers who operate and monitor signal and track switch control panels. They are employed by motor transportation and ground transit companies and by urban transit systems."},{"level":3,"heirachical_structure":"Minor group","code":"731","title":"Machinery and transportation equipment mechanics (except motor vehicle)"},{"level":4,"heirachical_structure":"Unit group","code":"7311","title":"Construction millwrights and industrial mechanics","description":"Construction millwrights and industrial mechanics install, maintain, troubleshoot, overhaul and repair stationary industrial machinery and mechanical equipment. This unit group includes industrial textile machinery mechanics and repairers. Construction millwrights are employed by millwrighting contractors. Industrial mechanics are employed in manufacturing plants, utilities and other industrial establishments."},{"level":4,"heirachical_structure":"Unit group","code":"7312","title":"Heavy-duty equipment mechanics","description":"Heavy-duty equipment mechanics repair, troubleshoot, adjust, overhaul and maintain mobile heavy-duty equipment used in construction, transportation, forestry, mining, oil and gas, material handling, landscaping, land clearing, farming and similar activities. They are employed by companies which own and operate heavy equipment, and by heavy equipment dealers, rental and service establishments, and railway transport companies and urban transit systems."},{"level":4,"heirachical_structure":"Unit group","code":"7313","title":"Refrigeration and air conditioning mechanics","description":"Refrigeration and air conditioning mechanics install, maintain, repair and overhaul residential central air conditioning systems, commercial and industrial refrigeration and air conditioning systems and combined heating, ventilation and cooling systems. They are employed by refrigeration and air conditioning installation contractors, various industrial settings, food wholesalers, engineering firms and retail and servicing establishments. Transport refrigeration mechanics are included in this unit group."},{"level":4,"heirachical_structure":"Unit group","code":"7314","title":"Railway carmen/women","description":"Railway carmen/women inspect, troubleshoot, maintain and repair structural and mechanical components of railway freight, passenger and urban transit rail cars. They are employed by railway transport companies and urban transit systems."},{"level":4,"heirachical_structure":"Unit group","code":"7315","title":"Aircraft mechanics and aircraft inspectors","description":"Aircraft mechanics maintain, repair, overhaul, modify and test aircraft structural, mechanical and hydraulic systems. Aircraft inspectors inspect aircraft and aircraft systems following manufacture, modification, maintenance, repair or overhaul. Aircraft mechanics and aircraft inspectors are employed by aircraft manufacturing, maintenance, repair and overhaul establishments, and by airlines and other aircraft operators."},{"level":4,"heirachical_structure":"Unit group","code":"7316","title":"Machine fitters","description":"Machine fitters fit, assemble and otherwise build heavy industrial machinery and transportation equipment, including aircraft engines. They are employed in industrial machinery and transportation equipment manufacturing industries."},{"level":4,"heirachical_structure":"Unit group","code":"7318","title":"Elevator constructors and mechanics","description":"Elevator constructors and mechanics assemble, install, maintain and repair freight and passenger elevators, escalators, moving walkways and other related equipment. They are employed by elevator construction and maintenance companies."},{"level":3,"heirachical_structure":"Minor group","code":"732","title":"Automotive service technicians"},{"level":4,"heirachical_structure":"Unit group","code":"7321","title":"Automotive service technicians, truck and bus mechanics and mechanical repairers","description":"Automotive service technicians, truck and bus mechanics and mechanical repairers inspect, diagnose, repair and service mechanical, electrical and electronic systems and components of cars, buses, and light and commercial transport trucks. They are employed by motor vehicle dealers, garages, truck and trailer dealerships, fleet maintenance companies, and service stations, automotive specialty shops, transportation companies and retail establishments which have automotive service shops. This unit group also includes mechanical repairers who perform major repairs and replacement of mechanical units on newly assembled motor vehicles. They are employed by motor vehicle manufacturing companies."},{"level":4,"heirachical_structure":"Unit group","code":"7322","title":"Motor vehicle body repairers","description":"Motor vehicle body repairers repair and restore damaged motor vehicle body parts and interior finishing; repaint body surfaces; and repair and/or replace automotive glass. They are employed by automobile dealerships, automobile body repair shops and automobile appraisal centres. This unit group also includes metal repairers who repair defective automobile body parts and damage to the bodies of newly assembled cars. They are employed by motor vehicle manufacturers."},{"level":3,"heirachical_structure":"Minor group","code":"733","title":"Other mechanics and related repairers"},{"level":4,"heirachical_structure":"Unit group","code":"7331","title":"Oil and solid fuel heating mechanics","description":"Oil and solid fuel heating mechanics install and maintain oil, coal and wood heating systems in residential and commercial buildings. They are employed by heating systems installation and service companies."},{"level":4,"heirachical_structure":"Unit group","code":"7332","title":"Appliance servicers and repairers","description":"Appliance servicers and repairers service and repair domestic and commercial appliances. They are employed by repair shops, appliance service companies and repair departments of retail and wholesale establishments, or they may be self-employed."},{"level":4,"heirachical_structure":"Unit group","code":"7333","title":"Electrical mechanics","description":"Electrical mechanics maintain, test, rebuild and repair electric motors, transformers, switchgear and other electrical apparatus. They are employed by independent electrical repair shops, service shops of electrical equipment manufacturers and maintenance departments of manufacturing companies."},{"level":4,"heirachical_structure":"Unit group","code":"7334","title":"Motorcycle, all-terrain vehicle and other related mechanics","description":"Mechanics in this unit group test, repair and service motorcycles, motor scooters, snowmobiles, forklifts and all-terrain vehicles. They are employed by service shops of motorcycle dealers and retailers and by independent service establishments."},{"level":4,"heirachical_structure":"Unit group","code":"7335","title":"Other small engine and small equipment repairers","description":"Workers in this unit group test, repair and service small gasoline and diesel-powered engines and equipment, such as garden tractors, outboard motors, lawn mowers and other related equipment. They are employed by dealer service shops and by independent service establishments."},{"level":3,"heirachical_structure":"Minor group","code":"736","title":"Train crew operating occupations"},{"level":4,"heirachical_structure":"Unit group","code":"7361","title":"Railway and yard locomotive engineers","description":"Railway locomotive engineers operate railway locomotives to transport passengers and freight. They are employed by railway transport companies. Yard locomotive engineers operate locomotives within yards of railway, industrial or other establishments. They are employed by railway transport companies and industrial or commercial users of rail transport."},{"level":4,"heirachical_structure":"Unit group","code":"7362","title":"Railway conductors and brakemen/women","description":"Railway conductors co-ordinate and supervise the activities of passenger and freight train crew members. Brakemen check train brakes and other systems and equipment prior to train run, and assist railway conductors in activities en route. They are employed by railway transport companies."},{"level":3,"heirachical_structure":"Minor group","code":"737","title":"Crane operators, drillers and blasters"},{"level":4,"heirachical_structure":"Unit group","code":"7371","title":"Crane operators","description":"Crane operators operate cranes or draglines to lift, move, position or place machinery, equipment and other large objects at construction or industrial sites, ports, railway yards, surface mines and other similar locations. They are employed by construction, industrial, mining, cargo handling and railway companies."},{"level":4,"heirachical_structure":"Unit group","code":"7372","title":"Drillers and blasters - surface mining, quarrying and construction","description":"Drillers in this unit group operate mobile drilling machines to bore blast holes in open-pit mines and quarries and to bore holes for blasting and for building foundations at construction sites. Blasters in this unit group fill blast holes with explosives and detonate explosives to dislodge coal, ore and rock or to demolish structures. They are employed by mining, quarrying and construction companies and by drilling and blasting contractors."},{"level":4,"heirachical_structure":"Unit group","code":"7373","title":"Water well drillers","description":"Water well drillers operate a variety of mobile water well drilling rigs and equipment to drill and monitor residential, commercial and industrial water wells. They are employed by water well drilling contractors and governments, or they may be self-employed."},{"level":3,"heirachical_structure":"Minor group","code":"738","title":"Printing press operators and other trades and related occupations, n.e.c."},{"level":4,"heirachical_structure":"Unit group","code":"7381","title":"Printing press operators","description":"Printing press operators set up and operate sheet and web-fed presses to print text, illustrations and designs on a wide variety of materials such as paper, plastic, glass, leather and metal. They are employed by commercial printing companies; newspapers, magazines, and other publishing companies; and establishments in the public and private sectors that have in-house printing departments."},{"level":4,"heirachical_structure":"Unit group","code":"7384","title":"Other trades and related occupations, n.e.c.","description":"This unit group includes tradespersons and related skilled workers, not elsewhere classified, who repair, service, install, calibrate or fabricate a variety of products. This unit group includes commercial divers. They are employed by a wide range of establishments, or they may be self-employed."},{"level":2,"heirachical_structure":"Major group","code":"74","title":"Other installers, repairers and servicers and material handlers"},{"level":3,"heirachical_structure":"Minor group","code":"744","title":"Other installers, repairers and servicers"},{"level":4,"heirachical_structure":"Unit group","code":"7441","title":"Residential and commercial installers and servicers","description":"Workers in this unit group install and service a wide variety of interior and exterior prefabricated products such as windows, doors, electrical appliances, water heaters, fences, play structures and septic and irrigation systems at residential, commercial or institutional properties. They are employed by companies specializing in specific product installation and service."},{"level":4,"heirachical_structure":"Unit group","code":"7442","title":"Waterworks and gas maintenance workers","description":"Waterworks maintenance workers maintain and repair waterworks equipment and facilities. They are employed in water filtration and distribution plants and waste treatment plants. Gas maintenance workers check and perform routine maintenance and minor repairs to exterior and underground gas mains and distribution lines. They are employed by gas distribution companies."},{"level":4,"heirachical_structure":"Unit group","code":"7444","title":"Pest controllers and fumigators","description":"Pest controllers and fumigators inspect buildings and outside areas for pest infestation and spray chemical treatments to kill noxious and destructive insects, rodents and other pests or set cage traps to capture and remove animals. They are employed by pest control companies, or they may be self-employed."},{"level":4,"heirachical_structure":"Unit group","code":"7445","title":"Other repairers and servicers","description":"This unit group includes workers, not elsewhere classified, who repair and service a wide variety of products, such as cameras, scales, musical instruments, coin machines, vending machines, sporting goods and other miscellaneous products and equipment. They are employed by product specialty repair shops and service establishments."},{"level":3,"heirachical_structure":"Minor group","code":"745","title":"Longshore workers and material handlers"},{"level":4,"heirachical_structure":"Unit group","code":"7451","title":"Longshore workers","description":"Longshore workers transfer cargo throughout dock area and onto and from ships and other vessels. They are employed by marine cargo handling companies, shipping agencies and shipping lines."},{"level":4,"heirachical_structure":"Unit group","code":"7452","title":"Material handlers","description":"This unit group includes workers who handle, move, load and unload materials by hand or using a variety of material handling equipment. They are employed by transportation, storage and moving companies, and by a variety of manufacturing and processing companies and retail and wholesale warehouses."},{"level":2,"heirachical_structure":"Major group","code":"75","title":"Transport and heavy equipment operation and related maintenance occupations"},{"level":3,"heirachical_structure":"Minor group","code":"751","title":"Motor vehicle and transit drivers"},{"level":4,"heirachical_structure":"Unit group","code":"7511","title":"Transport truck drivers","description":"Transport truck drivers operate heavy trucks to transport goods and materials over urban, interurban, provincial and international routes. They are employed by transportation, manufacturing, distribution and moving companies, and trucking employment service agencies, or they may be self-employed. This unit group also includes drivers of special purpose trucks and shunters who move trailers to and from loading docks within trucking yards or lots."},{"level":4,"heirachical_structure":"Unit group","code":"7512","title":"Bus drivers, subway operators and other transit operators","description":"This unit group includes workers who drive buses and operate streetcars, subway trains and light rail transit vehicles to transport passengers on established routes. Bus drivers are employed by urban transit systems, school boards or transportation authorities and private transportation companies. Streetcar, subway and light rail transit operators are employed by urban transit systems."},{"level":4,"heirachical_structure":"Unit group","code":"7513","title":"Taxi and limousine drivers and chauffeurs","description":"Taxi and limousine drivers drive automobiles and limousines to transport passengers. Chauffeurs drive automobiles and limousines to transport personnel and visitors of businesses, government or other organizations or members of private households. Taxi and limousine drivers are employed by taxi and other transportation service companies, or they may be self-employed. Chauffeurs are employed by businesses, government and other organizations, or private individuals or families."},{"level":4,"heirachical_structure":"Unit group","code":"7514","title":"Delivery and courier service drivers","description":"Delivery and courier service drivers drive automobiles, vans and light trucks to pick up and deliver various products. They are employed by dairies, drug stores, newspaper distributors, take-out food establishments, dry cleaners, mobile caterers, courier and messenger service companies and many other establishments, or they may be self-employed."},{"level":3,"heirachical_structure":"Minor group","code":"752","title":"Heavy equipment operators"},{"level":4,"heirachical_structure":"Unit group","code":"7521","title":"Heavy equipment operators (except crane)","description":"Heavy equipment operators operate heavy equipment used in the construction and maintenance of roads, bridges, airports, gas and oil pipelines, tunnels, buildings and other structures; in surface mining and quarrying activities; and in material handling work. They are employed by construction companies, heavy equipment contractors, public works departments and pipeline, logging, cargo-handling and other companies."},{"level":4,"heirachical_structure":"Unit group","code":"7522","title":"Public works maintenance equipment operators and related workers","description":"This unit group includes workers who operate vehicles and equipment to maintain streets, highways and sewer systems and operate trucks to collect garbage and recyclable materials. This group also includes workers who clear vegetation close to power lines, workers who inspect the condition of utility poles and workers who locate underground utility lines and pipes. They are employed by municipal, provincial and federal public works departments, private contractors under contract with government public works departments and private companies involved in the collection of refuse and recyclable materials."},{"level":3,"heirachical_structure":"Minor group","code":"753","title":"Other transport equipment operators and related maintenance workers"},{"level":4,"heirachical_structure":"Unit group","code":"7531","title":"Railway yard and track maintenance workers","description":"Railway yard workers regulate yard traffic, couple and uncouple trains and perform related yard activities. Railway track maintenance workers operate machines and equipment to lay, maintain and repair railway tracks. They are employed by railway transport companies."},{"level":4,"heirachical_structure":"Unit group","code":"7532","title":"Water transport deck and engine room crew","description":"Workers in this unit group stand watch, operate and maintain deck equipment, perform other deck and bridge duties, assist ship engineer officers to operate, maintain and repair engines, machinery and auxiliary equipment aboard ships or self-propelled vessels. They are employed by marine transportation companies and federal government departments."},{"level":4,"heirachical_structure":"Unit group","code":"7533","title":"Boat and cable ferry operators and related occupations","description":"This unit group includes workers who operate lock gates, bridges and similar equipment along canal systems and workers who operate cable ferries and ferry terminals. This group also includes boat operators, and owner-operators, who operate small motorboats or watercraft to transport passengers or freight. Workers in this group are employed by the federal government, cable ferry companies, ferry terminals, marine companies and canal, port or harbour authorities. Owner-operators of small boats are self-employed."},{"level":4,"heirachical_structure":"Unit group","code":"7534","title":"Air transport ramp attendants","description":"Air transport ramp attendants operate ramp-servicing vehicles and equipment, handle cargo and baggage and perform other ground support duties at airports. They are employed by airline and air services companies and the federal government."},{"level":4,"heirachical_structure":"Unit group","code":"7535","title":"Other automotive mechanical installers and servicers","description":"Workers in this group install replacement automotive mechanical parts such as mufflers, exhaust pipes, shock absorbers, springs and radiators and perform routine maintenance service such as oil changes, lubrication and tire repairs on automobiles, trucks and heavy equipment. They are employed by automobile and truck service and repair shops, service departments of industrial establishments and construction, mining and logging companies."},{"level":2,"heirachical_structure":"Major group","code":"76","title":"Trades helpers, construction labourers and related occupations"},{"level":3,"heirachical_structure":"Minor group","code":"761","title":"Trades helpers and labourers"},{"level":4,"heirachical_structure":"Unit group","code":"7611","title":"Construction trades helpers and labourers","description":"Construction trades helpers and labourers assist skilled tradespersons and perform labouring activities at construction sites, in quarries and in surface mines. They are employed by construction companies, trade and labour contractors, and surface mine and quarry operators."},{"level":4,"heirachical_structure":"Unit group","code":"7612","title":"Other trades helpers and labourers","description":"This unit group includes trade helpers and labourers, not elsewhere classified, who assist skilled tradespersons and perform labouring activities in the installation, maintenance and repair of industrial machinery, refrigeration, heating and air conditioning equipment, in the maintenance and repair of transportation and heavy equipment, in the installation and repair of telecommunication and power cables and in other repair and service work settings. They are employed by a wide variety of manufacturing, utility and service companies."},{"level":3,"heirachical_structure":"Minor group","code":"762","title":"Public works and other labourers, n.e.c."},{"level":4,"heirachical_structure":"Unit group","code":"7621","title":"Public works and maintenance labourers","description":"Public works and maintenance labourers perform a variety of labouring activities to maintain sidewalks, streets, roads and similar areas. They are employed by public works departments in all levels of government or by private contractors under contract to governments."},{"level":4,"heirachical_structure":"Unit group","code":"7622","title":"Railway and motor transport labourers","description":"Railway and motor transport labourers perform a variety of tasks to assist track maintenance workers and railway yard workers, or motor transport operators. They are employed by railway transport companies and motor transport companies."},{"level":1,"heirachical_structure":"Broad occupational category","code":"8","title":"Natural resources, agriculture and related production occupations"},{"level":2,"heirachical_structure":"Major group","code":"82","title":"Supervisors and technical occupations in natural resources, agriculture and related production"},{"level":3,"heirachical_structure":"Minor group","code":"821","title":"Supervisors, logging and forestry"},{"level":4,"heirachical_structure":"Unit group","code":"8211","title":"Supervisors, logging and forestry","description":"Supervisors in this unit group supervise and co-ordinate the activities of workers engaged in logging operations and silvicultural operations. They are employed by logging companies, contractors and government agencies."},{"level":3,"heirachical_structure":"Minor group","code":"822","title":"Contractors and supervisors, mining, oil and gas"},{"level":4,"heirachical_structure":"Unit group","code":"8221","title":"Supervisors, mining and quarrying","description":"Supervisors in this unit group supervise and co-ordinate activities of workers engaged in underground and surface mining operations and quarries. They are employed by coal, metal and non-metallic mineral mines and quarries."},{"level":4,"heirachical_structure":"Unit group","code":"8222","title":"Contractors and supervisors, oil and gas drilling and services","description":"Supervisors in this unit group supervise and co-ordinate the activities of workers engaged in drilling for oil or gas, operating service rigs, or providing oil and gas well services. They are employed by drilling and well service contracting companies and by petroleum producing companies. This unit group includes oilfield consultants who may be self-employed."},{"level":3,"heirachical_structure":"Minor group","code":"823","title":"Underground miners, oil and gas drillers and related occupations"},{"level":4,"heirachical_structure":"Unit group","code":"8231","title":"Underground production and development miners","description":"Underground production and development miners drill, blast, operate mining machinery, and perform related duties to extract coal and ore in underground mines and to construct tunnels, passageways and shafts to facilitate mining operations. They are employed by coal, metal and non-metallic mineral underground mines and by specialized contractors in mine construction, shaft sinking and tunnelling."},{"level":4,"heirachical_structure":"Unit group","code":"8232","title":"Oil and gas well drillers, servicers, testers and related workers","description":"Oil and gas well drillers and well servicers control the operation of drilling and hoisting equipment on drilling and service rigs, and direct the activities of the rig crew under supervision of the rig manager. Oil and gas well loggers, testers and related workers operate specialized mechanical or electronic equipment, tools or instruments to provide services in conjunction with well drilling, completion or servicing. Workers in this unit group are employed by drilling and well service contractors, petroleum producing companies and well logging or testing companies."},{"level":3,"heirachical_structure":"Minor group","code":"824","title":"Logging machinery operators"},{"level":4,"heirachical_structure":"Unit group","code":"8241","title":"Logging machinery operators","description":"Logging machinery operators operate cable yarding systems, mechanical harvesters and forwarders and mechanical tree processors and loaders to fell, yard and process trees at logging sites. They are employed by logging companies and contractors."},{"level":3,"heirachical_structure":"Minor group","code":"825","title":"Contractors and supervisors, agriculture, horticulture and related operations and services"},{"level":4,"heirachical_structure":"Unit group","code":"8252","title":"Agricultural service contractors, farm supervisors and specialized livestock workers","description":"Agricultural service contractors, who own and operate their own businesses, provide agricultural services such as livestock and poultry breeding, soil preparation, crop planting, crop spraying, cultivating or harvesting. Farm supervisors supervise the work of general farm workers and harvesting labourers. Specialized livestock workers carry out feeding, health and breeding programs on dairy, beef, sheep, poultry, hog and other livestock farms."},{"level":4,"heirachical_structure":"Unit group","code":"8255","title":"Contractors and supervisors, landscaping, grounds maintenance and horticulture services","description":"This unit group includes landscaping and grounds maintenance contractors, who own and operate their own businesses. This group also includes supervisors who supervise and co-ordinate the activities of workers in the following unit groups: Nursery and Greenhouse Workers (8432) and Landscaping and Grounds Maintenance Labourers (8612). They are employed by landscaping companies, cemeteries, lawn care and tree service companies, nurseries and greenhouses and by landscaping operations of public works departments and private establishments."},{"level":3,"heirachical_structure":"Minor group","code":"826","title":"Fishing vessel masters and fishermen/women"},{"level":4,"heirachical_structure":"Unit group","code":"8261","title":"Fishing masters and officers","description":"Fishing masters and officers manage and operate saltwater and freshwater fishing vessels greater than 100 gross tonnes to pursue and land fish and other marine life. They are employed by establishments engaged in operating commercial fishing vessels."},{"level":4,"heirachical_structure":"Unit group","code":"8262","title":"Fishermen/women","description":"Fishermen/women operate fishing vessels to pursue and land fish and other marine life. They are usually self-employed owner-operators of fishing vessels."},{"level":2,"heirachical_structure":"Major group","code":"84","title":"Workers in natural resources, agriculture and related production"},{"level":3,"heirachical_structure":"Minor group","code":"841","title":"Mine service workers and operators in oil and gas drilling"},{"level":4,"heirachical_structure":"Unit group","code":"8411","title":"Underground mine service and support workers","description":"Underground mine service and support workers perform a range of duties related to the operation of orepasses, chutes and conveyor systems, the construction and support of underground structures, passages and roadways, and the supply of materials and supplies to support underground mining. They are employed by coal, metal and non-metallic mineral mines."},{"level":4,"heirachical_structure":"Unit group","code":"8412","title":"Oil and gas well drilling and related workers and services operators","description":"Oil and gas well drilling workers operate drilling and service rig machinery as intermediate members of the rig crew. Oil and gas well services operators drive trucks and operate specialized hydraulic pumping systems to place cement in wells or to treat wells with chemicals, sand mixtures or gases to stimulate production. Workers in this unit group are employed by drilling and well service contractors and by petroleum producing companies."},{"level":3,"heirachical_structure":"Minor group","code":"842","title":"Logging and forestry workers"},{"level":4,"heirachical_structure":"Unit group","code":"8421","title":"Chain saw and skidder operators","description":"Chain saw and skidder operators operate chain saws to fell, delimb and buck trees, and operate skidders to move or yard the felled trees from the logging site to the landing area for processing and transportation. They are employed by logging companies and contractors."},{"level":4,"heirachical_structure":"Unit group","code":"8422","title":"Silviculture and forestry workers","description":"Silviculture and forestry workers perform a variety of duties related to reforestation and to the management, improvement and conservation of forest lands. They are employed by logging companies, contractors and government services."},{"level":3,"heirachical_structure":"Minor group","code":"843","title":"Agriculture and horticulture workers"},{"level":4,"heirachical_structure":"Unit group","code":"8431","title":"General farm workers","description":"General farm workers plant, cultivate and harvest crops, raise livestock and poultry and maintain and repair farm equipment and buildings. This group includes operators of farm machinery. General farm workers are employed on crop, livestock, fruit, vegetable and specialty farms."},{"level":4,"heirachical_structure":"Unit group","code":"8432","title":"Nursery and greenhouse workers","description":"Nursery and greenhouse workers plant, cultivate and harvest trees, shrubs, flowers and plants, and serve nursery and greenhouse customers. They are employed in indoor and outdoor nurseries and greenhouses."},{"level":3,"heirachical_structure":"Minor group","code":"844","title":"Other workers in fishing and trapping and hunting occupations"},{"level":4,"heirachical_structure":"Unit group","code":"8441","title":"Fishing vessel deckhands","description":"Fishing vessel deckhands perform a variety of manual tasks on commercial fishing voyages, and maintain fishing vessels. They are employed by establishments that operate commercial fishing vessels and by self-employed fishermen/women."},{"level":4,"heirachical_structure":"Unit group","code":"8442","title":"Trappers and hunters","description":"Trappers and hunters trap and hunt wild animals for pelts or live sale. They are usually self-employed and work on a seasonal basis."},{"level":2,"heirachical_structure":"Major group","code":"86","title":"Harvesting, landscaping and natural resources labourers"},{"level":3,"heirachical_structure":"Minor group","code":"861","title":"Harvesting, landscaping and natural resources labourers"},{"level":4,"heirachical_structure":"Unit group","code":"8611","title":"Harvesting labourers","description":"Harvesting labourers assist other farm workers to harvest, sort and pack crops."},{"level":4,"heirachical_structure":"Unit group","code":"8612","title":"Landscaping and grounds maintenance labourers","description":"Landscaping and grounds maintenance labourers perform work to assist in the construction of landscapes and related structures, and to maintain lawns, gardens, athletic fields, golf courses, cemeteries, parks, landscaped interiors and other landscaped areas. They are employed by landscaping and lawn care companies, golf courses, cemeteries, and landscaping operations of public works departments and private establishments."},{"level":4,"heirachical_structure":"Unit group","code":"8613","title":"Aquaculture and marine harvest labourers","description":"This occupational group includes aquaculture support workers, marine plant gatherers, shellfish diggers and other labourers in aquaculture and fishing. Aquaculture support workers are employed by public or private fish hatcheries and commercial aquatic farms. Marine plant gatherers and shellfish harvesters may be self-employed."},{"level":4,"heirachical_structure":"Unit group","code":"8614","title":"Mine labourers","description":"Mine labourers carry out a variety of general labouring duties to assist in the extraction of coal, minerals and ore, and in other services in support of underground mining. They are employed by coal, metal and non-metallic mineral mines."},{"level":4,"heirachical_structure":"Unit group","code":"8615","title":"Oil and gas drilling, servicing and related labourers","description":"Labourers in this unit group carry out a variety of general labouring duties and operate equipment to assist in the drilling and servicing of oil and gas wells. This unit group also includes labourers who assist in geophysical prospecting for oil and gas. They are employed by drilling and well servicing contractors and by petroleum producing companies."},{"level":4,"heirachical_structure":"Unit group","code":"8616","title":"Logging and forestry labourers","description":"Logging and forestry labourers perform a variety of manual tasks such as attaching choker cables to logs, planting trees, clearing brush, spraying chemicals, cleaning up landing areas and assisting other workers in woodlands operations. They are employed by logging companies and contractors."},{"level":1,"heirachical_structure":"Broad occupational category","code":"9","title":"Occupations in manufacturing and utilities"},{"level":2,"heirachical_structure":"Major group","code":"92","title":"Processing, manufacturing and utilities supervisors and central control operators"},{"level":3,"heirachical_structure":"Minor group","code":"921","title":"Supervisors, processing and manufacturing occupations"},{"level":4,"heirachical_structure":"Unit group","code":"9211","title":"Supervisors, mineral and metal processing","description":"Supervisors, mineral and metal processing, supervise and co-ordinate the activities of workers in the following groups: Central Control and Process Operators, Mineral and Metal Processing (9231), Machine Operators and Related Workers in Metal and Mineral Products Processing and Manufacturing (941) and Labourers in Mineral and Metal Processing (9611). They are employed in mineral ore and metal processing plants such as copper, lead and zinc refineries, uranium processing plants, steel mills, aluminum plants, precious metal refineries, cement processing plants, clay, glass and stone processing plants and foundries."},{"level":4,"heirachical_structure":"Unit group","code":"9212","title":"Supervisors, petroleum, gas and chemical processing and utilities","description":"Supervisors in this unit group supervise and co-ordinate the activities of workers in the following unit groups: Petroleum, Gas and Chemical Process Operators (9232), Power Engineers and Power Systems Operators (9241), Water and Waste Treatment Plant Operators (9243), Chemical Plant Machine Operators (9421) and Labourers in Chemical Products Processing and Utilities (9613). They are employed by petroleum and natural gas processing, pipeline and petrochemical companies, chemical and pharmaceutical companies, electric power utilities, water and waste treatment utilities and in a range of other industries and institutions."},{"level":4,"heirachical_structure":"Unit group","code":"9213","title":"Supervisors, food, beverage and associated products processing","description":"Supervisors in this unit group supervise and co-ordinate the activities of workers who operate processing and packaging machines, and workers who grade food, beverage and associated products. They are employed in fruit and vegetable processing plants, dairies, flour mills, bakeries, sugar refineries, fish plants, meat plants, breweries and other food, beverage and associated products processing establishments."},{"level":4,"heirachical_structure":"Unit group","code":"9214","title":"Supervisors, plastic and rubber products manufacturing","description":"Supervisors in this unit group supervise and co-ordinate the activities of workers who operate processing machines and who fabricate, assemble and inspect rubber or plastic products. They are employed by rubber and plastic products manufacturing companies and in plastic parts divisions of other manufacturing companies."},{"level":4,"heirachical_structure":"Unit group","code":"9215","title":"Supervisors, forest products processing","description":"Supervisors in this unit group supervise and co-ordinate the activities of workers in the following groups: Pulping, Papermaking and Coating Control Operators (9235), Machine Operators and Related Workers in Pulp and Paper Production and Wood Processing and Manufacturing (943) and Labourers in Wood, Pulp and Paper Processing (9614). They are employed by pulp and paper companies, paper converting companies, sawmills, planing mills, wood treatment plants, waferboard plants and other wood processing companies."},{"level":4,"heirachical_structure":"Unit group","code":"9217","title":"Supervisors, textile, fabric, fur and leather products processing and manufacturing","description":"Supervisors in this unit group supervise and co-ordinate the activities of workers engaged in textile, fabric, fur and leather products processing and manufacturing. They are employed by textile manufacturing companies, tanneries and other manufacturers of fabric, fur and leather products."},{"level":3,"heirachical_structure":"Minor group","code":"922","title":"Supervisors, assembly and fabrication"},{"level":4,"heirachical_structure":"Unit group","code":"9221","title":"Supervisors, motor vehicle assembling","description":"Supervisors in this unit group supervise and co-ordinate the activities of workers in motor vehicle production departments. They are employed in plants which manufacture automobiles, vans and light trucks."},{"level":4,"heirachical_structure":"Unit group","code":"9222","title":"Supervisors, electronics manufacturing","description":"Supervisors in this unit group supervise and co-ordinate the activities of workers who assemble, fabricate, test, repair and inspect electronic parts, components and systems. They are employed in electronics manufacturing plants."},{"level":4,"heirachical_structure":"Unit group","code":"9223","title":"Supervisors, electrical products manufacturing","description":"Supervisors in this unit group supervise and co-ordinate the activities of workers who assemble, fabricate and inspect electrical components, appliances, motors and industrial equipment. They are employed by companies that manufacture electrical products."},{"level":4,"heirachical_structure":"Unit group","code":"9224","title":"Supervisors, furniture and fixtures manufacturing","description":"Supervisors in this unit group supervise and co-ordinate the activities of workers who manufacture furniture and fixtures made of wood or other materials. They are employed in furniture and fixtures manufacturing establishments."},{"level":4,"heirachical_structure":"Unit group","code":"9226","title":"Supervisors, other mechanical and metal products manufacturing","description":"Supervisors in this unit group supervise and co-ordinate the activities of workers who fabricate, assemble and inspect mechanical and metal products, such as aircraft and aircraft parts, heavy trucks, buses, trailers, motor vehicle engines, transmissions, heating equipment, commercial refrigeration and similar metal products. They are employed by a wide variety of manufacturing companies."},{"level":4,"heirachical_structure":"Unit group","code":"9227","title":"Supervisors, other products manufacturing and assembly","description":"This unit group includes supervisors, not elsewhere classified, who supervise and co-ordinate the activities of workers who assemble, fabricate and inspect a variety of products, such as jewellery, clocks and watches, millwork, sporting goods, toys and other miscellaneous products. They are employed in a wide variety of manufacturing companies."},{"level":3,"heirachical_structure":"Minor group","code":"923","title":"Central control and process operators in processing and manufacturing"},{"level":4,"heirachical_structure":"Unit group","code":"9231","title":"Central control and process operators, mineral and metal processing","description":"Central control and process operators, mineral and metal processing, operate and monitor multi-function process control machinery and equipment to control the processing of mineral ores, metals or cement. They are employed in mineral ore and metal processing plants such as copper, lead and zinc refineries, uranium processing plants, steel mills, aluminum plants, precious metal refineries and cement processing plants."},{"level":4,"heirachical_structure":"Unit group","code":"9232","title":"Petroleum, gas and chemical process operators","description":"Petroleum, gas and chemical process operators monitor and operate petroleum, petrochemical and chemical plants and monitor, adjust and maintain processing units and equipment in these plants. They are employed by petroleum and natural gas processing, pipeline and petrochemical companies and industrial, agricultural and specialty chemical and pharmaceutical companies."},{"level":4,"heirachical_structure":"Unit group","code":"9235","title":"Pulping, papermaking and coating control operators","description":"Pulping, papermaking and coating control operators operate and monitor multi-function process control machinery and equipment to control the processing of wood, scrap pulp, recyclable paper, cellulose materials, paper pulp and paperboard. They are employed by pulp and paper companies."},{"level":3,"heirachical_structure":"Minor group","code":"924","title":"Utilities equipment operators and controllers"},{"level":4,"heirachical_structure":"Unit group","code":"9241","title":"Power engineers and power systems operators","description":"Power engineers operate and maintain reactors, turbines, boilers, generators, stationary engines and auxiliary equipment to generate electrical power and to provide heat, light, refrigeration and other utility services for commercial, industrial and institutional buildings and other work sites. Power systems operators monitor and operate switchboards and related equipment in electrical control centres to control the distribution of electrical power in transmission networks. They are employed by power generation plants, electrical power utilities, manufacturing plants, hospitals, universities and government and commercial establishments."},{"level":4,"heirachical_structure":"Unit group","code":"9243","title":"Water and waste treatment plant operators","description":"Water treatment plant operators monitor and operate computerized control systems and related equipment in water filtration and treatment plants to regulate the treatment and distribution of water. Liquid waste plant operators monitor and operate computerized control systems and related equipment in wastewater, sewage treatment and liquid waste plants to regulate the treatment and disposal of sewage and wastes. They are employed by municipal governments and industrial facilities. This unit group also includes waste treatment plant operators in composting plants and other waste management facilities."},{"level":2,"heirachical_structure":"Major group","code":"94","title":"Processing and manufacturing machine operators and related production workers"},{"level":3,"heirachical_structure":"Minor group","code":"941","title":"Machine operators and related workers in mineral and metal products processing and manufacturing"},{"level":4,"heirachical_structure":"Unit group","code":"9411","title":"Machine operators, mineral and metal processing","description":"Workers in this unit group operate single-function machines or machinery that is part of a larger production process to process mineral ore and metal products. They are employed in mineral ore and metal processing plants such as copper, lead and zinc refineries, uranium processing plants, steel mills, aluminum plants, precious metal refineries and cement processing plants."},{"level":4,"heirachical_structure":"Unit group","code":"9412","title":"Foundry workers","description":"This unit group includes workers who make foundry moulds and cores by hand or machine, cast molten metal, and operate furnaces in the foundry industry. They are employed by metal foundries and foundry departments of metal products manufacturing companies."},{"level":4,"heirachical_structure":"Unit group","code":"9413","title":"Glass forming and finishing machine operators and glass cutters","description":"Machine operators in this unit group operate multi-function process control machinery or single function machines to melt, form, cut or finish flat glass, glassware, bottles, and other glass products. Glass cutters cut flat glass of various thicknesses to specified sizes and shapes by hand. They are employed by glass and glass products manufacturing companies."},{"level":4,"heirachical_structure":"Unit group","code":"9414","title":"Concrete, clay and stone forming operators","description":"This unit group includes workers who cast and finish concrete products, operate machines to extrude, mould, press and bake clay products, and operate machines to form, cut and finish stone products. They are employed by concrete, clay and stone products manufacturing companies."},{"level":4,"heirachical_structure":"Unit group","code":"9415","title":"Inspectors and testers, mineral and metal processing","description":"Inspectors and testers in this unit group inspect, grade, sample or test raw materials and products from mineral ore and metal processing operations. They are employed in mineral ore and metal processing plants such as copper, lead and zinc refineries, uranium processing plants, steel mills, aluminum plants, precious metal refineries, cement processing plants, clay, glass and stone processing plants and foundries."},{"level":4,"heirachical_structure":"Unit group","code":"9416","title":"Metalworking and forging machine operators","description":"Light metalworking machine operators operate metalworking machines which shape and form sheet or other light metal into parts or products. Heavy metalworking machine operators operate metalworking machines which shape and form steel or other heavy metal into parts or products. Forging machine operators operate forging machines to form and shape metal into various shapes and sizes and impart desired strength, hardness or other characteristics. Light metalworking machine operators are employed by sheet metal products manufacturing companies, sheet metal shops and other light metal products manufacturing establishments. Heavy metalworking machine operators are employed by structural steel fabrication, boiler and platework manufacturing companies, heavy machinery manufacturing companies and in the shipbuilding industry. Forging machine operators are employed primarily in the fabricated metal products, machinery and transportation equipment manufacturing industries."},{"level":4,"heirachical_structure":"Unit group","code":"9417","title":"Machining tool operators","description":"Machining tool operators set up and operate or tend metal-cutting machines designed for repetitive machining work. They are employed by metal products and other manufacturing companies and in machine shops. This unit group also includes workers who etch or chemically mill metal pieces."},{"level":4,"heirachical_structure":"Unit group","code":"9418","title":"Other metal products machine operators","description":"This unit group includes metal products machine operators, not elsewhere classified, who operate one or more automatic or multi-purpose machines to produce a variety of metal parts and products, such as wire mesh, nails, bolts and chains. They are employed by a wide variety of metal products manufacturing companies."},{"level":3,"heirachical_structure":"Minor group","code":"942","title":"Machine operators and related workers in chemical, plastic and rubber processing"},{"level":4,"heirachical_structure":"Unit group","code":"9421","title":"Chemical plant machine operators","description":"Chemical plant machine operators monitor and operate units and machinery to blend, mix, process and package a wide range of specialty chemicals, pharmaceuticals, cleaning and toiletry products. They are primarily employed in chemical, cleaning compound, ink and adhesive industries, but may also be employed by chemical processing departments in other industries."},{"level":4,"heirachical_structure":"Unit group","code":"9422","title":"Plastics processing machine operators","description":"Plastics processing machine operators set up and operate plastic mixing, calendering, extruding and moulding processing machines used in the manufacture of plastic parts and plastic products. They are employed by plastic products manufacturing companies."},{"level":4,"heirachical_structure":"Unit group","code":"9423","title":"Rubber processing machine operators and related workers","description":"Workers in this unit group operate rubber processing machinery and assemble and inspect rubber products. They are employed by tire manufacturers and other rubber products manufacturing companies."},{"level":3,"heirachical_structure":"Minor group","code":"943","title":"Machine operators and related workers in pulp and paper production and wood processing and manufacturing"},{"level":4,"heirachical_structure":"Unit group","code":"9431","title":"Sawmill machine operators","description":"Sawmill machine operators operate, monitor and control automated lumbermill equipment to saw timber logs into rough lumber; saw, trim and plane rough lumber into dressed lumber of various sizes; and saw or split shingles and shakes. They are employed in sawmills and planing mills."},{"level":4,"heirachical_structure":"Unit group","code":"9432","title":"Pulp mill machine operators","description":"Pulp mill machine operators operate and monitor various types of processing machinery and equipment to produce pulp. They are employed by pulp and paper companies."},{"level":4,"heirachical_structure":"Unit group","code":"9433","title":"Papermaking and finishing machine operators","description":"Papermaking and finishing machine operators operate process machinery and equipment and assist papermaking and coating control operators to produce, coat and finish paper. They are employed by pulp and paper companies."},{"level":4,"heirachical_structure":"Unit group","code":"9434","title":"Other wood processing machine operators","description":"Machine operators in this unit group operate and tend wood processing equipment and machines to remove bark from logs, produce wood chips, preserve and treat wood, and produce waferboards, particleboards, hardboards, insulation boards, plywood, veneers and similar wood products. They are employed in sawmills, woodrooms of pulp mills, planing mills, wood treatment plants, waferboard plants and other wood processing plants."},{"level":4,"heirachical_structure":"Unit group","code":"9435","title":"Paper converting machine operators","description":"Paper converting machine operators operate various machines which fabricate and assemble paper products such as paper bags, containers, boxes, envelopes and similar articles. They are employed by paper products manufacturing companies."},{"level":4,"heirachical_structure":"Unit group","code":"9436","title":"Lumber graders and other wood processing inspectors and graders","description":"Lumber graders and other wood processing inspectors and graders inspect and grade lumber, shingles, veneer, waferboard and similar wood products to identify defects, ensure conformance to company specifications and classify products according to industry standards. They are employed by sawmills, planing mills, wood treatment plants, waferboard plants and other wood processing companies."},{"level":4,"heirachical_structure":"Unit group","code":"9437","title":"Woodworking machine operators","description":"Woodworking machine operators set up, program and operate one or more woodworking machines to fabricate or repair wooden parts for furniture, fixtures or other wood products. They are employed in furniture, fixture and other wood products manufacturing establishments."},{"level":3,"heirachical_structure":"Minor group","code":"944","title":"Machine operators and related workers in textile, fabric, fur and leather products processing and manufacturing"},{"level":4,"heirachical_structure":"Unit group","code":"9441","title":"Textile fibre and yarn, hide and pelt processing machine operators and workers","description":"Textile fibre and yarn processing machine operators and workers operate machines to prepare textile fibres; spin, wind or twist yarn or thread; and bleach, dye or finish yarn, thread, cloth or textile products. They are employed by textile manufacturing companies. Hide and pelt processing machine operators and workers trim, scrape, clean, tan, buff and dye animal hides, pelts or skins to produce leather stock and finished furs. They are employed by leather tanning, fur dressing and leather and fur dyeing establishments."},{"level":4,"heirachical_structure":"Unit group","code":"9442","title":"Weavers, knitters and other fabric making occupations","description":"Operators in this unit group operate machines to process yarn or thread into woven, non-woven and knitted products such as cloth, lace, carpets, rope, industrial fabric, hosiery and knitted garments or to quilt and embroider fabric. This unit group also includes workers who perform activities such as reproducing patterns, drawing-in and tying warps and setting up looms. They are employed by textile companies and by garment and mattress manufacturing companies."},{"level":4,"heirachical_structure":"Unit group","code":"9445","title":"Fabric, fur and leather cutters","description":"Fabric cutters cut fabric to make parts for garments, linens and other articles. Fur cutters cut fur pelts to make parts for garments and other fur articles. Leather cutters cut leather to make parts for shoes, garments and other leather articles. Fabric cutters are employed by clothing and textile manufacturers and other manufacturers of fabric products. Fur cutters are employed by furriers and fur products manufacturers. Leather cutters are employed by shoe and other leather products manufacturers."},{"level":4,"heirachical_structure":"Unit group","code":"9446","title":"Industrial sewing machine operators","description":"Industrial sewing machine operators operate sewing machines to sew fabric, fur, leather or synthetic materials to produce or repair garments and other articles. They are employed in clothing, footwear, textile products, fur products and other manufacturing establishments and by furriers."},{"level":4,"heirachical_structure":"Unit group","code":"9447","title":"Inspectors and graders, textile, fabric, fur and leather products manufacturing","description":"Inspectors and graders in this unit group inspect and grade textile, fabric, fur and leather products. They are employed by textile companies, leather tanning and fur dressing establishments and garment, fur and leather products manufacturers."},{"level":3,"heirachical_structure":"Minor group","code":"946","title":"Machine operators and related workers in food, beverage and associated products processing"},{"level":4,"heirachical_structure":"Unit group","code":"9461","title":"Process control and machine operators, food, beverage and associated products processing","description":"Process control and machine operators in this unit group operate multi-function process control machinery and single-function machines to process and package food, beverage and associated products. They are employed in fruit and vegetable processing plants, dairies, flour mills, bakeries, sugar refineries, meat plants, breweries, leaf tobacco products plants and other food, beverage and associated products processing establishments."},{"level":4,"heirachical_structure":"Unit group","code":"9462","title":"Industrial butchers and meat cutters, poultry preparers and related workers","description":"Workers in this unit group prepare meat and poultry for further processing, for packaging or for marketing. They are employed in meat and poultry slaughtering, processing and packing establishments."},{"level":4,"heirachical_structure":"Unit group","code":"9463","title":"Fish and seafood plant workers","description":"This unit group includes fish and seafood plant machine operators who set up and operate machinery to process and package fish and seafood products, and fish and seafood plant cutters and cleaners who cut, trim and clean fish or seafood by hand. Fish and seafood plant workers are employed in fish and seafood processing plants."},{"level":4,"heirachical_structure":"Unit group","code":"9465","title":"Testers and graders, food, beverage and associated products processing","description":"Testers and graders in this unit group test or grade ingredients and finished food, beverage or associated products to ensure conformance to company standards. They are employed in fruit and vegetable processing plants, dairies, flour mills, bakeries, sugar refineries, fish plants, meat plants, breweries and other food, beverage and associated products processing plants."},{"level":3,"heirachical_structure":"Minor group","code":"947","title":"Printing equipment operators and related occupations"},{"level":4,"heirachical_structure":"Unit group","code":"9471","title":"Plateless printing equipment operators","description":"This unit group includes workers who operate laser printers, computerized high speed colour copiers and other printing machines to print text, illustrations and designs on a wide variety of materials such as paper, plastic, glass, leather, and metal. They are employed in rapid printing services, newspaper and magazine publishing companies, commercial printing companies and in manufacturing and other establishments that have in-house printing facilities."},{"level":4,"heirachical_structure":"Unit group","code":"9472","title":"Camera, platemaking and other prepress occupations","description":"This unit group includes prepress technicians who operate various computer controlled systems to perform prepress activities and workers who operate graphic arts cameras and scanners, assemble film and negatives and prepare, engrave and etch printing plates or cylinders for various types of printing presses. They are employed in firms that specialize in colour graphics or platemaking and cylinder preparation, commercial publishing and printing companies, newspapers, magazines, and in various establishments in the public and private sectors that have in-house printing departments."},{"level":4,"heirachical_structure":"Unit group","code":"9473","title":"Binding and finishing machine operators","description":"Binding and finishing machine operators set up, operate or oversee the operation of machines, equipment or computerized units that bind and finish printed material. Workers who perform finishing operations in the paper, carton and packaging industries, as well as those who encode and stamp plastic cards, are included in this unit group. They are employed by binderies, commercial printing companies, newspapers, magazines, and other publishing companies, and establishments in both the public and private sectors that have in-house printing, binding and finishing departments."},{"level":4,"heirachical_structure":"Unit group","code":"9474","title":"Photographic and film processors","description":"Photographic and film processors process and finish still photographic film and motion picture film. They are employed in film processing laboratories and retail photofinishing establishments."},{"level":2,"heirachical_structure":"Major group","code":"95","title":"Assemblers in manufacturing"},{"level":3,"heirachical_structure":"Minor group","code":"952","title":"Mechanical, electrical and electronics assemblers"},{"level":4,"heirachical_structure":"Unit group","code":"9521","title":"Aircraft assemblers and aircraft assembly inspectors","description":"Aircraft assemblers assemble, fit and install prefabricated parts to manufacture fixed wing or rotary wing aircraft or aircraft subassemblies. Aircraft assembly inspectors inspect aircraft assemblies for adherence to engineering specifications. They are employed by aircraft and aircraft subassembly manufacturers."},{"level":4,"heirachical_structure":"Unit group","code":"9522","title":"Motor vehicle assemblers, inspectors and testers","description":"Motor vehicle assemblers assemble and install prefabricated motor vehicle parts and components to form subassemblies and finished motor vehicles. Motor vehicle inspectors and testers inspect and test parts, subassemblies, accessories and finished products to ensure proper performance and conformity to quality standards. They are employed in plants which manufacture automobiles, vans and light trucks."},{"level":4,"heirachical_structure":"Unit group","code":"9523","title":"Electronics assemblers, fabricators, inspectors and testers","description":"Electronics assemblers and fabricators assemble and fabricate electronic equipment, parts and components. Electronics inspectors and testers inspect and test electronic and electromechanical assemblies, subassemblies, parts and components to ensure conformance to prescribed standards. They are employed in electronics manufacturing plants."},{"level":4,"heirachical_structure":"Unit group","code":"9524","title":"Assemblers and inspectors, electrical appliance, apparatus and equipment manufacturing","description":"Assemblers in this unit group assemble prefabricated parts to produce household, commercial and industrial appliances and equipment. Inspectors in this unit group inspect and test assembled products. Workers who set up and prepare assembly lines for operation are included in this unit group. Workers in this unit group are employed by electrical appliance and electrical equipment manufacturing companies."},{"level":4,"heirachical_structure":"Unit group","code":"9525","title":"Assemblers, fabricators and inspectors, industrial electrical motors and transformers","description":"This unit group includes workers who assemble, fabricate, fit, wire and inspect heavy-duty industrial electrical equipment. They are employed by manufacturers of industrial electric motors, transformers, control equipment, railway locomotives, transit vehicles and other heavy electrical equipment."},{"level":4,"heirachical_structure":"Unit group","code":"9526","title":"Mechanical assemblers and inspectors","description":"Assemblers in this unit group assemble a wide variety of mechanical products such as trucks, buses, snowmobiles, garden tractors, automotive engines, transmissions, outboard motors, gearboxes, hydraulic pumps and sewing machines. Inspectors in this unit group check and inspect subassemblies and finished products to ensure proper quality and product specifications. They are employed by machinery and transportation equipment manufacturers and by other manufacturing companies."},{"level":4,"heirachical_structure":"Unit group","code":"9527","title":"Machine operators and inspectors, electrical apparatus manufacturing","description":"Machine operators in this unit group operate machinery or equipment to fabricate complete products or parts for use in the assembly of electrical appliances and equipment, and electrical apparatus, such as batteries, fuses and plugs. Inspectors in this unit group inspect and test completed parts and production items. Workers in this unit group are employed by electrical appliance and electrical equipment manufacturing companies."},{"level":3,"heirachical_structure":"Minor group","code":"953","title":"Other assembly and related occupations"},{"level":4,"heirachical_structure":"Unit group","code":"9531","title":"Boat assemblers and inspectors","description":"Boat assemblers assemble wooden, fibreglass and metal boats, such as sailboats, motorboats, canoes and cabin cruisers. Boat inspectors check assembled boats to ensure proper product quality. They are employed by boat and marine craft manufacturing companies."},{"level":4,"heirachical_structure":"Unit group","code":"9532","title":"Furniture and fixture assemblers and inspectors","description":"Assemblers in this unit group assemble parts to form subassemblies or complete articles of furniture and fixtures. Inspectors in this unit group inspect furniture and fixture subassemblies and finished products to ensure product quality. They are employed by furniture manufacturing companies."},{"level":4,"heirachical_structure":"Unit group","code":"9533","title":"Other wood products assemblers and inspectors","description":"Assemblers in this unit group assemble a variety of wood products and millwork, such as window sashes and doors. Inspectors in this unit group inspect wood products to ensure product quality. They are employed by establishments engaged in manufacturing a variety of wood and millwork products."},{"level":4,"heirachical_structure":"Unit group","code":"9534","title":"Furniture finishers and refinishers","description":"Furniture finishers finish new wood or metal furniture to specified colour and finish. They are employed in furniture manufacturing plants, retail furniture stores or refinishing and repair shops. Furniture refinishers refinish repaired, used or old furniture. They are employed in furniture refinishing and repair shops or they may be self-employed."},{"level":4,"heirachical_structure":"Unit group","code":"9535","title":"Plastic products assemblers, finishers and inspectors","description":"This unit group includes workers who assemble, finish and inspect plastic parts and finished products. They are employed by plastic products manufacturing companies and plastic parts divisions of aircraft or other manufacturing companies."},{"level":4,"heirachical_structure":"Unit group","code":"9536","title":"Industrial painters, coaters and metal finishing process operators","description":"Industrial painters and coaters operate and tend machines or use brushes and spray equipment to apply paint, enamel, lacquer or other non-metallic protective and decorative coatings to surfaces of various products. Metal finishing process operators operate machines or equipment to deposit metallized substances on workpieces and surfaces to provide decorative, protective and restorative coatings. These workers are employed by manufacturing companies and custom refinishing, coating and plating shops."},{"level":4,"heirachical_structure":"Unit group","code":"9537","title":"Other products assemblers, finishers and inspectors","description":"This unit group includes assemblers, finishers and inspectors, not elsewhere classified, who assemble, finish and inspect components or products of various materials, such as jewellery, silverware, buttons, pencils, non-prescription lenses, brushes, clocks and watches, musical instruments, sporting goods, toys and other miscellaneous products. They are employed by a wide variety of manufacturing companies."},{"level":2,"heirachical_structure":"Major group","code":"96","title":"Labourers in processing, manufacturing and utilities"},{"level":3,"heirachical_structure":"Minor group","code":"961","title":"Labourers in processing, manufacturing and utilities"},{"level":4,"heirachical_structure":"Unit group","code":"9611","title":"Labourers in mineral and metal processing","description":"Labourers in this unit group perform material handling, clean-up, packaging and other elemental activities related to mineral ore and metal processing. They are employed in mineral ore and metal processing plants such as copper, lead and zinc refineries, uranium processing plants, steel mills, aluminum plants, precious metal refineries, cement processing plants, clay, glass and stone processing plants and foundries."},{"level":4,"heirachical_structure":"Unit group","code":"9612","title":"Labourers in metal fabrication","description":"Labourers in this unit group remove excess metal and unwanted materials from metal parts, castings and other metal products and perform other labouring activities. They are employed in structural steel, boiler and platework fabrication plants, heavy machinery manufacturing plants, sheet metal fabrication shops, shipbuilding and other metal products manufacturing companies."},{"level":4,"heirachical_structure":"Unit group","code":"9613","title":"Labourers in chemical products processing and utilities","description":"Labourers in this unit group carry out a variety of material handling, cleaning and routine general labouring activities. They are employed by petroleum and natural gas processing, pipeline and petrochemical, chemical and pharmaceutical companies, and by electrical, water and waste treatment utilities and services."},{"level":4,"heirachical_structure":"Unit group","code":"9614","title":"Labourers in wood, pulp and paper processing","description":"Labourers in this unit group carry out a variety of general labouring and routine wood processing activities and assist pulp mill and papermaking machine operators. They are employed by pulp and paper, and paper converting companies, sawmills, planing mills, wood treatment plants, waferboard plants and other wood processing companies."},{"level":4,"heirachical_structure":"Unit group","code":"9615","title":"Labourers in rubber and plastic products manufacturing","description":"Labourers in this unit group assist machine operators, transport materials and perform similar tasks. They are employed by rubber and plastic products manufacturing companies."},{"level":4,"heirachical_structure":"Unit group","code":"9616","title":"Labourers in textile processing","description":"Labourers in textile processing perform a variety of manual duties to assist in processing fibres into yarn or thread, or to assist in weaving, knitting, bleaching, dyeing or finishing textile fabrics or other textile products. They are employed by textile manufacturing companies."},{"level":4,"heirachical_structure":"Unit group","code":"9617","title":"Labourers in food, beverage and associated products processing","description":"Labourers in this unit group perform material handling, clean-up, packaging and other elemental activities related to food, beverage and associated products processing. They are employed in fruit and vegetable processing plants, dairies, flour mills, bakeries, sugar refineries, meat plants, breweries and other food, beverage and associated products processing and packaging plants."},{"level":4,"heirachical_structure":"Unit group","code":"9618","title":"Labourers in fish and seafood processing","description":"Labourers in this unit group perform clean-up, packaging, material handling and other elemental activities related to fish and seafood processing. They are employed in fish and seafood processing and packaging plants."},{"level":4,"heirachical_structure":"Unit group","code":"9619","title":"Other labourers in processing, manufacturing and utilities","description":"This unit group includes labourers, not elsewhere classified, who perform material handling, clean-up, packaging and other elemental activities in processing, manufacturing and utilities. They are employed by companies that manufacture products such as clothing, footwear, furniture and electrical and electronic products and by printing and packaging companies."},{},{},{},{},{},{},{},{},{},{},{},{},{},{},{},{},{},{},{},{},{},{},{},{},{},{},{}]
